# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= {0} je naletel na napako:
authorization_code_problem=Poteka zamenjava pooblastitvene kode za \u017eeton dostopa: {0}
authorization_code_problem.explanation=Med izmenjavo pooblastitvene kode za \u017eeton dostopa je pri\u0161lo do napake.
authorize_problem=Inicira se postopek poobla\u0161\u010danja za {0}.
authorize_problem.explanation=Med iniciranjem postopka poobla\u0161\u010danja je pri\u0161lo do napake.
callback_problem=Poteka obdelava odgovora na preusmeritev: {0}
callback_problem.explanation=Med obdelovanjem odgovora na preusmeritev iz ponudnika storitev je pri\u0161lo do napake.
client_credentials_problem=Poteka pridobivanje \u017eetona dostopa za odjemalca z naslednjimi poverilnicami odjemalca: {0}
client_credentials_problem.explanation=Med pridobivanjem \u017eetona dostopa v toku poverilnic odjemalca je pri\u0161lo do napake.
fetch_init_problem=OAuth2Request se inicializira: {0}
fetch_init_problem.explanation=Med inicializiranjem pridobivanja OAuth2Request je pri\u0161lo do napake nizke ravni.
fetch_problem=izvajanje OAuth2Request.fetch() : {0}
fetch_problem.explanation=Med izdajanjem pridobitve OAuth2Request je pri\u0161lo do napake.
gadget_spec_problem=Poteka obdelava naslednje specifikacije pripomo\u010dka: {0}
gadget_spec_problem.explanation=Specifikacije pripomo\u010dka ni bilo mogo\u010de najti. Prosite skrbnika, da pripomo\u010dek konfigurira tako, da bo deloval z OAuth2.0.
get_oauth2_accessor_problem=pridobivanje OAuth2Accessor za OAuth2Request : {0}
get_oauth2_accessor_problem.explanation=Zgodila se je napaka. Skrbnika prosite, naj ustvari vezavo odjemalca OAuth2.0 za ta pripomo\u010dek in storitev.
lookup_spec_problem=Poteka pridobivanje specifikacije pripomo\u010dka: {0}
lookup_spec_problem.explanation=Specifikacije pripomo\u010dka ni bilo mogo\u010de najti. Prosite skrbnika, da pripomo\u010dek konfigurira tako, da bo deloval z OAuth2.0.
missing_fetch_params=Naslednji zahtevani parametri pridobivanja manjkajo: {0}
missing_fetch_params.explanation=Metoda fetch() je bila poklicana z neveljavnimi parametri.
missing_server_response=Med odgovorom ponudnika storitev OAuth2.0 je pri\u0161lo do napake: {0}
missing_server_response.explanation=Stre\u017enik je ustvaril veljaven OAuth2Request, toda ni mogel izdati zahteve ali pridobiti veljavnega odgovora od ponudnika storitev.
no_response_handler=Nadzornik odgovorov ni obdelal naslednjega odgovora: {0}
no_response_handler.explanation=Nadzornik odgovorov ne obstaja za obdelavo pooblastitve in zaklju\u010dnih to\u010dk \u017eetona. AuthorizationEndpointResponseHandler ali TokenEndpointResponseHandler.
no_gadget_spec=Specifikacije pripomo\u010dka za {0} ni mogo\u010de najti.
no_gadget_spec.explanation=Specifikacije pripomo\u010dka ni bilo mogo\u010de najti. Prosite skrbnika, da pripomo\u010dek konfigurira tako, da bo deloval z OAuth2.0.
refresh_token_problem=Poteka zamenjava \u017eetona osve\u017eitve za \u017eeton dostopa: {0}
refresh_token_problem.explanation=Med zamenjavo \u017eetona osve\u017eitve za \u017eeton dostopa je pri\u0161lo do napake.
secret_encryption_problem=Poteka \u0161ifriranje skrivnosti \u017eetona za trajnost: {0}
secret_encryption_problem.explanation=Med shranjevanjem skrivnosti OAuth2.0 s ponujenim modulom za \u0161ifriranje je pri\u0161lo do napake.
access_denied=Dostop je bil zavrnjen.
access_denied.explanation=Uporabnik je zavrnil ali preklical pooblastilo s ponudnikom storitev.
invalid_client=Odjemalec ni veljaven: {0}
invalid_client.explanation= Odjemalca ni mogo\u010de overiti, najverjetneje zato, ker ni znan, overitev odjemalca ni bila vklju\u010dena ali metoda overjanja ni podprta.
invalid_grant=Odobritev pooblastitve ni veljavna: {0}
invalid_grant.explanation=Odobritev pooblastitve ni veljavna, je potekla, je bila preklicana ali se ne ujema z URI-jem preusmeritve, uporabljenim v zahtevi za pooblastitev, ali je bila izdana za drugega odjemalca. Odobritev pooblastitve lahko vklju\u010duje pooblastitveno kodo, poverilnice lastnika virov ali poverilnice odjemalca.
invalid_request=Zahteva ni veljavna: {0}
invalid_request.explanation=Zahteva ni veljavna, ker ne vsebuje obveznih parametrov, vklju\u010duje nepodprto vrednost parametra, ponovi parameter, vklju\u010duje ve\u010d poverilnic, uporablja ve\u010d kot en mehanizem za overjanje odjemalca ali je kako druga\u010de napa\u010dno oblikovana.
invalid_scope=Obmo\u010dje ni veljavno: {0}
invalid_scope.explanation=Zahtevano obmo\u010dje ni veljavno, je neznano, napa\u010dno oblikovano ali presega obmo\u010dje, ki ga je odobril lastnik vira.
server_error=Zgodila se je napaka stre\u017enika: {0}
server_error.explanation=Stre\u017enik za poobla\u0161\u010danje je naletel na nepri\u010dakovano stanje, ki mu je prepre\u010dilo, da bi izpolnil zahtevo.
server_rejected_request=Stre\u017enik je zavrnil zahtevo: statusna koda = {0}
server_rejected_request.explanation=Stre\u017enik je ustvaril OAuth2Request, toda ponudnik storitev ga je zavrnil.
temporarily_unavailable=Storitev trenutno ni na voljo: {0}
temporarily_unavailable.explanation=Stre\u017enik za poobla\u0161\u010danje ne more obravnavati zahteve, ker je za\u010dasno preobremenjen ali je v vzdr\u017eevalnem na\u010dinu.
token_response_problem=Poteka obdelava odgovora iz zaklju\u010dne to\u010dke \u017eetona: {0}
token_response_problem.explanation=Zaklju\u010dna to\u010dka \u017eetona je poslala odgovor, ki ga stre\u017enik ni mogel obdelati.
unauthorized_client=Odjemalec ni poobla\u0161\u010den: {0}
unauthorized_client.explanation=Odjemalec ni poobla\u0161\u010den za zahtevanje \u017eetona dostopa z uporabo te metode.
unsupported_grant_type=Vrsta odobritve ni podprta: {0}
unsupported_grant_type.explanation=Stre\u017enik za poobla\u0161\u010danje ne podpira pridobivanja \u017eetona dostopa z uporabo te metode.
unsupported_response_type=Vrsta odgovora ni podprta: {0}
unsupported_response_type.explanation=Stre\u017enik za poobla\u0161\u010danje ne podpira pridobivanja pooblastitvene kode z uporabo te metode.
mac_token_problem=Zahtevan je \u017eeton mac: {0}
mac_token_problem.explanation=\u017detona mac v zahtevi ni bilo mogo\u010de dodati stre\u017eniku virov.
bearer_token_problem=Zahtevan je \u017eeton nosilca: {0}
bearer_token_problem.explanation=\u017detona nosilca v zahtevi ni bilo mogo\u010de dodati stre\u017eniku virov.
authentication_problem=Poteka dodajanje overjanja odjemalca: {0}
authentication_problem.explanation=Glav overjanja ni bilo mogo\u010de dodati v zahtevo.
unknown_problem=Zgodila se je neznana napaka: {0}
unknown_problem.explanation=Skrbnika sistema prosite, naj razi\u0161\u010de te\u017eavo.
code_grant_problem=Poteka pridobivanje \u017eetona dostopa iz pooblastitvene kode: {0}
code_grant_problem.explanation=Med pridobivanjem toka pooblastitvene kode je pri\u0161lo do napake.
