# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= {0} \u049b\u0430\u0442\u0435\u0433\u0435 \u0436\u043e\u043b \u0431\u0435\u0440\u0434\u0456:
authorization_code_problem=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u043a\u043e\u0434\u044b \u049b\u0430\u0442\u044b\u043d\u0430\u0441\u0443 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b \u04af\u0448\u0456\u043d \u0430\u0443\u044b\u0441\u0442\u044b\u0440\u044b\u043b\u0443\u0434\u0430: {0}
authorization_code_problem.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u043a\u043e\u0434\u044b\u043d \u049b\u0430\u0442\u044b\u043d\u0430\u0441\u0443_\u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b \u04af\u0448\u0456\u043d \u0430\u0443\u044b\u0441\u0442\u044b\u0440\u0443 \u043a\u0435\u0437\u0456\u043d\u0434\u0435 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
authorize_problem={0} \u04af\u0448\u0456\u043d \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u04af\u0434\u0435\u0440\u0456\u0441\u0456 \u0431\u0430\u0441\u0442\u0430\u043b\u0443\u0434\u0430.
authorize_problem.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u04af\u0434\u0435\u0440\u0456\u0441\u0456\u043d \u0431\u0430\u0441\u0442\u0430\u0443 \u043a\u0435\u0437\u0456\u043d\u0434\u0435 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
callback_problem=\u049a\u0430\u0439\u0442\u0430 \u0431\u0430\u0493\u044b\u0442\u0442\u0430\u0443 \u0436\u0430\u0443\u0430\u0431\u044b \u04e9\u04a3\u0434\u0435\u043b\u0443\u0434\u0435: {0}
callback_problem.explanation=\u049a\u044b\u0437\u043c\u0435\u0442 \u0436\u0430\u0431\u0434\u044b\u049b\u0442\u0430\u0443\u0448\u044b\u0441\u044b\u043d\u0430\u043d \u049b\u0430\u0439\u0442\u0430 \u0431\u0430\u0493\u044b\u0442\u0442\u0430\u0443 \u0436\u0430\u0443\u0430\u0431\u044b\u043d \u04e9\u04a3\u0434\u0435\u0443 \u043a\u0435\u0437\u0456\u043d\u0434\u0435 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
client_credentials_problem=\u049a\u0430\u0442\u044b\u043d\u0430\u0441\u0443_\u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b \u043a\u043b\u0438\u0435\u043d\u0442 \u04af\u0448\u0456\u043d \u043a\u0435\u043b\u0435\u0441\u0456 \u043a\u043b\u0438\u0435\u043d\u0442\u0442\u0456\u04a3 \u0442\u0456\u0440\u043a\u0435\u043b\u0433\u0456 \u0434\u0435\u0440\u0435\u043a\u0442\u0435\u0440\u0456\u043c\u0435\u043d \u0448\u044b\u0493\u0430\u0440\u044b\u043b\u0443\u0434\u0430: {0}
client_credentials_problem.explanation=\u049a\u0430\u0442\u044b\u043d\u0430\u0441\u0443 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b\u043d \u043a\u043b\u0438\u0435\u043d\u0442\u0442\u0456\u04a3_\u0442\u0456\u0440\u043a\u0435\u043b\u0433\u0456 \u0434\u0435\u0440\u0435\u043a\u0442\u0435\u0440\u0456\u043d\u0456\u04a3 \u0430\u0493\u044b\u043d\u044b\u043d\u0434\u0430 \u0448\u044b\u0493\u0430\u0440\u0443 \u043a\u0435\u0437\u0456\u043d\u0434\u0435 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
fetch_init_problem=OAuth2Request \u0431\u0430\u043f\u0442\u0430\u043d\u0434\u044b\u0440\u044b\u043b\u0443\u0434\u0430: {0}
fetch_init_problem.explanation=OAuth2Request \u0430\u043b\u044b\u043d\u0443\u044b\u043d \u0431\u0430\u043f\u0442\u0430\u043d\u0434\u044b\u0440\u0443 \u043a\u0435\u0437\u0456\u043d\u0434\u0435 \u0442\u04e9\u043c\u0435\u043d \u0434\u0435\u04a3\u0433\u0435\u0439\u043b\u0456 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
fetch_problem=OAuth2Request.fetch() \u043e\u0440\u044b\u043d\u0434\u0430\u0443: {0}
fetch_problem.explanation=OAuth2Request \u0430\u043b\u044b\u043d\u0443\u044b\u043d \u0448\u044b\u0493\u0430\u0440\u0443 \u043a\u0435\u0437\u0456\u043d\u0434\u0435 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
gadget_spec_problem=\u041a\u0435\u043b\u0435\u0441\u0456 \u0448\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430 \u0441\u0438\u043f\u0430\u0442\u0442\u0430\u043c\u0430\u0441\u044b \u04e9\u04a3\u0434\u0435\u0443\u0434\u0435: {0}
gadget_spec_problem.explanation=\u0428\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430 \u0441\u0438\u043f\u0430\u0442\u0442\u0430\u043c\u0430\u0441\u044b \u0442\u0430\u0431\u044b\u043b\u043c\u0430\u0434\u044b. \u04d8\u043a\u0456\u043c\u0448\u0456\u0434\u0435\u043d \u0448\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430\u04a3\u044b\u0437\u0434\u044b OAuth2.0 \u0431\u0456\u0440\u0433\u0435 \u0436\u04b1\u043c\u044b\u0441 \u0456\u0441\u0442\u0435\u0443 \u04af\u0448\u0456\u043d \u0442\u0435\u04a3\u0448\u0435\u0443\u0434\u0456 \u0441\u04b1\u0440\u0430\u04a3\u044b\u0437.
get_oauth2_accessor_problem=OAuth2Request \u04af\u0448\u0456\u043d OAuth2Accessor \u0430\u043b\u0443: {0}
get_oauth2_accessor_problem.explanation=\u049a\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b. \u04d8\u043a\u0456\u043c\u0448\u0456\u0434\u0435\u043d \u043e\u0441\u044b \u0448\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430 \u043c\u0435\u043d \u049b\u044b\u0437\u043c\u0435\u0442 \u04af\u0448\u0456\u043d OAuth2.0 \u043a\u043b\u0438\u0435\u043d\u0442\u0456\u043d\u0456\u04a3 \u0431\u0456\u0440\u0456\u043a\u0442\u0456\u0440\u0443\u0456\u043d \u0436\u0430\u0441\u0430\u0443\u0434\u044b \u0441\u04b1\u0440\u0430\u04a3\u044b\u0437.
lookup_spec_problem=\u0428\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430\u043d\u044b\u04a3 \u0441\u0438\u043f\u0430\u0442\u0442\u0430\u043c\u0430\u0441\u044b \u0448\u044b\u0493\u0430\u0440\u044b\u043b\u0443\u0434\u0430: {0}
lookup_spec_problem.explanation=\u0428\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430 \u0441\u0438\u043f\u0430\u0442\u0442\u0430\u043c\u0430\u0441\u044b \u0442\u0430\u0431\u044b\u043b\u043c\u0430\u0434\u044b. \u04d8\u043a\u0456\u043c\u0448\u0456\u0434\u0435\u043d \u0448\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430\u04a3\u044b\u0437\u0434\u044b OAuth2.0 \u0431\u0456\u0440\u0433\u0435 \u0436\u04b1\u043c\u044b\u0441 \u0456\u0441\u0442\u0435\u0443 \u04af\u0448\u0456\u043d \u0442\u0435\u04a3\u0448\u0435\u0443\u0434\u0456 \u0441\u04b1\u0440\u0430\u04a3\u044b\u0437.
missing_fetch_params=\u041a\u0435\u043b\u0435\u0441\u0456 \u049b\u0430\u0436\u0435\u0442\u0442\u0456 \u0430\u043b\u0443 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043b\u0435\u0440\u0456 \u0436\u043e\u049b: {0}
missing_fetch_params.explanation=\u0410\u043b\u0443() \u04d9\u0434\u0456\u0441\u0456 \u043d\u0430\u0448\u0430\u0440 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043b\u0435\u0440\u043c\u0435\u043d \u0448\u0430\u049b\u044b\u0440\u044b\u043b\u0434\u044b.
missing_server_response=OAuth2.0 \u049b\u044b\u0437\u043c\u0435\u0442 \u0436\u0430\u0431\u0434\u044b\u049b\u0442\u0430\u0443\u0448\u044b\u0441\u044b\u043d\u044b\u04a3 \u0436\u0430\u0443\u0430\u0431\u044b \u0431\u0430\u0440\u044b\u0441\u044b\u043d\u0434\u0430 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b: {0}
missing_server_response.explanation=\u0421\u0435\u0440\u0432\u0435\u0440 \u0436\u0430\u0440\u0430\u043c\u0434\u044b OAuth2Request \u0436\u0430\u0441\u0430\u0434\u044b, \u0431\u0456\u0440\u0430\u049b \u0441\u04b1\u0440\u0430\u0443\u0434\u044b \u0448\u044b\u0493\u0430\u0440\u0443\u0493\u0430 \u043d\u0435\u043c\u0435\u0441\u0435 \u049b\u044b\u0437\u043c\u0435\u0442 \u0436\u0430\u0431\u0434\u044b\u049b\u0442\u0430\u0443\u0448\u044b\u0441\u044b\u043d\u0430\u043d \u0436\u0430\u0440\u0430\u043c\u0434\u044b \u0436\u0430\u0443\u0430\u043f \u0430\u043b\u0443\u0493\u0430 \u043c\u04af\u043c\u043a\u0456\u043d \u0431\u043e\u043b\u043c\u0430\u0434\u044b.
no_response_handler=\u0416\u0430\u0443\u0430\u043f \u04e9\u04a3\u0434\u0435\u0433\u0456\u0448\u0456 \u043a\u0435\u043b\u0435\u0441\u0456 \u0436\u0430\u0443\u0430\u043f\u0442\u044b \u04e9\u04a3\u0434\u0435\u0433\u0435\u043d \u0436\u043e\u049b: {0}
no_response_handler.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443\u0434\u044b \u0436\u04d9\u043d\u0435 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u0442\u044b\u04a3 \u0441\u043e\u04a3\u0493\u044b \u043d\u04af\u043a\u0442\u0435\u043b\u0435\u0440\u0456\u043d \u04e9\u04a3\u0434\u0435\u0443 \u04af\u0448\u0456\u043d \u0436\u0430\u0443\u0430\u043f \u04e9\u04a3\u0434\u0435\u0433\u0456\u0448\u0456 \u0436\u043e\u049b. AuthorizationEndpointResponseHandler \u043d\u0435\u043c\u0435\u0441\u0435 TokenEndpointResponseHandler.
no_gadget_spec={0} \u04af\u0448\u0456\u043d \u0448\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430 \u0441\u0438\u043f\u0430\u0442\u0442\u0430\u043c\u0430\u0441\u044b\u043d \u0442\u0430\u0431\u0443 \u043c\u04af\u043c\u043a\u0456\u043d \u0435\u043c\u0435\u0441.
no_gadget_spec.explanation=\u0428\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430 \u0441\u0438\u043f\u0430\u0442\u0442\u0430\u043c\u0430\u0441\u044b \u0442\u0430\u0431\u044b\u043b\u043c\u0430\u0434\u044b. \u04d8\u043a\u0456\u043c\u0448\u0456\u0434\u0435\u043d \u0448\u0430\u0493\u044b\u043d \u0431\u0430\u0493\u0434\u0430\u0440\u043b\u0430\u043c\u0430\u04a3\u044b\u0437\u0434\u044b OAuth2.0 \u0431\u0456\u0440\u0433\u0435 \u0436\u04b1\u043c\u044b\u0441 \u0456\u0441\u0442\u0435\u0443 \u04af\u0448\u0456\u043d \u0442\u0435\u04a3\u0448\u0435\u0443\u0434\u0456 \u0441\u04b1\u0440\u0430\u04a3\u044b\u0437.
refresh_token_problem=\u0416\u0430\u04a3\u0430\u0440\u0442\u0443 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b \u049b\u0430\u0442\u044b\u043d\u0430\u0441\u0443_\u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b \u04af\u0448\u0456\u043d \u0430\u0443\u044b\u0441\u0442\u044b\u0440\u044b\u043b\u0443\u0434\u0430: {0}
refresh_token_problem.explanation=\u0416\u0430\u04a3\u0430\u0440\u0442\u0443 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b\u043d \u049b\u0430\u0442\u044b\u043d\u0430\u0441\u0443 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b\u043d\u0430 \u0430\u0443\u044b\u0441\u0442\u044b\u0440\u0443 \u043a\u0435\u0437\u0456\u043d\u0434\u0435 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
secret_encryption_problem=\u0422\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448 \u049b\u04b1\u043f\u0438\u044f\u0441\u044b\u043d\u044b\u04a3 \u0442\u04b1\u0440\u0430\u049b\u0442\u044b\u043b\u044b\u049b\u0442\u044b \u049b\u0430\u043c\u0442\u0430\u043c\u0430\u0441\u044b\u0437 \u0435\u0442\u0443 \u04af\u0448\u0456\u043d \u0448\u0438\u0444\u0440\u043b\u0430\u043d\u0443\u0434\u0430: {0}
secret_encryption_problem.explanation=OAuth2.0 \u049b\u04b1\u043f\u0438\u044f\u043b\u0430\u0440\u044b\u043d \u049b\u0430\u043c\u0442\u0430\u043c\u0430\u0441\u044b\u0437 \u0435\u0442\u0456\u043b\u0433\u0435\u043d \u0448\u0438\u0444\u0440\u043b\u0430\u0443 \u043c\u043e\u0434\u0443\u043b\u0456\u043c\u0435\u043d \u0441\u0430\u049b\u0442\u0430\u0443 \u043a\u0435\u0437\u0456\u043d\u0434\u0435 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
access_denied=\u049a\u0430\u0442\u044b\u043d\u0430\u0441\u0442\u0430\u043d \u0431\u0430\u0441 \u0442\u0430\u0440\u0442\u044b\u043b\u0434\u044b.
access_denied.explanation=\u041f\u0430\u0439\u0434\u0430\u043b\u0430\u043d\u0443\u0448\u044b \u049b\u044b\u0437\u043c\u0435\u0442 \u0436\u0430\u0431\u0434\u044b\u049b\u0442\u0430\u0443\u0448\u044b\u0441\u044b\u043c\u0435\u043d \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443\u0434\u0430\u043d \u0431\u0430\u0441 \u0442\u0430\u0440\u0442\u0442\u044b \u043d\u0435\u043c\u0435\u0441\u0435 \u043e\u043d\u044b \u0431\u043e\u043b\u0434\u044b\u0440\u043c\u0430\u0434\u044b.
invalid_client=\u041a\u043b\u0438\u0435\u043d\u0442 \u0436\u0430\u0440\u0430\u043c\u0441\u044b\u0437: {0}
invalid_client.explanation= \u041a\u043b\u0438\u0435\u043d\u0442\u0442\u0456 \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u043c\u04af\u043c\u043a\u0456\u043d \u0435\u043c\u0435\u0441, \u0441\u0435\u0431\u0435\u0431\u0456 \u043e\u043d\u044b\u04a3 \u0431\u0435\u043b\u0433\u0456\u0441\u0456\u0437 \u0431\u043e\u043b\u0443\u044b, \u043a\u043b\u0438\u0435\u043d\u0442 \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443\u044b \u049b\u043e\u0441\u044b\u043b\u043c\u0430\u0493\u0430\u043d\u044b \u043d\u0435\u043c\u0435\u0441\u0435 \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u04d9\u0434\u0456\u0441\u0456\u043d\u0435 \u049b\u043e\u043b\u0434\u0430\u0443 \u043a\u04e9\u0440\u0441\u0435\u0442\u0456\u043b\u043c\u0435\u0433\u0435\u043d\u0456 \u0431\u043e\u043b\u0443\u044b \u043c\u04af\u043c\u043a\u0456\u043d.
invalid_grant=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u0440\u04b1\u049b\u0441\u0430\u0442\u044b \u0436\u0430\u0440\u0430\u043c\u0441\u044b\u0437: {0}
invalid_grant.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u0440\u04b1\u049b\u0441\u0430\u0442\u044b \u0436\u0430\u0440\u0430\u043c\u0441\u044b\u0437, \u043e\u043d\u044b\u04a3 \u043c\u0435\u0440\u0437\u0456\u043c\u0456 \u04e9\u0442\u043a\u0435\u043d, \u0431\u043e\u043b\u0434\u044b\u0440\u044b\u043b\u043c\u0430\u0493\u0430\u043d, \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u0441\u04b1\u0440\u0430\u0443\u044b\u043d\u0434\u0430 \u043f\u0430\u0439\u0434\u0430\u043b\u0430\u043d\u044b\u043b\u0493\u0430\u043d \u049b\u0430\u0439\u0442\u0430 \u0431\u0430\u0493\u044b\u0442\u0442\u0430\u0443 URI \u043c\u0435\u043a\u0435\u043d\u0436\u0430\u0439\u044b\u043d\u0430 \u0441\u04d9\u0439\u043a\u0435\u0441 \u043a\u0435\u043b\u043c\u0435\u0439\u0434\u0456 \u043d\u0435\u043c\u0435\u0441\u0435 \u0431\u0430\u0441\u049b\u0430 \u043a\u043b\u0438\u0435\u043d\u0442\u043a\u0435 \u0431\u0435\u0440\u0456\u043b\u0434\u0456. \u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u0440\u04b1\u049b\u0441\u0430\u0442\u044b \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u043a\u043e\u0434\u044b\u043d, \u0440\u0435\u0441\u0443\u0440\u0441 \u0438\u0435\u0441\u0456\u043d\u0456\u04a3 \u0442\u0456\u0440\u043a\u0435\u043b\u0433\u0456 \u0434\u0435\u0440\u0435\u043a\u0442\u0435\u0440\u0456\u043d \u043d\u0435\u043c\u0435\u0441\u0435 \u043a\u043b\u0438\u0435\u043d\u0442\u0442\u0456\u04a3 \u0442\u0456\u0440\u043a\u0435\u043b\u0433\u0456 \u0434\u0435\u0440\u0435\u043a\u0442\u0435\u0440\u0456\u043d \u049b\u0430\u043c\u0442\u0443\u044b \u043c\u04af\u043c\u043a\u0456\u043d.
invalid_request=\u0421\u04b1\u0440\u0430\u0443 \u0436\u0430\u0440\u0430\u043c\u0441\u044b\u0437: {0}
invalid_request.explanation=\u0421\u04b1\u0440\u0430\u0443 \u0436\u0430\u0440\u0430\u043c\u0441\u044b\u0437, \u0441\u0435\u0431\u0435\u0431\u0456 \u043e\u043d\u044b\u04a3 \u049b\u0430\u0436\u0435\u0442\u0442\u0456 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0456 \u0436\u043e\u049b, \u049b\u043e\u043b\u0434\u0430\u0443 \u043a\u04e9\u0440\u0441\u0435\u0442\u0456\u043b\u043c\u0435\u0439\u0442\u0456\u043d \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 \u043c\u04d9\u043d\u0456\u043d \u049b\u0430\u043c\u0442\u0438\u0434\u044b, \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0434\u0456 \u049b\u0430\u0439\u0442\u0430\u043b\u0430\u0439\u0434\u044b, \u0431\u0456\u0440\u043d\u0435\u0448\u0435 \u0442\u0456\u0440\u043a\u0435\u043b\u0433\u0456 \u0434\u0435\u0440\u0435\u043a\u0442\u0435\u0440\u0456\u043d \u049b\u0430\u043c\u0442\u0438\u0434\u044b, \u043a\u043b\u0438\u0435\u043d\u0442\u0442\u0456 \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u04af\u0448\u0456\u043d \u0431\u0456\u0440 \u043c\u0435\u0445\u0430\u043d\u0438\u0437\u043c\u043d\u0435\u043d \u0430\u0440\u0442\u044b\u049b \u049b\u043e\u043b\u0434\u0430\u043d\u0430\u0434\u044b \u043d\u0435\u043c\u0435\u0441\u0435 \u0431\u0430\u0441\u049b\u0430 \u0442\u04af\u0440\u0434\u0435 \u049b\u0430\u0442\u0435 \u0436\u0430\u0441\u0430\u043b\u0493\u0430\u043d.
invalid_scope=\u041a\u04e9\u043b\u0435\u043c \u0436\u0430\u0440\u0430\u043c\u0441\u044b\u0437: {0}
invalid_scope.explanation=\u0421\u04b1\u0440\u0430\u043b\u0493\u0430\u043d \u043a\u04e9\u043b\u0435\u043c \u0436\u0430\u0440\u0430\u043c\u0441\u044b\u0437, \u0431\u0435\u043b\u0433\u0456\u0441\u0456\u0437, \u049b\u0430\u0442\u0435 \u0436\u0430\u0441\u0430\u043b\u0493\u0430\u043d \u043d\u0435\u043c\u0435\u0441\u0435 \u0440\u0435\u0441\u0443\u0440\u0441 \u0438\u0435\u0441\u0456 \u0440\u04b1\u049b\u0441\u0430\u0442 \u0435\u0442\u043a\u0435\u043d \u043a\u04e9\u043b\u0435\u043c\u043d\u0435\u043d \u0430\u0441\u0430\u0434\u044b.
server_error=\u0421\u0435\u0440\u0432\u0435\u0440 \u049b\u0430\u0442\u0435\u0441\u0456 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b: {0}
server_error.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0456\u043d\u0434\u0435 \u0441\u04b1\u0440\u0430\u0443\u0434\u044b \u043e\u0440\u044b\u043d\u0434\u0430\u0443\u0493\u0430 \u0436\u043e\u043b \u0431\u0435\u0440\u043c\u0435\u0439\u0442\u0456\u043d \u043a\u04af\u0442\u043f\u0435\u0433\u0435\u043d \u0436\u0430\u0493\u0434\u0430\u0439 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
server_rejected_request=\u0421\u0435\u0440\u0432\u0435\u0440 \u0441\u04b1\u0440\u0430\u0443\u0434\u0430\u043d \u0431\u0430\u0441 \u0442\u0430\u0440\u0442\u0442\u044b: \u043a\u04af\u0439 \u043a\u043e\u0434\u044b = {0}
server_rejected_request.explanation=\u0421\u0435\u0440\u0432\u0435\u0440 OAuth2Request \u0436\u0430\u0441\u0430\u0434\u044b, \u0431\u0456\u0440\u0430\u049b \u049b\u044b\u0437\u043c\u0435\u0442 \u0436\u0430\u0431\u0434\u044b\u049b\u0442\u0430\u0443\u0448\u044b\u0441\u044b \u043e\u0434\u0430\u043d \u0431\u0430\u0441 \u0442\u0430\u0440\u0442\u0442\u044b.
temporarily_unavailable=\u049a\u044b\u0437\u043c\u0435\u0442 \u0443\u0430\u049b\u044b\u0442\u0448\u0430 \u049b\u043e\u043b\u0436\u0435\u0442\u0456\u043c\u0441\u0456\u0437: {0}
temporarily_unavailable.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u0443\u0430\u049b\u044b\u0442\u0448\u0430 \u0448\u0430\u043c\u0430\u0434\u0430\u043d \u0442\u044b\u0441 \u0436\u04af\u043a\u0442\u0435\u043b\u0433\u0435\u043d\u0456\u043d\u0435 \u043d\u0435\u043c\u0435\u0441\u0435 \u049b\u044b\u0437\u043c\u0435\u0442 \u043a\u04e9\u0440\u0441\u0435\u0442\u0443 \u0440\u0435\u0436\u0438\u043c\u0456\u043d\u0434\u0435 \u0431\u043e\u043b\u0443\u044b\u043d\u0430 \u0431\u0430\u0439\u043b\u0430\u043d\u044b\u0441\u0442\u044b \u0441\u04b1\u0440\u0430\u0443\u0434\u044b \u04e9\u04a3\u0434\u0435\u0439 \u0430\u043b\u043c\u0430\u0439\u0434\u044b.
token_response_problem=\u0422\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448 \u0441\u043e\u04a3\u0493\u044b \u043d\u04af\u043a\u0442\u0435\u0441\u0456\u043d\u0456\u04a3 \u0436\u0430\u0443\u0430\u0431\u044b \u04e9\u04a3\u0434\u0435\u043b\u0443\u0434\u0435: {0}
token_response_problem.explanation=\u0422\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u0442\u044b\u04a3 \u0441\u043e\u04a3\u0493\u044b \u043d\u04af\u043a\u0442\u0435\u0441\u0456 \u0441\u0435\u0440\u0432\u0435\u0440 \u04e9\u04a3\u0434\u0435\u0439 \u0430\u043b\u043c\u0430\u0439\u0442\u044b\u043d \u0441\u04b1\u0440\u0430\u0443\u0434\u044b \u0436\u0456\u0431\u0435\u0440\u0434\u0456.
unauthorized_client=\u041a\u043b\u0438\u0435\u043d\u0442 \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u044b\u043b\u043c\u0430\u0493\u0430\u043d: {0}
unauthorized_client.explanation=\u041a\u043b\u0438\u0435\u043d\u0442 \u043e\u0441\u044b \u04d9\u0434\u0456\u0441\u0442\u0456 \u043f\u0430\u0439\u0434\u0430\u043b\u0430\u043d\u044b\u043f \u049b\u0430\u0442\u044b\u043d\u0430\u0441\u0443 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b\u043d\u0430 \u0441\u04b1\u0440\u0430\u0443 \u0441\u0430\u043b\u0443\u0493\u0430 \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u044b\u043b\u043c\u0430\u0493\u0430\u043d.
unsupported_grant_type=\u0420\u04b1\u049b\u0441\u0430\u0442 \u0442\u04af\u0440\u0456\u043d\u0435 \u049b\u043e\u043b\u0434\u0430\u0443 \u043a\u04e9\u0440\u0441\u0435\u0442\u0456\u043b\u043c\u0435\u0439\u0434\u0456: {0}
unsupported_grant_type.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u043e\u0441\u044b \u04d9\u0434\u0456\u0441\u0442\u0456 \u043f\u0430\u0439\u0434\u0430\u043b\u0430\u043d\u044b\u043f \u049b\u0430\u0442\u044b\u043d\u0430\u0441\u0443 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b\u043d \u0430\u043b\u0443\u0493\u0430 \u049b\u043e\u043b\u0434\u0430\u0443 \u043a\u04e9\u0440\u0441\u0435\u0442\u043f\u0435\u0439\u0434\u0456.
unsupported_response_type=\u0416\u0430\u0443\u0430\u043f \u0442\u04af\u0440\u0456\u043d\u0435 \u049b\u043e\u043b\u0434\u0430\u0443 \u043a\u04e9\u0440\u0441\u0435\u0442\u0456\u043b\u043c\u0435\u0439\u0434\u0456: {0}
unsupported_response_type.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0456 \u043e\u0441\u044b \u04d9\u0434\u0456\u0441\u0442\u0456 \u043f\u0430\u0439\u0434\u0430\u043b\u0430\u043d\u044b\u043f \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u043a\u043e\u0434\u044b\u043d \u0430\u043b\u0443\u0493\u0430 \u049b\u043e\u043b\u0434\u0430\u0443 \u043a\u04e9\u0440\u0441\u0435\u0442\u043f\u0435\u0439\u0434\u0456.
mac_token_problem=Mac \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b\u043d\u0430 \u0441\u04b1\u0440\u0430\u0443 \u0441\u0430\u043b\u044b\u043d\u0443\u0434\u0430: {0}
mac_token_problem.explanation=\u0421\u04b1\u0440\u0430\u043b\u0493\u0430\u043d Mac \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b\u043d \u0440\u0435\u0441\u0443\u0440\u0441\u0442\u0430\u0440 \u0441\u0435\u0440\u0432\u0435\u0440\u0456\u043d\u0435 \u049b\u043e\u0441\u0443 \u043c\u04af\u043c\u043a\u0456\u043d \u0431\u043e\u043b\u043c\u0430\u0434\u044b.
bearer_token_problem=\u0414\u0435\u0440\u0435\u043a\u0442\u0435\u0440\u0434\u0456 \u0442\u0430\u0441\u0443\u0448\u044b\u043d\u044b\u04a3 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b\u043d\u0430 \u0441\u04b1\u0440\u0430\u0443 \u0441\u0430\u043b\u044b\u043d\u0443\u0434\u0430: {0}
bearer_token_problem.explanation=\u0421\u04b1\u0440\u0430\u043b\u0493\u0430\u043d \u0434\u0435\u0440\u0435\u043a\u0442\u0435\u0440\u0434\u0456 \u0442\u0430\u0441\u0443\u0448\u044b\u043d\u044b\u04a3 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b\u043d \u0440\u0435\u0441\u0443\u0440\u0441\u0442\u0430\u0440 \u0441\u0435\u0440\u0432\u0435\u0440\u0456\u043d\u0435 \u049b\u043e\u0441\u0443 \u043c\u04af\u043c\u043a\u0456\u043d \u0431\u043e\u043b\u043c\u0430\u0434\u044b.
authentication_problem=\u041a\u043b\u0438\u0435\u043d\u0442 \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443\u044b \u049b\u043e\u0441\u044b\u043b\u0443\u0434\u0430: {0}
authentication_problem.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u0442\u0430\u049b\u044b\u0440\u044b\u043f\u0442\u0430\u0440\u044b\u043d \u0441\u04b1\u0440\u0430\u0443\u0493\u0430 \u049b\u043e\u0441\u0443 \u043c\u04af\u043c\u043a\u0456\u043d \u0431\u043e\u043b\u043c\u0430\u0434\u044b.
unknown_problem=\u0411\u0435\u043b\u0433\u0456\u0441\u0456\u0437 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b: {0}
unknown_problem.explanation=\u0416\u04af\u0439\u0435 \u04d9\u043a\u0456\u043c\u0448\u0456\u0441\u0456\u043d\u0435\u043d \u043c\u04d9\u0441\u0435\u043b\u0435\u043d\u0456 \u0437\u0435\u0440\u0442\u0442\u0435\u0443\u0434\u0456 \u0441\u04b1\u0440\u0430\u04a3\u044b\u0437.
code_grant_problem=\u049a\u0430\u0442\u044b\u043d\u0430\u0441\u0443 \u0442\u0430\u04a3\u0431\u0430\u043b\u0430\u0443\u044b\u0448\u044b \u043a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u043a\u043e\u0434\u044b\u043d\u0430\u043d \u0430\u043b\u044b\u043d\u0443\u0434\u0430: {0}
code_grant_problem.explanation=\u041a\u0443\u04d9\u043b\u0430\u043d\u0434\u044b\u0440\u0443 \u043a\u043e\u0434\u044b\u043d\u044b\u04a3 \u0430\u0493\u044b\u043d\u044b \u0431\u0430\u0440\u044b\u0441\u044b\u043d\u0434\u0430 \u049b\u0430\u0442\u0435 \u043e\u0440\u044b\u043d \u0430\u043b\u0434\u044b.
