# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= {0} hat einen Fehler gemeldet:
authorization_code_problem=Der Berechtigungscode wird durch das Zugriffstoken ersetzt: {0}
authorization_code_problem.explanation=Beim Ersetzen des Berechtigungscodes durch das Zugriffstoken ist ein Fehler aufgetreten.
authorize_problem=Der Berechtigungsprozess f\u00fcr {0} wird initiiert.
authorize_problem.explanation=Beim Initiieren des Berechtigungsprozesses ist ein Fehler aufgetreten.
callback_problem=Die Umleitungsantwort wird verarbeitet: {0}
callback_problem.explanation=Beim Verarbeiten der Umleitungsantwort vom Service-Provider ist ein Fehler aufgetreten.
client_credentials_problem=Das Zugriffstoken wird f\u00fcr den Client mit dem folgenden Clientberechtigungsnachweis abgerufen: {0}
client_credentials_problem.explanation=Beim Abrufen des Zugriffstokens im Datenfluss des Clientberechtigungsnachweises ist ein Fehler aufgetreten.
fetch_init_problem=OAuth2Request wird initialisiert: {0}
fetch_init_problem.explanation=Beim Initialisieren des OAuth2Request-Abrufs ist ein Fehler der unteren Ebene aufgetreten.
fetch_problem=OAuth2Request.fetch() wird ausgef\u00fchrt: {0}
fetch_problem.explanation=Beim Ausgeben des OAuth2Request-Abrufs ist ein Fehler aufgetreten.
gadget_spec_problem=Die folgende Gadgetspezifikation wird verarbeitet: {0}
gadget_spec_problem.explanation=Es konnte keine Gadgetspezifikation gefunden werden. Bitten Sie den Administrator, das Gadget f\u00fcr die Verwendung mit OAuth2.0 zu konfigurieren.
get_oauth2_accessor_problem=OAuth2Accessor wird f\u00fcr OAuth2Request abgerufen: {0}
get_oauth2_accessor_problem.explanation=Es ist ein Fehler aufgetreten. Bitten Sie den Administrator, eine OAuth2.0-Clientbindung f\u00fcr dieses Gadget und diesen Service zu erstellen.
lookup_spec_problem=Die Gadgetspezifikation wird abgerufen: {0}
lookup_spec_problem.explanation=Es konnte keine Gadgetspezifikation gefunden werden. Bitten Sie den Administrator, das Gadget f\u00fcr die Verwendung mit OAuth2.0 zu konfigurieren.
missing_fetch_params=Die folgenden erforderlichen Abrufparameter fehlen: {0}
missing_fetch_params.explanation=Die fetch()-Methode wurde mit falschen Parametern aufgerufen.
missing_server_response=W\u00e4hrend der OAuth2.0-Antwort des Service-Providers ist ein Fehler aufgetreten: {0}
missing_server_response.explanation=Der Server hat eine g\u00fcltige OAuth2Request erstellt, konnte die Anfrage jedoch nicht ausgeben oder konnte keine g\u00fcltige Antwort vom Service-Provider erhalten.
no_response_handler=Eine Antwortbehandlungsroutine konnte die folgende Antwort nicht verarbeiten: {0}
no_response_handler.explanation=Es ist keine Antwortbehandlungsroutine f\u00fcr die Verarbeitung der Berechtigungs- und Tokenendpunkte vorhanden. AuthorizationEndpointResponseHandler oder TokenEndpointResponseHandler.
no_gadget_spec=Die Gadgetspezifikation f\u00fcr {0} konnte nicht gefunden werden.
no_gadget_spec.explanation=Es konnte keine Gadgetspezifikation gefunden werden. Bitten Sie den Administrator, das Gadget f\u00fcr die Verwendung mit OAuth2.0 zu konfigurieren.
refresh_token_problem=Das Aktualisierungstoken wird durch das Zugriffstoken ersetzt: {0}
refresh_token_problem.explanation=Beim Ersetzen des Aktualisierungstokens durch das Zugriffstoken ist ein Fehler aufgetreten.
secret_encryption_problem=Der geheime Schl\u00fcssel des Tokens wird aus Persistenzgr\u00fcnden verschl\u00fcsselt: {0}
secret_encryption_problem.explanation=Beim Speichern geheimer OAuth2.0-Schl\u00fcssel mit dem angegebenen Verschl\u00fcsselungsmodul ist ein Fehler aufgetreten.
access_denied=Zugriff verweigert.
access_denied.explanation=Der Benutzer hat die Berechtigung f\u00fcr den Service-Provider abgelehnt oder abgebrochen.
invalid_client=Der Client ist ung\u00fcltig: {0}
invalid_client.explanation= Der Client kann nicht authentifiziert werden, vermutlich weil er unbekannt ist, die Clientauthentifizierung nicht eingeschlossen war oder die Authentifizierungsmethode nicht unterst\u00fctzt wird.
invalid_grant=Der Berechtigungsgrant ist ung\u00fcltig: {0}
invalid_grant.explanation=Der Berechtigungsgrant ist ung\u00fcltig oder abgelaufen, wurde widerrufen, stimmt nicht mit dem Umleitungs-URI in der Berechtigungsanforderung \u00fcberein oder wurde f\u00fcr einen anderen Client ausgegeben. Der Berechtigungsgrant kann den Berechtigungscode, den Berechtigungsnachweis des Ressourcenverantwortlichen oder den Berechtigungsnachweis des Clients enthalten.
invalid_request=Die Anforderung ist ung\u00fcltig: {0}
invalid_request.explanation=Die Anforderung ist ung\u00fcltig, weil ein Parameter fehlt, ein ung\u00fcltiger Parameterwert enthalten ist, ein Parameter wiederholt wird, mehrere Berechtigungsnachweise enthalten sind, mehrere Mechanismen f\u00fcr die Authentifizierung des Clients verwendet werden oder andere Fehler vorhanden sind.
invalid_scope=Der Umfang ist ung\u00fcltig: {0}
invalid_scope.explanation=Der angeforderte Umfang ist ung\u00fcltig, unbekannt, fehlerhaft oder \u00fcberschreitet den vom Ressourcenverantwortlichen genehmigten Umfang.
server_error=Ein Serverfehler ist aufgetreten: {0}
server_error.explanation=Auf dem Autorisierungsserver ist eine nicht erwartete Bedingung aufgetreten. Die Anforderung konnte nicht ausgef\u00fchrt werden.
server_rejected_request=Der Server hat die folgende Anforderung zur\u00fcckgewiesen: Statuscode = {0}
server_rejected_request.explanation=Der Server hat eine OAuth2Request erstellt, aber der Service-Provider hat sie zur\u00fcckgewiesen.
temporarily_unavailable=Der Service ist derzeit nicht verf\u00fcgbar: {0}
temporarily_unavailable.explanation=Der Autorisierungsserver kann die Anforderung nicht verarbeiten, weil er derzeit \u00fcberlastet ist oder sich im Wartungsmodus befindet.
token_response_problem=Die Antwort des Tokenendpunkts wird verarbeitet: {0}
token_response_problem.explanation=Der Tokenendpunkt hat eine Antwort gesendet, die der Server nicht verarbeiten konnte.
unauthorized_client=Der Client ist nicht autorisiert: {0}
unauthorized_client.explanation=Der Client ist nicht autorisiert, \u00fcber diese Methode ein Zugriffstoken anzufordern.
unsupported_grant_type=Der Granttyp wird nicht unterst\u00fctzt: {0}
unsupported_grant_type.explanation=Das Anfordern eines Zugriffstokens \u00fcber diese Methode wird vom Autorisierungsserver nicht unterst\u00fctzt.
unsupported_response_type=Der Antworttyp wird nicht unterst\u00fctzt: {0}
unsupported_response_type.explanation=Das Anfordern eines Berechtigungscodes \u00fcber diese Methode wird vom Autorisierungsserver nicht unterst\u00fctzt.
mac_token_problem=Das MAC-Token wird angefordert: {0}
mac_token_problem.explanation=Das MAC-Token in der Anforderung konnte dem Ressourcenserver nicht hinzugef\u00fcgt werden.
bearer_token_problem=Das Tr\u00e4gertoken wird angefordert: {0}
bearer_token_problem.explanation=Das Tr\u00e4gertoken in der Anforderung konnte dem Ressourcenserver nicht hinzugef\u00fcgt werden.
authentication_problem=Die Clientauthentifzierung wird hinzugef\u00fcgt: {0}
authentication_problem.explanation=Die Authentifizierungsheader konnten der Anforderung nicht hinzugef\u00fcgt werden.
unknown_problem=Ein unerwarteter Fehler ist aufgetreten: {0}
unknown_problem.explanation=Bitten Sie Ihren Systemadministrator, das Problem zu untersuchen.
code_grant_problem=Das vom Berechtigungscode bezogene Zugriffstoken: {0}
code_grant_problem.explanation=W\u00e4hrend des Verarbeitungsablaufs f\u00fcr den Berechtigungscode ist ein Fehler aufgetreten.
