# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= Det uppstod ett fel i {0}:
authorization_code_problem=Autentiseringskoden byts ut mot \u00e5tkomstelementet {0}
authorization_code_problem.explanation=Det uppstod ett fel n\u00e4r autentiseringskoden skulle bytas ut mot \u00e5tkomstelementet.
authorize_problem=Autentiseringsprocessen f\u00f6r {0} initieras.
authorize_problem.explanation=Det uppstod ett fel n\u00e4r autentiseringsprocessen skulle initieras.
callback_problem=Omdirigeringssvaret bearbetas: {0}
callback_problem.explanation=Det uppstod ett fel n\u00e4r omdirigeringssvaret fr\u00e5n tj\u00e4nsteleverant\u00f6ren skulle omdirigeras.
client_credentials_problem=\u00c5tkomstelementet h\u00e4mtas f\u00f6r klienten med f\u00f6ljande klientanv\u00e4ndarinformation: {0}
client_credentials_problem.explanation=Det uppstod ett fel n\u00e4r \u00e5tkomstelementet skulle h\u00e4mtas fr\u00e5n klientanv\u00e4ndarinformationsfl\u00f6det.
fetch_init_problem=OAuth2Request-beg\u00e4ran initieras: {0}
fetch_init_problem.explanation=Det uppstod ett l\u00e5gniv\u00e5fel n\u00e4r OAuth2Request-h\u00e4mtningen skulle initieras.
fetch_problem=OAuth2Request.fetch() utf\u00f6rs: {0}
fetch_problem.explanation=Det uppstod ett fel n\u00e4r OAuth2Request-h\u00e4mtningen skulle utf\u00e4rdas.
gadget_spec_problem=F\u00f6ljande gadgetprogramsspecifikation bearbetas: {0}
gadget_spec_problem.explanation=Det gick inte att hitta n\u00e5gon gadgetprogramsspecifikation. Kontakta administrat\u00f6ren och be honom/henne att konfigurera gadgetprogrammet s\u00e5 att det g\u00e5r att anv\u00e4nda OAuth 2.0.
get_oauth2_accessor_problem=OAuth2Accessor-\u00e5tkomstfunktionen f\u00f6r OAuth2Request-beg\u00e4ran h\u00e4mtas: {0}
get_oauth2_accessor_problem.explanation=Det uppstod ett fel. Kontakta administrat\u00f6ren och be honom/henne att skapa en OAuth 2.0-klientbindning f\u00f6r det h\u00e4r gadgetprogrammet och den h\u00e4r tj\u00e4nsten.
lookup_spec_problem=Gadgetprogramsspecifikationen h\u00e4mtas: {0}
lookup_spec_problem.explanation=Det gick inte att hitta n\u00e5gon gadgetprogramsspecifikation. Kontakta administrat\u00f6ren och be honom/henne att konfigurera gadgetprogrammet s\u00e5 att det g\u00e5r att anv\u00e4nda OAuth 2.0.
missing_fetch_params=F\u00f6ljande obligatoriska h\u00e4mtningsparametrar saknas: {0}
missing_fetch_params.explanation=Metoden fetch() anropades med ogiltiga parametrar.
missing_server_response=Det uppstod ett fel i OAuth 2.0-tj\u00e4nsteleverant\u00f6rssvaret: {0}
missing_server_response.explanation=En giltig OAuth2Request-beg\u00e4ran skapades p\u00e5 servern men det gick inte att utf\u00e4rda beg\u00e4ran eller ta emot n\u00e5got giltigt svar fr\u00e5n tj\u00e4nsteleverant\u00f6ren.
no_response_handler=Det gick inte att bearbeta f\u00f6ljande svar i en svarshanterare: {0}
no_response_handler.explanation=Det finns ingen svarshanterare f\u00f6r bearbetning av autentiserings- och elementslutpunkterna. AuthorizationEndpointResponseHandler eller TokenEndpointResponseHandler.
no_gadget_spec=Det gick inte att hitta gadgetprogramsspecifikationen f\u00f6r {0}.
no_gadget_spec.explanation=Det gick inte att hitta n\u00e5gon gadgetprogramsspecifikation. Kontakta administrat\u00f6ren och be honom/henne att konfigurera gadgetprogrammet s\u00e5 att det g\u00e5r att anv\u00e4nda OAuth 2.0.
refresh_token_problem=Uppdateringselementet byts ut mot \u00e5tkomstelementet {0}
refresh_token_problem.explanation=Det uppstod ett fel n\u00e4r uppdateringselementet skulle bytas ut mot \u00e5tkomstelementet.
secret_encryption_problem=Elementhemligheten krypteras f\u00f6r best\u00e4ndighet: {0}
secret_encryption_problem.explanation=Det uppstod ett fel n\u00e4r OAuth 2.0-hemligheterna skulle lagras med hj\u00e4lp av den angivna krypteringsmodulen.
access_denied=\u00c5tkomst nekades.
access_denied.explanation=Anv\u00e4ndaren nekade eller avbr\u00f6t autentiseringen med tj\u00e4nsteleverant\u00f6ren.
invalid_client=Klienten \u00e4r ogiltig: {0}
invalid_client.explanation= Det gick inte att autentisera klienten. Det kan bero p\u00e5 att klienten \u00e4r ok\u00e4nd, p\u00e5 att klientautentiseringen inte har tagits med eller p\u00e5 att autentiseringsmetoden inte kan anv\u00e4ndas.
invalid_grant=Autentiseringstilldelningen \u00e4r ogiltig: {0}
invalid_grant.explanation=Autentiseringstilldelningen \u00e4r ogiltig, har upph\u00f6rt att g\u00e4lla, har \u00e5terkallats, \u00f6verensst\u00e4mmer inte med den omdirigerings-URI-adress som har anv\u00e4nts i autentiseringsbeg\u00e4ran eller har utf\u00e4rdats till en annan klient. Autentiseringstilldelningen kan inneh\u00e5lla autentiseringskoden, anv\u00e4ndarinformationen f\u00f6r resurs\u00e4garen eller anv\u00e4ndarinformationen f\u00f6r klienten.
invalid_request=Beg\u00e4ran \u00e4r ogiltig: {0}
invalid_request.explanation=Beg\u00e4ran \u00e4r ogiltig eftersom den saknar en obligatorisk parameter, inneh\u00e5ller ett parameterv\u00e4rde som inte kan anv\u00e4ndas, inneh\u00e5ller en upprepad parameter, inneh\u00e5ller flera upps\u00e4ttningar med anv\u00e4ndarinformation, inneh\u00e5ller flera metoder f\u00f6r autentisering av klienten eller \u00e4r felformaterad p\u00e5 n\u00e5got annat s\u00e4tt.
invalid_scope=Omf\u00e5nget \u00e4r ogiltigt: {0}
invalid_scope.explanation=Det beg\u00e4rda omf\u00e5nget \u00e4r ogiltigt, ok\u00e4nt, felformaterat eller \u00f6verskrider det omf\u00e5ng som \u00e4r angett av resurs\u00e4garen.
server_error=Det uppstod ett serverfel: {0}
server_error.explanation=Det uppstod ett ov\u00e4ntat villkor p\u00e5 autentiseringsservern vilket medf\u00f6rde att det inte gick att slutf\u00f6ra beg\u00e4ran.
server_rejected_request=Beg\u00e4ran avvisades p\u00e5 servern. Statuskod: {0}
server_rejected_request.explanation=En OAuth2Request-beg\u00e4ran skapades p\u00e5 servern, men beg\u00e4ran avvisades av tj\u00e4nsteleverant\u00f6ren.
temporarily_unavailable=Tj\u00e4nsten \u00e4r inte tillg\u00e4nglig: {0}
temporarily_unavailable.explanation=Det gick inte att hantera beg\u00e4ran p\u00e5 autentiseringsservern eftersom servern \u00e4r \u00f6verbelastad eller i underh\u00e5llsl\u00e4ge.
token_response_problem=Svaret fr\u00e5n elementslutpunkten bearbetas: {0}
token_response_problem.explanation=Ett svar s\u00e4ndes fr\u00e5n elementslutpunkten som det inte gick att bearbeta p\u00e5 servern.
unauthorized_client=Klienten \u00e4r inte autentiserad: {0}
unauthorized_client.explanation=Klienten \u00e4r inte autentiserad f\u00f6r att beg\u00e4ra ett \u00e5tkomstelement med hj\u00e4lp av den angivna metoden.
unsupported_grant_type=Det g\u00e5r inte att anv\u00e4nda tilldelningstypen {0}
unsupported_grant_type.explanation=Det finns inga funktioner p\u00e5 autentiseringsservern f\u00f6r att tillhandah\u00e5lla ett \u00e5tkomstelement med hj\u00e4lp av den angivna metoden.
unsupported_response_type=Det g\u00e5r inte att anv\u00e4nda svarstypen {0}
unsupported_response_type.explanation=Det finns inga funktioner p\u00e5 autentiseringsservern f\u00f6r att tillhandah\u00e5lla en autentiseringskod med hj\u00e4lp av den angivna metoden.
mac_token_problem=mac-element som beg\u00e4rs: {0}
mac_token_problem.explanation=Det gick inte att l\u00e4gga till mac-elementet i beg\u00e4ran p\u00e5 resursservern.
bearer_token_problem=bearer-element som beg\u00e4rs: {0}
bearer_token_problem.explanation=Det gick inte att l\u00e4gga till bearer-elementet i beg\u00e4ran p\u00e5 resursservern.
authentication_problem=Klientautentisering som l\u00e4ggs till: {0}
authentication_problem.explanation=Det gick inte att l\u00e4gga till autentiseringshuvudena till beg\u00e4ran.
unknown_problem=Det uppstod ett ok\u00e4nt fel: {0}
unknown_problem.explanation=Kontakta administrat\u00f6ren och be honom/henne att unders\u00f6ka problemet.
code_grant_problem=\u00c5tkomstelement som h\u00e4mtas fr\u00e5n autentiseringskoden: {0}
code_grant_problem.explanation=Det uppstod ett fel i autentiseringskodfl\u00f6det.
