# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= \u0642\u0627\u0645 {0} \u0628\u0627\u0643\u062a\u0634\u0627\u0641 \u062e\u0637\u0623 :
authorization_code_problem=\u062c\u0627\u0631\u064a \u062a\u0628\u0627\u062f\u0644 \u0643\u0648\u062f \u0627\u0644\u0635\u0644\u0627\u062d\u064a\u0627\u062a \u0644\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 \u0644\u0644\u062a\u0648\u0635\u0644 : {0}
authorization_code_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623 \u0639\u0646\u062f \u062a\u0628\u0627\u062f\u0644 \u0643\u0648\u062f \u0627\u0644\u062a\u0648\u062b\u064a\u0642 \u0627\u0644\u0649 \u200f\u200eaccess_token\u200e\u200f.
authorize_problem=\u062a\u0645 \u0628\u062f\u0621 \u0639\u0645\u0644\u064a\u0629 \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u0627\u0644\u0649 {0}.
authorize_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623 \u0639\u0646\u062f \u0628\u062f\u0621 \u0639\u0645\u0644\u064a\u0629 \u0627\u0644\u062a\u0631\u062e\u064a\u0635.
callback_problem=\u062c\u0627\u0631\u064a \u062a\u0634\u063a\u064a\u0644 \u0627\u0639\u0627\u062f\u0629 \u062a\u0648\u062c\u064a\u0647 \u0627\u0644\u0627\u0633\u062a\u062c\u0627\u0628\u0629 : {0}
callback_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623 \u0639\u0646\u062f \u062a\u0634\u063a\u064a\u0644 \u0627\u0639\u0627\u062f\u0629 \u0627\u0644\u062a\u0648\u062c\u064a\u0647 \u0644\u0644\u0627\u0633\u062a\u062c\u0627\u0628\u0629 \u0645\u0646 \u062c\u0647\u0629 \u0627\u062a\u0627\u062d\u0629 \u0627\u0644\u062e\u062f\u0645\u0629.
client_credentials_problem=\u062c\u0627\u0631\u064a \u0627\u0633\u062a\u0631\u062c\u0627\u0639 \u200f\u200eaccess_token\u200e\u200f \u0644\u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0644\u0627\u0639\u062a\u0645\u0627\u062f \u0644\u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629 \u0627\u0644\u062a\u0627\u0644\u064a : {0}
client_credentials_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623 \u0639\u0646\u062f \u0627\u0633\u062a\u0631\u062c\u0627\u0639 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 \u0644\u0644\u062a\u0648\u0635\u0644 \u0641\u064a \u0645\u0633\u0627\u0631 \u200f\u200eclient_credentials\u200e\u200f.
fetch_init_problem=\u062c\u0627\u0631\u064a \u0627\u0644\u0627\u0639\u062f\u0627\u062f \u0644\u0628\u062f\u0621 OAuth2Request: {0}
fetch_init_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623 \u0645\u0646\u062e\u0641\u0636 \u0627\u0644\u0645\u0633\u062a\u0648\u0649 \u0639\u0646\u062f \u0627\u0644\u0627\u0639\u062f\u0627\u062f \u0644\u0628\u062f\u0621 OAuth2Request.
fetch_problem=\u062a\u0646\u0641\u064a\u0630 OAuth2Request.fetch() : {0}
fetch_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623 \u0639\u0646\u062f \u0627\u0635\u062f\u0627\u0631 \u0627\u062d\u0636\u0627\u0631 OAuth2Request.
gadget_spec_problem=\u062c\u0627\u0631\u064a \u062a\u0634\u063a\u064a\u0644 \u0645\u062d\u062f\u062f\u0627\u062a \u0627\u0644\u0623\u062f\u0627\u0629 \u0627\u0644\u062a\u0627\u0644\u064a\u0629 : {0}
gadget_spec_problem.explanation=\u0644\u0645 \u064a\u062a\u0645 \u0627\u064a\u062c\u0627\u062f \u0645\u0648\u0627\u0635\u0641\u0627\u062a \u0627\u0644\u0623\u062f\u0627\u0629.  \u0623\u0637\u0644\u0628 \u0645\u0646 \u0645\u0648\u062c\u0647 \u0627\u0644\u0646\u0638\u0627\u0645 \u0623\u0646 \u064a\u0642\u0648\u0645 \u0628\u062a\u0648\u0635\u064a\u0641 \u0627\u0644\u0623\u062f\u0627\u0629 \u0627\u0644\u062e\u0627\u0635\u0629 \u0628\u0643 \u0644\u0644\u062a\u0639\u0627\u0645\u0644 \u0645\u0639 OAuth2.0.
get_oauth2_accessor_problem=\u0627\u062d\u0636\u0627\u0631 OAuth2Accessor \u0627\u0644\u0649 OAuth2Request : {0}
get_oauth2_accessor_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623. \u0623\u0637\u0644\u0628 \u0645\u0646 \u0645\u0648\u062c\u0647 \u0627\u0644\u0646\u0638\u0627\u0645 \u0623\u0646 \u064a\u0642\u0648\u0645 \u0628\u062a\u0643\u0648\u064a\u0646 \u0631\u0627\u0628\u0637 OAuth2.0 Client \u0644\u0647\u0630\u0647 \u0627\u0644\u0623\u062f\u0627\u0629 \u0648\u0627\u0644\u062e\u062f\u0645\u0629.
lookup_spec_problem=\u062c\u0627\u0631\u064a \u0627\u0633\u062a\u0631\u062c\u0627\u0639 \u0645\u0648\u0627\u0635\u0641\u0627\u062a \u0627\u0644\u0623\u062f\u0627\u0629 : {0}
lookup_spec_problem.explanation=\u0644\u0645 \u064a\u062a\u0645 \u0627\u064a\u062c\u0627\u062f \u0645\u0648\u0627\u0635\u0641\u0627\u062a \u0627\u0644\u0623\u062f\u0627\u0629.  \u0623\u0637\u0644\u0628 \u0645\u0646 \u0645\u0648\u062c\u0647 \u0627\u0644\u0646\u0638\u0627\u0645 \u0623\u0646 \u064a\u0642\u0648\u0645 \u0628\u062a\u0648\u0635\u064a\u0641 \u0627\u0644\u0623\u062f\u0627\u0629 \u0627\u0644\u062e\u0627\u0635\u0629 \u0628\u0643 \u0644\u0644\u062a\u0639\u0627\u0645\u0644 \u0645\u0639 OAuth2.0.
missing_fetch_params=\u0645\u0639\u0627\u0645\u0644\u0627\u062a \u0627\u0644\u0627\u062d\u0636\u0627\u0631 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629 \u0627\u0644\u062a\u0627\u0644\u064a\u0629 \u063a\u064a\u0631 \u0645\u0648\u062c\u0648\u062f\u0629 : {0}
missing_fetch_params.explanation=\u062a\u0645 \u0627\u0633\u062a\u062f\u0639\u0627\u0621 \u0627\u0644\u0637\u0631\u064a\u0642\u0629 fetch() \u0628\u0645\u0639\u0627\u0645\u0644\u0627\u062a \u063a\u064a\u0631 \u0635\u062d\u064a\u062d\u0629.
missing_server_response=\u062d\u062f\u062b \u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0627\u0633\u062a\u062c\u0627\u0628\u0629 \u062c\u0647\u0629 \u062a\u0642\u062f\u064a\u0645 \u0627\u0644\u062e\u062f\u0645\u0629 \u200f\u200eOAuth2.0\u200e\u200f : {0}
missing_server_response.explanation=\u0642\u0627\u0645\u062a \u0648\u062d\u062f\u0629 \u0627\u0644\u062e\u062f\u0645\u0629 \u0628\u062a\u0643\u0648\u064a\u0646 OAuth2Request \u0635\u062d\u064a\u062d \u0648\u0644\u0643\u0646\u0647\u0627 \u0643\u0627\u0646\u062a \u063a\u064a\u0631 \u0645\u062a\u0627\u062d\u0629 \u0644\u0627\u0635\u062f\u0627\u0631 \u0627\u0644\u0637\u0644\u0628 \u0623\u0648 \u0642\u0645 \u0628\u0627\u0644\u062d\u0635\u0648\u0644 \u0639\u0644\u0649 \u0627\u0633\u062a\u062c\u0627\u0628\u0629 \u0635\u062d\u064a\u062d\u0629 \u0645\u0646 \u062c\u0647\u0629 \u0627\u062a\u0627\u062d\u0629 \u0627\u0644\u062e\u062f\u0645\u0629.
no_response_handler=\u0644\u0645 \u064a\u0642\u0645 \u0628\u0631\u0646\u0627\u0645\u062c \u0645\u0639\u0627\u0644\u062c\u0629 \u0627\u0644\u0627\u0633\u062a\u062c\u0627\u0628\u0629 \u0628\u062a\u0634\u063a\u064a\u0644 \u0627\u0644\u0627\u0633\u062a\u062c\u0627\u0628\u0629 \u0627\u0644\u062a\u0627\u0644\u064a\u0629 : {0}
no_response_handler.explanation=\u0628\u0631\u0646\u0627\u0645\u062d \u0627\u0644\u0645\u0639\u0627\u0644\u062c\u0629 \u0644\u0644\u0627\u0633\u062a\u062c\u0627\u0628\u0629 \u063a\u064a\u0631 \u0645\u0648\u062c\u0648\u062f \u0644\u064a\u0642\u0648\u0645 \u0628\u062a\u0634\u063a\u064a\u0644 \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u0648\u0627\u0644\u0646\u0642\u0627\u0637 \u0627\u0644\u0637\u0631\u0641\u064a\u0629 \u0644\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632. AuthorizationEndpointResponseHandler \u0623\u0648 TokenEndpointResponseHandler.
no_gadget_spec=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u064a\u062c\u0627\u062f \u0645\u0648\u0627\u0635\u0641\u0627\u062a \u0627\u0644\u0623\u062f\u0627\u0629 \u0627\u0644\u0649 {0}.
no_gadget_spec.explanation=\u0644\u0645 \u064a\u062a\u0645 \u0627\u064a\u062c\u0627\u062f \u0645\u0648\u0627\u0635\u0641\u0627\u062a \u0627\u0644\u0623\u062f\u0627\u0629.  \u0623\u0637\u0644\u0628 \u0645\u0646 \u0645\u0648\u062c\u0647 \u0627\u0644\u0646\u0638\u0627\u0645 \u0623\u0646 \u064a\u0642\u0648\u0645 \u0628\u062a\u0648\u0635\u064a\u0641 \u0627\u0644\u0623\u062f\u0627\u0629 \u0627\u0644\u062e\u0627\u0635\u0629 \u0628\u0643 \u0644\u0644\u062a\u0639\u0627\u0645\u0644 \u0645\u0639 OAuth2.0.
refresh_token_problem=\u062c\u0627\u0631\u064a \u062a\u0628\u0627\u062f\u0644 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 \u0644\u0644\u062a\u062c\u062f\u064a\u062f \u0627\u0644\u0649 \u200f\u200eaccess_token\u200e\u200f : {0}
refresh_token_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623 \u0639\u0646\u062f \u062a\u0628\u0627\u062f\u0644 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 \u0644\u0644\u062a\u062c\u062f\u064a\u062f \u0644\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 \u0644\u0644\u062a\u0648\u0635\u0644.
secret_encryption_problem=\u062c\u0627\u0631\u064a \u062a\u0634\u0641\u064a\u0631 \u0633\u0631 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 \u0644\u0644\u0627\u0633\u062a\u0645\u0631\u0627\u0631 : {0}
secret_encryption_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623 \u0639\u0646\u062f \u062a\u062e\u0632\u064a\u0646 \u0623\u0633\u0631\u0627\u0631 OAuth2.0 \u0645\u0639 \u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0634\u0641\u064a\u0631 \u0627\u0644\u0645\u0642\u062f\u0645\u0629.
access_denied=\u062a\u0645 \u0631\u0641\u0636 \u0627\u0644\u0627\u062a\u0635\u0627\u0644.
access_denied.explanation=\u0642\u0627\u0645 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 \u0628\u0631\u0641\u0636 \u0623\u0648 \u0627\u0644\u063a\u0627\u0621 \u0627\u0644\u0635\u0644\u0627\u062d\u064a\u0627\u062a \u0645\u0639 \u062c\u0647\u0629 \u062a\u0642\u062f\u064a\u0645 \u0627\u0644\u062e\u062f\u0645\u0629.
invalid_client=\u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d : {0}
invalid_client.explanation= \u0644\u0627 \u064a\u0645\u0643\u0646 \u062a\u0648\u062b\u064a\u0642 \u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629\u060c \u0642\u062f \u064a\u0643\u0648\u0646 \u0630\u0644\u0643 \u0644\u0623\u0646 \u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629 \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641. \u0648\u0644\u0645 \u064a\u062a\u0645 \u062a\u0636\u0645\u064a\u0646 \u062a\u0648\u062b\u064a\u0642 \u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629\u060c \u0623\u0648 \u0623\u0646 \u0637\u0631\u064a\u0642\u0629 \u0627\u0644\u062a\u0648\u062b\u064a\u0642 \u063a\u064a\u0631 \u0645\u062f\u0639\u0645\u0629.
invalid_grant=\u0645\u0646\u062d \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u064a\u0639\u062f \u063a\u064a\u0631 \u0635\u062d\u064a\u062d : {0}
invalid_grant.explanation=\u0645\u0646\u062d \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d\u060c \u0623\u0648 \u0645\u0646\u062a\u0647\u064a \u0623\u0648 \u0645\u0631\u0641\u0648\u0636\u060c \u0623\u0648 \u0644\u0627 \u064a\u0637\u0627\u0628\u0642  URI \u0644\u0627\u0639\u0627\u062f\u0629 \u0627\u0644\u062a\u0648\u062c\u064a\u0647 \u0627\u0644\u0630\u064a \u064a\u062a\u0645 \u0627\u0633\u062a\u062e\u062f\u0627\u0645\u0647 \u0641\u064a \u0637\u0644\u0628 \u0627\u0644\u062a\u0631\u062e\u064a\u0635\u060c \u0623\u0648 \u062a\u0645 \u0627\u0635\u062f\u0627\u0631\u0647 \u0644\u0628\u0631\u0646\u0627\u0645\u062c \u0622\u062e\u0631. \u0645\u0646\u062d \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u064a\u0645\u0643\u0646 \u0623\u0646 \u064a\u062a\u0636\u0645\u0646 \u0643\u0648\u062f \u0627\u0644\u062a\u0631\u062e\u064a\u0635\u060c \u0623\u0648 \u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0644\u0627\u0639\u062a\u0645\u0627\u062f \u0644\u0645\u0627\u0644\u0643 \u0627\u0644\u0645\u0635\u062f\u0631\u060c \u0623\u0648 \u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0644\u0627\u0639\u062a\u0645\u0627\u062f \u0644\u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629.
invalid_request=\u0627\u0644\u0637\u0644\u0628 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d : {0}
invalid_request.explanation=\u0627\u0644\u0637\u0644\u0628 \u064a\u0639\u062f \u063a\u064a\u0631 \u0635\u062d\u064a\u062d \u0644\u0623\u0646\u0647 \u064a\u0641\u062a\u0642\u062f \u0623\u062d\u062f \u0627\u0644\u0645\u0639\u0627\u0645\u0644\u0627\u062a \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629\u060c \u0623\u0648 \u064a\u062a\u0636\u0645\u0646 \u0642\u064a\u0645\u0629 \u0645\u0639\u0627\u0645\u0644 \u063a\u064a\u0631 \u0645\u062f\u0639\u0645\u0629\u060c \u0623\u0648 \u064a\u0642\u0648\u0645 \u0628\u062a\u0643\u0631\u0627\u0631 \u0623\u062d\u062f \u0627\u0644\u0645\u0639\u0627\u0645\u0644\u0627\u062a\u060c \u0623\u0648 \u064a\u062a\u0636\u0645\u0646 \u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0639\u062a\u0645\u0627\u062f \u0645\u062a\u0639\u062f\u062f\u0629\u060c \u0623\u0648 \u064a\u0642\u0648\u0645 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0623\u0643\u062b\u0631 \u0645\u0646 \u0648\u0627\u062d\u062f\u0629 \u0645\u0646 \u0622\u0644\u064a\u062a \u0627\u0644\u062a\u0648\u062b\u064a\u0642\u0629 \u0644\u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629\u060c \u0623\u0648 \u0628\u0647 \u062a\u0644\u0641 \u0622\u062e\u0631.
invalid_scope=\u0627\u0644\u0646\u0637\u0627\u0642 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d : {0}
invalid_scope.explanation=\u0627\u0644\u0646\u0637\u0627\u0642 \u0627\u0644\u0645\u0637\u0644\u0648\u0628 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d \u0623\u0648 \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641 \u0623\u0648 \u0628\u0647 \u062a\u0644\u0641\u060c \u0623\u0648 \u064a\u062a\u0639\u062f\u0649 \u0627\u0644\u0646\u0637\u0627\u0642 \u0627\u0644\u0630\u064a \u064a\u062a\u064a\u062d\u0647 \u0645\u0627\u0644\u0643 \u0627\u0644\u0645\u0635\u062f\u0631.
server_error=\u062d\u062f\u062b \u062e\u0637\u0623 \u0628\u0648\u062d\u062f\u0629 \u0627\u0644\u062e\u062f\u0645\u0629: {0}
server_error.explanation=\u0627\u0643\u062a\u0634\u0641\u062a \u0648\u062d\u062f\u0629 \u062e\u062f\u0645\u0629 \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u062d\u0627\u0644\u0629 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d\u0629 \u062a\u0645\u0646\u0639 \u0627\u0644\u0648\u0641\u0627\u0621 \u0628\u0627\u0644\u0637\u0644\u0628.
server_rejected_request=\u0642\u0627\u0645\u062a \u0648\u062d\u062f\u0629 \u0627\u0644\u062e\u062f\u0645\u0629 \u0628\u0631\u0641\u0636 \u0627\u0644\u0637\u0644\u0628 : \u0643\u0648\u062f \u0627\u0644\u062d\u0627\u0644\u0629 = {0}
server_rejected_request.explanation=\u0642\u0627\u0645\u062a \u0648\u062d\u062f\u0629 \u0627\u0644\u062e\u062f\u0645\u0629 \u0628\u062a\u0643\u0648\u064a\u0646 OAuth2Request\u060c \u0648\u0644\u0643\u0646 \u0642\u0627\u0645\u062a \u062c\u0647\u0629 \u062a\u0642\u062f\u064a\u0645 \u0627\u0644\u062e\u062f\u0645\u0629 \u0628\u0631\u0641\u0636\u0647.
temporarily_unavailable=\u0648\u062d\u062f\u0629 \u0627\u0644\u062e\u062f\u0645\u0629 \u063a\u064a\u0631 \u0645\u062a\u0627\u062d\u0629 \u0628\u0635\u0641\u0629 \u0645\u0624\u0642\u062a\u0629 : {0}
temporarily_unavailable.explanation=\u0648\u062d\u062f\u0629 \u062e\u062f\u0645\u0629 \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u063a\u064a\u0631 \u0645\u062a\u0627\u062d\u0629 \u0644\u0645\u0639\u0627\u0644\u062c\u0629 \u0627\u0644\u0637\u0644\u0628\u060c \u0628\u0633\u0628\u0628 \u0632\u064a\u0627\u062f\u0629 \u0627\u0644\u062a\u062d\u0645\u064a\u0644 \u0628\u0635\u0641\u0629 \u0645\u0624\u0642\u062a\u0629 \u0623\u0648 \u062c\u0627\u0631\u064a \u0627\u062c\u0631\u0627\u0621 \u0635\u064a\u0627\u0646\u0629 \u0644\u0647\u0627.
token_response_problem=\u062c\u0627\u0631\u064a \u062a\u0634\u063a\u064a\u0644 \u0627\u0644\u0627\u0633\u062a\u062c\u0627\u0628\u0629 \u0645\u0646 \u0627\u0644\u0646\u0642\u0637\u0629 \u0627\u0644\u0637\u0631\u0641\u064a\u0629 \u0644\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 : {0}
token_response_problem.explanation=\u0642\u0627\u0645\u062a \u0627\u0644\u0646\u0642\u0637\u0629 \u0627\u0644\u0637\u0631\u0641\u064a\u0629 \u0644\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 \u0628\u0627\u0631\u0633\u0627\u0644 \u0627\u0633\u062a\u062c\u0627\u0628\u0629 \u0628\u0623\u0646 \u0648\u062d\u062f\u0629 \u0627\u0644\u062e\u062f\u0645\u0629 \u0644\u0627 \u064a\u0645\u0643\u0646\u0647\u0627 \u0627\u0644\u062a\u0634\u063a\u064a\u0644.
unauthorized_client=\u0644\u0627 \u062a\u062a\u0648\u0627\u0641\u0631 \u0635\u0644\u0627\u062d\u064a\u0627\u062a \u0644\u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629 : {0}
unauthorized_client.explanation=\u063a\u064a\u0631 \u0645\u0635\u0631\u062d \u0644\u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629 \u0628\u0637\u0644\u0628 \u0627\u0644\u062a\u0648\u0635\u0644 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0647\u0630\u0647 \u0627\u0644\u0637\u0631\u064a\u0642\u0629.
unsupported_grant_type=\u0646\u0648\u0639 \u0627\u0644\u0645\u0646\u062d \u063a\u064a\u0631 \u0645\u062f\u0639\u0645 : {0}
unsupported_grant_type.explanation=\u0648\u062d\u062f\u0629 \u062e\u062f\u0645\u0629 \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u0644\u0627 \u062a\u062f\u0639\u0645 \u0627\u0644\u062d\u0635\u0648\u0644 \u0639\u0644\u0649 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 \u0644\u0644\u062a\u0648\u0635\u0644 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0647\u0630\u0647 \u0627\u0644\u0637\u0631\u064a\u0642\u0629.
unsupported_response_type=\u0646\u0648\u0639 \u0627\u0644\u0627\u0633\u062a\u062c\u0627\u0628\u0629 \u063a\u064a\u0631 \u0645\u062f\u0639\u0645: {0}
unsupported_response_type.explanation=\u0648\u062d\u062f\u0629 \u062e\u062f\u0645\u0629 \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u0644\u0627 \u062a\u062f\u0639\u0645 \u0627\u0644\u062d\u0635\u0648\u0644 \u0639\u0644\u0649 \u0643\u0648\u062f \u0627\u0644\u062a\u0631\u062e\u064a\u0635 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0647\u0630\u0647 \u0627\u0644\u0637\u0631\u064a\u0642\u0629.
mac_token_problem=\u062c\u0627\u0631\u064a \u0637\u0644\u0628 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 mac : {0}
mac_token_problem.explanation=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0636\u0627\u0641\u0629 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 mac \u0627\u0644\u0649 \u0648\u062d\u062f\u0629 \u062e\u062f\u0645\u0629 \u0627\u0644\u0645\u0635\u062f\u0631.
bearer_token_problem=\u062c\u0627\u0631\u064a \u0637\u0644\u0628 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 bearer : {0}
bearer_token_problem.explanation=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0636\u0627\u0641\u0629 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 bearer \u0627\u0644\u0649 \u0648\u062d\u062f\u0629 \u062e\u062f\u0645\u0629 \u0627\u0644\u0645\u0635\u062f\u0631.
authentication_problem=\u062c\u0627\u0631\u064a \u0627\u0636\u0627\u0641\u0629 \u062a\u0648\u062b\u064a\u0642 \u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062a\u0627\u0628\u0639\u0629 : {0}
authentication_problem.explanation=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0636\u0627\u0641\u0629 \u0639\u0646\u0627\u0648\u064a\u0646 \u0627\u0644\u062a\u0648\u062b\u064a\u0642 \u0627\u0644\u0649 \u0627\u0644\u0637\u0644\u0628.
unknown_problem=\u062d\u062f\u062b \u062e\u0637\u0623 \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641 : {0}
unknown_problem.explanation=\u0623\u0637\u0644\u0628 \u0645\u0646 \u0645\u0648\u062c\u0647 \u0627\u0644\u0646\u0638\u0627\u0645 \u0627\u0644\u062a\u0639\u0631\u0641 \u0639\u0644\u0649 \u0627\u0644\u0645\u0634\u0643\u0644\u0629.
code_grant_problem=\u062c\u0627\u0631\u064a \u0627\u0644\u062d\u0635\u0648\u0644 \u0639\u0644\u0649 \u0627\u0644\u0631\u0645\u0632 \u0627\u0644\u0645\u0645\u064a\u0632 \u0644\u0644\u062a\u0648\u0635\u0644 \u0645\u0646 \u0643\u0648\u062f \u0627\u0644\u062a\u0631\u062e\u064a\u0635 : {0}
code_grant_problem.explanation=\u062d\u062f\u062b \u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0645\u0633\u0627\u0631 \u0643\u0648\u062f \u0627\u0644\u062a\u0631\u062e\u064a\u0635.
