# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= {0} ha trobat un error :
authorization_code_problem=El codi d''autoritzaci\u00f3 s''intercanviar\u00e0 pel testimoni d''acc\u00e9s : {0}
authorization_code_problem.explanation=S'ha produ\u00eft un error en intercanviar el codi d'autoritzaci\u00f3 d'access_token.
authorize_problem=S''est\u00e0 iniciant el proc\u00e9s d''autoritzaci\u00f3 de {0}.
authorize_problem.explanation=S'ha produ\u00eft un error en iniciar el proc\u00e9s d'autoritzaci\u00f3.
callback_problem=S''est\u00e0 processant la resposta redirigida : {0}
callback_problem.explanation=S'ha produ\u00eft un error en processar la resposta redirigida des del prove\u00efdor de serveis.
client_credentials_problem=L''access_token s''est\u00e0 recuperant per al client amb la seg\u00fcent credencial de client : {0}
client_credentials_problem.explanation=S'ha produ\u00eft un error en recuperar el testimoni d'acc\u00e9s al flux de credencials de client.
fetch_init_problem=L''OAuth2Request s''est\u00e0 inicialitzant: {0}
fetch_init_problem.explanation=S'ha produ\u00eft un error de nivell baix en inicialitzar l'obtenci\u00f3 d'OAuth2Request.
fetch_problem=s''est\u00e0 executant OAuth2Request.fetch() : {0}
fetch_problem.explanation=S'ha produ\u00eft un error en emetre l'obtenci\u00f3 d'OAuth2Request.
gadget_spec_problem=S''est\u00e0 processant la seg\u00fcent especificaci\u00f3 de gadget : {0}
gadget_spec_problem.explanation=No s'ha trobat cap especificaci\u00f3 de gadget.  Demaneu a l'administrador que configuri el gadget per treballar amb OAuth2.0.
get_oauth2_accessor_problem=s''est\u00e0 obtenint un OAuth2Accessor per a l''OAuth2Request : {0}
get_oauth2_accessor_problem.explanation=S'ha produ\u00eft un error. Demaneu a l'administrador que cre\u00ef una vinculaci\u00f3 de client OAuth2.0 per aquest gadget i servei.
lookup_spec_problem=S''est\u00e0 recuperant l''especificaci\u00f3 del gadget : {0}
lookup_spec_problem.explanation=No s'ha trobat cap especificaci\u00f3 de gadget.  Demaneu a l'administrador que configuri el gadget per treballar amb OAuth2.0.
missing_fetch_params=Falten els seg\u00fcents par\u00e0metres d''obtenci\u00f3 necessaris : {0}
missing_fetch_params.explanation=S'ha cridat el m\u00e8tode fetch() amb par\u00e0metres incorrectes.
missing_server_response=S''ha produ\u00eft un error durant la resposta del prove\u00efdor de servei OAuth2.0 : {0}
missing_server_response.explanation=El servidor ha creat un OAuth2Request v\u00e0lid, per\u00f2 no ha pogut emetre la sol\u00b7licitud o no ha pogut obtenir una resposta v\u00e0lida del prove\u00efdor de servei.
no_response_handler=Un gestor de respostes no ha processat la resposta seg\u00fcent : {0}
no_response_handler.explanation=El gestor de respostes no existeix per processar els punts finals d'autoritzaci\u00f3 i de testimoni.AuthorizationEndpointResponseHandler o TokenEndpointResponseHandler.
no_gadget_spec=No es troba l''especificaci\u00f3 de gadget de {0}.
no_gadget_spec.explanation=No s'ha trobat cap especificaci\u00f3 de gadget.  Demaneu a l'administrador que configuri el gadget per treballar amb OAuth2.0.
refresh_token_problem=El codi d''autoritzaci\u00f3 s''intercanviar\u00e0 pel testimoni d''acc\u00e9s : {0}
refresh_token_problem.explanation=S'ha produ\u00eft un error en intercanviar el codi d'actualitzaci\u00f3 pel testimoni d'access.
secret_encryption_problem=El testimoni secret s''est\u00e0 xifrant per persist\u00e8ncia: {0}
secret_encryption_problem.explanation=S'ha produ\u00eft un error en emmagatzemar secrets OAuth2.0 amb el m\u00f2dul de xifrat proporcionat.
access_denied=S'ha denegat l'acc\u00e9s.
access_denied.explanation=L'usuari denegat o cancel\u00b7lat l'autoritzaci\u00f3 amb el prove\u00efdor de serveis.
invalid_client=El client no \u00e9s v\u00e0lid : {0}
invalid_client.explanation= El client no es pot autenticar, possiblement perqu\u00e8 \u00e9s desconegut, No s'ha incl\u00f2s l'autenticaci\u00f3 del client o el m\u00e8tode no se suporta.
invalid_grant=La concessi\u00f3 d''autoritzaci\u00f3 no \u00e9s v\u00e0lida : {0}
invalid_grant.explanation=La concessi\u00f3 d'autoritzaci\u00f3 no \u00e9s v\u00e0lida, ha caducat, ha estat revocada, no coincideix amb l'URI de redirecci\u00f3 de la sol\u00b7licitud d'autoritzaci\u00f3 o ha estat emesa per un altre client. La concessi\u00f3 d'autoritzaci\u00f3 pot incloure el codi d'autoritzaci\u00f3, les credencials del propietari del recurs o les credencials del client.
invalid_request=La sol\u00b7licitud no \u00e9s v\u00e0lida : {0}
invalid_request.explanation=La sol\u00b7licitud no \u00e9s v\u00e0lida perqu\u00e8 falta un par\u00e0metre necessari, inclou un valor de par\u00e0metre no adm\u00e8s, inclou diverses credencials, utilitza m\u00e9s d'un mecanisme per autenticar el client o t\u00e9 un format incorrecte.
invalid_scope=L''\u00e0mbit no \u00e9s v\u00e0lid : {0}
invalid_scope.explanation=L'\u00e0mbit sol\u00b7licitat no \u00e9s v\u00e0lid, \u00e9s desconegut, t\u00e9 un format incorrecte o supera l'\u00e0mbit atorgat pel propietari de recurs.
server_error=S''ha produ\u00eft un error de servidor: {0}
server_error.explanation=El servidor d'autoritzaci\u00f3 ha trobat una condici\u00f3 inesperada que ha evitat que es completi la sol\u00b7licitud.
server_rejected_request=El servidor ha rebutjat la sol\u00b7licitud : statuscode = {0}
server_rejected_request.explanation=El servidor ha creat un OAuth2Request, per\u00f2 el prove\u00efdor de servei l'ha rebutjat.
temporarily_unavailable=El servei no est\u00e0 disponible en aquests moments : {0}
temporarily_unavailable.explanation=El servidor d'autoritzaci\u00f3 no pot gestionar la sol\u00b7licitud perqu\u00e8 est\u00e0 temporalment sobrecarregat o en mode de manteniment.
token_response_problem=La resposta del punt final de testimoni s''est\u00e0 processant: {0}
token_response_problem.explanation=El punt final de testimoni ha enviat una resposta que el servidor no ha pogut processar.
unauthorized_client=El client no est\u00e0 autoritzat : {0}
unauthorized_client.explanation=El client no est\u00e0 autoritzat per sol\u00b7licitar un acc\u00e9s al testimoni utilitzant aquest m\u00e8tode.
unsupported_grant_type=El tipus de concessi\u00f3 si no s''admet : {0}
unsupported_grant_type.explanation=El servidor d'autoritzaci\u00f3 no admet l'obtenci\u00f3 del testimoni d'acc\u00e9s utilitzant aquest m\u00e8tode.
unsupported_response_type=El tipus de resposta no s''admet: {0}
unsupported_response_type.explanation=El servidor d'autoritzaci\u00f3 no admet l'obtenci\u00f3 d'un codi d'autoritzaci\u00f3 utilitzant aquest m\u00e8tode.
mac_token_problem=S''est\u00e0 sol\u00b7licitant el testimoni mac : {0}
mac_token_problem.explanation=El testimoni mac a la sol\u00b7licitud no s'ha pogut afegir al servidor de recursos.
bearer_token_problem=S''est\u00e0 sol\u00b7licitant el testimoni portador : {0}
bearer_token_problem.explanation=El testimoni portador a la sol\u00b7licitud no s'ha pogut afegir al servidor de recursos.
authentication_problem=S''est\u00e0 afegint l''autenticaci\u00f3 de client : {0}
authentication_problem.explanation=Les cap\u00e7aleres d'autenticaci\u00f3 no s'han pogut afegir a la sol\u00b7licitud.
unknown_problem=S''ha produ\u00eft un error desconegut : {0}
unknown_problem.explanation=Demaneu a l'administrador que investigui el problema.
code_grant_problem=S''est\u00e0 obtenint el testimoni d''acc\u00e9s del codi d''autoritzaci\u00f3 : {0}
code_grant_problem.explanation=S'ha produ\u00eft un error durant el flux de codi d'autoritzaci\u00f3.
