# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= {0} \u3067\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f :
authorization_code_problem=\u30a2\u30af\u30bb\u30b9\u30fb\u30c8\u30fc\u30af\u30f3\u7528\u306b\u8a31\u53ef\u30b3\u30fc\u30c9\u3092\u4ea4\u63db\u3057\u3066\u3044\u307e\u3059 : {0}
authorization_code_problem.explanation=\u30a2\u30af\u30bb\u30b9\u30fb\u30c8\u30fc\u30af\u30f3\u7528\u306b\u8a31\u53ef\u30b3\u30fc\u30c9\u3092\u4ea4\u63db\u3059\u308b\u969b\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
authorize_problem={0} \u306e\u8a31\u53ef\u30d7\u30ed\u30bb\u30b9\u3092\u958b\u59cb\u3057\u3066\u3044\u307e\u3059\u3002
authorize_problem.explanation=\u8a31\u53ef\u30d7\u30ed\u30bb\u30b9\u306e\u958b\u59cb\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
callback_problem=\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u5fdc\u7b54\u3092\u51e6\u7406\u3057\u3066\u3044\u307e\u3059 : {0}
callback_problem.explanation=\u30b5\u30fc\u30d3\u30b9\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304b\u3089\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u5fdc\u7b54\u306e\u51e6\u7406\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
client_credentials_problem=\u4ee5\u4e0b\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8cc7\u683c\u60c5\u5831\u3092\u6301\u3064\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u30a2\u30af\u30bb\u30b9\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u3059 : {0}
client_credentials_problem.explanation=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8cc7\u683c\u60c5\u5831\u30d5\u30ed\u30fc\u3067\u30a2\u30af\u30bb\u30b9\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u53d6\u5f97\u3059\u308b\u969b\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
fetch_init_problem=OAuth2Request \u3092\u521d\u671f\u5316\u3057\u3066\u3044\u307e\u3059: {0}
fetch_init_problem.explanation=OAuth2Request \u306e\u53d6\u308a\u51fa\u3057\u3092\u521d\u671f\u5316\u3059\u308b\u969b\u306b\u4f4e\u30ec\u30d9\u30eb\u30fb\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
fetch_problem=OAuth2Request.fetch() \u3092\u5b9f\u884c\u3057\u3066\u3044\u307e\u3059 : {0}
fetch_problem.explanation=OAuth2Request \u306e\u53d6\u308a\u51fa\u3057\u3092\u767a\u884c\u3059\u308b\u969b\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
gadget_spec_problem=\u4ee5\u4e0b\u306e\u30ac\u30b8\u30a7\u30c3\u30c8\u4ed5\u69d8\u3092\u51e6\u7406\u3057\u3066\u3044\u307e\u3059 : {0}
gadget_spec_problem.explanation=\u30ac\u30b8\u30a7\u30c3\u30c8\u4ed5\u69d8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  OAuth2.0 \u3068\u9023\u52d5\u3059\u308b\u3088\u3046\u306b\u30ac\u30b8\u30a7\u30c3\u30c8\u3092\u69cb\u6210\u3059\u308b\u3053\u3068\u3092\u7ba1\u7406\u8005\u306b\u4f9d\u983c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
get_oauth2_accessor_problem=OAuth2Request \u306e OAuth2Accessor \u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u3059 : {0}
get_oauth2_accessor_problem.explanation=\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u3053\u306e\u30ac\u30b8\u30a7\u30c3\u30c8\u3068\u30b5\u30fc\u30d3\u30b9\u306b\u5bfe\u3057\u3066 OAuth2.0 \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3092\u4f5c\u6210\u3059\u308b\u3088\u3046\u306b\u7ba1\u7406\u8005\u306b\u4f9d\u983c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
lookup_spec_problem=\u30ac\u30b8\u30a7\u30c3\u30c8\u4ed5\u69d8\u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u3059 : {0}
lookup_spec_problem.explanation=\u30ac\u30b8\u30a7\u30c3\u30c8\u4ed5\u69d8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  OAuth2.0 \u3068\u9023\u52d5\u3059\u308b\u3088\u3046\u306b\u30ac\u30b8\u30a7\u30c3\u30c8\u3092\u69cb\u6210\u3059\u308b\u3053\u3068\u3092\u7ba1\u7406\u8005\u306b\u4f9d\u983c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
missing_fetch_params=\u4ee5\u4e0b\u306e\u5fc5\u9808\u306e\u53d6\u308a\u51fa\u3057\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093 : {0}
missing_fetch_params.explanation=\u8aa4\u3063\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u305f fetch() \u30e1\u30bd\u30c3\u30c9\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
missing_server_response=OAuth2.0 \u30b5\u30fc\u30d3\u30b9\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u5fdc\u7b54\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f : {0}
missing_server_response.explanation=\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u6709\u52b9\u306a OAuth2Request \u3092\u4f5c\u6210\u3057\u307e\u3057\u305f\u304c\u3001\u3053\u306e\u8981\u6c42\u3092\u767a\u884c\u3067\u304d\u306a\u304b\u3063\u305f\u304b\u3001\u30b5\u30fc\u30d3\u30b9\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304b\u3089\u6709\u52b9\u306a\u5fdc\u7b54\u3092\u53d6\u5f97\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
no_response_handler=\u5fdc\u7b54\u30cf\u30f3\u30c9\u30e9\u30fc\u306f\u3001\u4ee5\u4e0b\u306e\u5fdc\u7b54\u3092\u51e6\u7406\u3057\u307e\u305b\u3093\u3067\u3057\u305f : {0}
no_response_handler.explanation=\u8a31\u53ef\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3068\u30c8\u30fc\u30af\u30f3\u30fb\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3092\u51e6\u7406\u3059\u308b\u305f\u3081\u306e\u5fdc\u7b54\u30cf\u30f3\u30c9\u30e9\u30fc\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002 AuthorizationEndpointResponseHandler \u307e\u305f\u306f TokenEndpointResponseHandler\u3002
no_gadget_spec={0} \u306e\u30ac\u30b8\u30a7\u30c3\u30c8\u4ed5\u69d8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
no_gadget_spec.explanation=\u30ac\u30b8\u30a7\u30c3\u30c8\u4ed5\u69d8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  OAuth2.0 \u3068\u9023\u52d5\u3059\u308b\u3088\u3046\u306b\u30ac\u30b8\u30a7\u30c3\u30c8\u3092\u69cb\u6210\u3059\u308b\u3053\u3068\u3092\u7ba1\u7406\u8005\u306b\u4f9d\u983c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
refresh_token_problem=\u30a2\u30af\u30bb\u30b9\u30fb\u30c8\u30fc\u30af\u30f3\u7528\u306b\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u4ea4\u63db\u3057\u3066\u3044\u307e\u3059 : {0}
refresh_token_problem.explanation=\u30a2\u30af\u30bb\u30b9\u30fb\u30c8\u30fc\u30af\u30f3\u7528\u306b\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u4ea4\u63db\u3059\u308b\u969b\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
secret_encryption_problem=\u30c8\u30fc\u30af\u30f3\u79d8\u5bc6\u60c5\u5831\u304c\u6c38\u7d9a\u5316\u7528\u306b\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u307e\u3059 : {0}
secret_encryption_problem.explanation=\u6307\u5b9a\u3055\u308c\u305f\u6697\u53f7\u5316\u30e2\u30b8\u30e5\u30fc\u30eb\u3067 OAuth2.0 \u79d8\u5bc6\u60c5\u5831\u3092\u4fdd\u7ba1\u3059\u308b\u969b\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
access_denied=\u30a2\u30af\u30bb\u30b9\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
access_denied.explanation=\u30e6\u30fc\u30b6\u30fc\u304c\u3001\u30b5\u30fc\u30d3\u30b9\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306b\u3088\u308b\u8a31\u53ef\u3092\u62d2\u5426\u3057\u305f\u304b\u3001\u53d6\u308a\u6d88\u3057\u307e\u3057\u305f\u3002
invalid_client=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u7121\u52b9\u3067\u3059: {0}
invalid_client.explanation= \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3092\u8a8d\u8a3c\u3067\u304d\u307e\u305b\u3093\u3002\u539f\u56e0\u3068\u3057\u3066\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u4e0d\u660e\u3067\u3042\u308b\u304b\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a8d\u8a3c\u304c\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u304b\u3001\u8a8d\u8a3c\u65b9\u5f0f\u304c\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u304c\u8003\u3048\u3089\u308c\u307e\u3059\u3002
invalid_grant=\u6a29\u9650\u4ed8\u4e0e\u304c\u7121\u52b9\u3067\u3059 : {0}
invalid_grant.explanation=\u6a29\u9650\u4ed8\u4e0e\u304c\u3001\u7121\u52b9\u3067\u3042\u308b\u304b\u3001\u6709\u52b9\u671f\u9650\u304c\u5207\u308c\u3066\u3044\u308b\u304b\u3001\u53d6\u308a\u6d88\u3055\u308c\u305f\u304b\u3001\u6a29\u9650\u8981\u6c42\u3067\u4f7f\u7528\u3055\u308c\u308b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8 URI \u306b\u4e00\u81f4\u3057\u306a\u3044\u304b\u3001\u5225\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u5bfe\u3057\u3066\u767a\u884c\u3055\u308c\u307e\u3057\u305f\u3002 \u6a29\u9650\u4ed8\u4e0e\u306b\u306f\u3001\u8a31\u53ef\u30b3\u30fc\u30c9\u3001\u30ea\u30bd\u30fc\u30b9\u6240\u6709\u8005\u306e\u8cc7\u683c\u60c5\u5831\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u8cc7\u683c\u60c5\u5831\u3092\u542b\u3081\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
invalid_request=\u8981\u6c42\u304c\u7121\u52b9\u3067\u3059: {0}
invalid_request.explanation=\u8981\u6c42\u304c\u7121\u52b9\u3067\u3059\u3002\u5fc5\u9808\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u7e70\u308a\u8fd4\u3057\u3066\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u3001\u8907\u6570\u306e\u8cc7\u683c\u60c5\u5831\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3092\u8a8d\u8a3c\u3059\u308b\u30e1\u30ab\u30cb\u30ba\u30e0\u304c\u8907\u6570\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u3001\u305d\u306e\u4ed6\u306e\u5f62\u5f0f\u306e\u8aa4\u308a\u304c\u3042\u308b\u305f\u3081\u3067\u3059\u3002
invalid_scope=\u7bc4\u56f2\u304c\u7121\u52b9\u3067\u3059 : {0}
invalid_scope.explanation=\u8981\u6c42\u3055\u308c\u305f\u7bc4\u56f2\u304c\u7121\u52b9\u3067\u3042\u308b\u304b\u3001\u4e0d\u660e\u3067\u3042\u308b\u304b\u3001\u5f62\u5f0f\u304c\u8aa4\u3063\u3066\u3044\u308b\u304b\u3001\u30ea\u30bd\u30fc\u30b9\u6240\u6709\u8005\u306b\u3088\u3063\u3066\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u7bc4\u56f2\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
server_error=\u30b5\u30fc\u30d0\u30fc\u30fb\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
server_error.explanation=\u8a31\u53ef\u30b5\u30fc\u30d0\u30fc\u3067\u4e88\u671f\u3057\u306a\u3044\u6761\u4ef6\u304c\u767a\u751f\u3057\u305f\u305f\u3081\u3001\u8981\u6c42\u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
server_rejected_request=\u30b5\u30fc\u30d0\u30fc\u306f\u8981\u6c42\u3092\u62d2\u5426\u3057\u307e\u3057\u305f : statuscode = {0}
server_rejected_request.explanation=\u30b5\u30fc\u30d0\u30fc\u306f OAuth2Request \u3092\u4f5c\u6210\u3057\u307e\u3057\u305f\u304c\u3001\u30b5\u30fc\u30d3\u30b9\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304c\u3053\u308c\u3092\u62d2\u5426\u3057\u307e\u3057\u305f\u3002
temporarily_unavailable=\u30b5\u30fc\u30d3\u30b9\u306f\u4e00\u6642\u7684\u306b\u5229\u7528\u3067\u304d\u307e\u305b\u3093: {0}
temporarily_unavailable.explanation=\u8a31\u53ef\u30b5\u30fc\u30d0\u30fc\u304c\u4e00\u6642\u7684\u306b\u904e\u8ca0\u8377\u306b\u306a\u3063\u3066\u3044\u308b\u304b\u3001\u4fdd\u5b88\u30e2\u30fc\u30c9\u306b\u306a\u3063\u3066\u3044\u308b\u305f\u3081\u3001\u8981\u6c42\u3092\u51e6\u7406\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
token_response_problem=\u30c8\u30fc\u30af\u30f3\u30fb\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u304b\u3089\u306e\u5fdc\u7b54\u3092\u51e6\u7406\u3057\u3066\u3044\u307e\u3059 : {0}
token_response_problem.explanation=\u30c8\u30fc\u30af\u30f3\u30fb\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u304c\u5fdc\u7b54\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\u304c\u3001\u30b5\u30fc\u30d0\u30fc\u306f\u3053\u306e\u5fdc\u7b54\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
unauthorized_client=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093 : {0}
unauthorized_client.explanation=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u306f\u3001\u3053\u306e\u65b9\u5f0f\u3092\u4f7f\u7528\u3057\u3066\u30a2\u30af\u30bb\u30b9\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u8981\u6c42\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
unsupported_grant_type=\u3053\u306e\u6a29\u9650\u4ed8\u4e0e\u30bf\u30a4\u30d7\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093 : {0}
unsupported_grant_type.explanation=\u8a31\u53ef\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u3053\u306e\u65b9\u5f0f\u3092\u4f7f\u7528\u3057\u305f\u30a2\u30af\u30bb\u30b9\u30fb\u30c8\u30fc\u30af\u30f3\u306e\u53d6\u5f97\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
unsupported_response_type=\u3053\u306e\u5fdc\u7b54\u30bf\u30a4\u30d7\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093: {0}
unsupported_response_type.explanation=\u8a31\u53ef\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u3053\u306e\u65b9\u5f0f\u3092\u4f7f\u7528\u3057\u305f\u8a31\u53ef\u30b3\u30fc\u30c9\u306e\u53d6\u5f97\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
mac_token_problem=mac \u30c8\u30fc\u30af\u30f3\u3092\u8981\u6c42\u3057\u3066\u3044\u307e\u3059 : {0}
mac_token_problem.explanation=\u8981\u6c42\u3055\u308c\u305f mac \u30c8\u30fc\u30af\u30f3\u3092\u30ea\u30bd\u30fc\u30b9\u30fb\u30b5\u30fc\u30d0\u30fc\u306b\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
bearer_token_problem=\u30d9\u30a2\u30e9\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u8981\u6c42\u3057\u3066\u3044\u307e\u3059 : {0}
bearer_token_problem.explanation=\u8981\u6c42\u3055\u308c\u305f\u30d9\u30a2\u30e9\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u30ea\u30bd\u30fc\u30b9\u30fb\u30b5\u30fc\u30d0\u30fc\u306b\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
authentication_problem=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a8d\u8a3c\u3092\u8ffd\u52a0\u3057\u3066\u3044\u307e\u3059 : {0}
authentication_problem.explanation=\u8a8d\u8a3c\u30d8\u30c3\u30c0\u30fc\u3092\u8981\u6c42\u306b\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
unknown_problem=\u4e0d\u660e\u306a\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
unknown_problem.explanation=\u554f\u984c\u306e\u8abf\u67fb\u3092\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u4f9d\u983c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
code_grant_problem=\u8a31\u53ef\u30b3\u30fc\u30c9\u304b\u3089\u30a2\u30af\u30bb\u30b9\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u3059 : {0}
code_grant_problem.explanation=\u8a31\u53ef\u30b3\u30fc\u30c9\u30fb\u30d5\u30ed\u30fc\u3067\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
