# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= Der er opst\u00e5et en fejl i {0}:
authorization_code_problem=Autorisationskoden udveksles med adgangstokenet: {0}
authorization_code_problem.explanation=Der er opst\u00e5et en fejl under udveksling af autorisationskoden med adgangstokenet.
authorize_problem=Autorisationsprocessen for {0} initieres.
authorize_problem.explanation=Der er opst\u00e5et en fejl under initiering af autorisationsprocessen.
callback_problem=Omdirigeringssvaret behandles: {0}
callback_problem.explanation=Der er opst\u00e5et en fejl under behandling af omdirigeringssvaret fra serviceudbyderen.
client_credentials_problem=Adgangstokenet hentes for klienten med f\u00f8lgende klientlegitimationsoplysninger: {0}
client_credentials_problem.explanation=Der er opst\u00e5et en fejl under hentning af adgangstoken i client_credentials-str\u00f8mmen.
fetch_init_problem=OAuth2Request initialiseres: {0}
fetch_init_problem.explanation=Der er opst\u00e5et en fejl p\u00e5 lavt niveau under initialisering af OAuth2Request-hentningen.
fetch_problem=udf\u00f8relse af OAuth2Request.fetch(): {0}
fetch_problem.explanation=Der er opst\u00e5et en fejl under afsendelse af anmodningen om OAuth2Request-hentning.
gadget_spec_problem=F\u00f8lgende gadgetspecifikation behandles: {0}
gadget_spec_problem.explanation=Der er ikke fundet en gadgetspecifikation. Bed administratoren om at konfigurere din gadget til at fungere med OAuth2.0.
get_oauth2_accessor_problem=hentning af en OAuth2Accessor til OAuth2Request: {0}
get_oauth2_accessor_problem.explanation=Der er opst\u00e5et en fejl. Bed administratoren om at oprette en OAuth2.0-klientbinding for denne gadget og service.
lookup_spec_problem=Gadgetspecifikationen hentes: {0}
lookup_spec_problem.explanation=Der er ikke fundet en gadgetspecifikation. Bed administratoren om at konfigurere din gadget til at fungere med OAuth2.0.
missing_fetch_params=F\u00f8lgende p\u00e5kr\u00e6vede fetch-parametre mangler: {0}
missing_fetch_params.explanation=Metoden fetch() er kaldt med forkerte parametre.
missing_server_response=Der er opst\u00e5et en fejl under svar fra OAuth2.0-serviceudbyder: {0}
missing_server_response.explanation=Serveren har oprettet en gyldig OAuth2Request, men kan enten ikke afsende anmodningen eller ikke f\u00e5 et gyldigt svar fra serviceudbyderen.
no_response_handler=En svarbehandler har ikke behandlet f\u00f8lgende svar: {0}
no_response_handler.explanation=Der findes ikke en svarbehandler til behandling af autorisations- og tokenslutpunkter. AuthorizationEndpointResponseHandler eller TokenEndpointResponseHandler.
no_gadget_spec=Gadgetspecifikationen for {0} findes ikke.
no_gadget_spec.explanation=Der er ikke fundet en gadgetspecifikation. Bed administratoren om at konfigurere din gadget til at fungere med OAuth2.0.
refresh_token_problem=Opfriskningstokenet udveksles med adgangstokenet: {0}
refresh_token_problem.explanation=Der er opst\u00e5et en fejl under udveksling af opfriskningstokenet med adgangstokenet.
secret_encryption_problem=Tokenhemmeligheden krypteres med henblik p\u00e5 persistens: {0}
secret_encryption_problem.explanation=Der er opst\u00e5et en fejl under lagring af OAuth2.0-hemmeligheder med det leverede krypteringsmodul.
access_denied=Adgang er n\u00e6gtet.
access_denied.explanation=Brugeren har n\u00e6gtet eller annulleret autorisationen med serviceudbyderen.
invalid_client=Klienten er ugyldig: {0}
invalid_client.explanation= Klienten kan ikke valideres. Det skyldes sandsynligvis, at klienten er ukendt, at klientvalidering ikke er inkluderet, eller at valideringsmetoden ikke underst\u00f8ttes.
invalid_grant=Autorisationstildelingen er ugyldig: {0}
invalid_grant.explanation=Autorisationstildelingen er ugyldig, udl\u00f8bet eller tilbagekaldt, eller ogs\u00e5 svarer den ikke til den omdirigerings-URI, der bruges i autorisationsanmodningen, eller den er afsendt til en anden klient. Autorisationstildelingen kan indeholde autorisationskoden, ressourceejerens legitimationsoplysninger eller klientens legitimationsoplysninger.
invalid_request=Anmodningen er ugyldig: {0}
invalid_request.explanation=Anmodningen er ugyldig, fordi den mangler en p\u00e5kr\u00e6vet parameter, indeholder en parameter, der ikke underst\u00f8ttes, gentager en parameter, indeholder flere legitimationsoplysninger, bruger mere end \u00e9n mekanisme til validering af klienten eller p\u00e5 anden vis er formateret forkert.
invalid_scope=Omfanget er ugyldigt: {0}
invalid_scope.explanation=Det \u00f8nskede omfang er ugyldigt, ukendt, forkert formateret eller overskrider det omfang, som er tildelt af ressourcejeren.
server_error=Der er opst\u00e5et en serverfejl: {0}
server_error.explanation=Der er opst\u00e5et en uventet betingelse i autorisationsserveren, som har forhindret, at anmodningen kan fuldf\u00f8res.
server_rejected_request=Serveren har afvist anmodningen: statuscode = {0}
server_rejected_request.explanation=Serveren har oprettet en OAuth2Request, men serviceudbyderen har afvist den.
temporarily_unavailable=Servicen er midlertidigt utilg\u00e6ngelig: {0}
temporarily_unavailable.explanation=Autorisationsserveren kan ikke h\u00e5ndtere anmodningen, fordi den er midlertidigt overbelastet eller er i vedligeholdelsestilstand.
token_response_problem=Svaret for tokenslutpunktet behandles: {0}
token_response_problem.explanation=Tokenslutpunktet har sendt et svar, som serveren ikke kan behandle.
unauthorized_client=Klienten er ikke autoriseret: {0}
unauthorized_client.explanation=Klienten er ikke autoriseret til at anmode om et adgangstoken vha. denne metode.
unsupported_grant_type=Tildelingstypen underst\u00f8ttes ikke: {0}
unsupported_grant_type.explanation=Autorisationsserveren underst\u00f8tter ikke hentning af et adgangstoken vha. denne metode.
unsupported_response_type=Svartypen underst\u00f8ttes ikke: {0}
unsupported_response_type.explanation=Autorisationsserveren underst\u00f8tter ikke hentning af en autorisationskode vha. denne metode.
mac_token_problem=Der anmodes om mac-tokenet: {0}
mac_token_problem.explanation=Mac-tokenet i anmodningen kan ikke tilf\u00f8jes til ressourceserveren.
bearer_token_problem=Der anmodes om bearer-tokenet: {0}
bearer_token_problem.explanation=Bearer-tokenet i anmodningen kan ikke tilf\u00f8jes til ressourceserveren.
authentication_problem=Klientvalideringen tilf\u00f8jes: {0}
authentication_problem.explanation=Valideringsoverskrifter kan ikke tilf\u00f8jes til anmodningen.
unknown_problem=Der er opst\u00e5et en ukendt fejl: {0}
unknown_problem.explanation=Bed systemadministratoren om at unders\u00f8ge problemet.
code_grant_problem=Det kodeord, der hentes fra autorisationskoden: {0}
code_grant_problem.explanation=Der er opst\u00e5et en fejl under autorisationskodestr\u00f8mmen.
