# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= Element {0} napotka\u0142 b\u0142\u0105d:
authorization_code_problem=Kod autoryzacji jest wymieniany na znacznik dost\u0119pu: {0}
authorization_code_problem.explanation=Wyst\u0105pi\u0142 b\u0142\u0105d podczas wymiany kodu autoryzacji na znacznik dost\u0119pu.
authorize_problem=Inicjowanie procesu autoryzacji dla elementu {0}.
authorize_problem.explanation=Wyst\u0105pi\u0142 b\u0142\u0105d podczas inicjowania procesu autoryzacji.
callback_problem=Przetwarzanie odpowiedzi przekierowania: {0}
callback_problem.explanation=Wyst\u0105pi\u0142 b\u0142\u0105d podczas przetwarzania odpowiedzi przekierowania od dostawcy us\u0142ug.
client_credentials_problem=Pobieranie znacznika dost\u0119pu dla klienta o nast\u0119puj\u0105cych referencjach: {0}
client_credentials_problem.explanation=Wyst\u0105pi\u0142 b\u0142\u0105d podczas pobierania znacznika dost\u0119pu w przep\u0142ywie client_credentials.
fetch_init_problem=Inicjowanie \u017c\u0105dania OAuth2Request: {0}
fetch_init_problem.explanation=Wyst\u0105pi\u0142 niskopoziomowy b\u0142\u0105d podczas inicjowania pobierania \u017c\u0105dania OAuth2Request.
fetch_problem=Wykonywanie metody OAuth2Request.fetch(): {0}
fetch_problem.explanation=Wyst\u0105pi\u0142 b\u0142\u0105d podczas wywo\u0142ywania pobierania \u017c\u0105dania OAuth2Request.
gadget_spec_problem=Przetwarzanie nast\u0119puj\u0105cej specyfikacji gad\u017cetu: {0}
gadget_spec_problem.explanation=Nie znaleziono specyfikacji gad\u017cetu. Popro\u015b administratora o skonfigurowanie gad\u017cetu do pracy z protoko\u0142em OAuth2.0.
get_oauth2_accessor_problem=Pobieranie obiektu korzystaj\u0105cego OAuth2Accessor dla \u017c\u0105dania OAuth2Request: {0}
get_oauth2_accessor_problem.explanation=Wyst\u0105pi\u0142 b\u0142\u0105d. Popro\u015b administratora o utworzenie powi\u0105zania klienta OAuth2.0 dla tego gad\u017cetu i us\u0142ugi.
lookup_spec_problem=Pobieranie specyfikacji gad\u017cetu: {0}
lookup_spec_problem.explanation=Nie znaleziono specyfikacji gad\u017cetu. Popro\u015b administratora o skonfigurowanie gad\u017cetu do pracy z protoko\u0142em OAuth2.0.
missing_fetch_params=Brak nast\u0119puj\u0105cych wymaganych parametr\u00f3w pobierania: {0}.
missing_fetch_params.explanation=Metoda fetch() zosta\u0142a wywo\u0142ana z niepoprawnymi parametrami.
missing_server_response=Wyst\u0105pi\u0142 b\u0142\u0105d podczas uzyskiwania odpowiedzi dostawcy us\u0142ug OAuth2.0: {0}
missing_server_response.explanation=Serwer utworzy\u0142 poprawne \u017c\u0105danie OAuth2Request, ale nie m\u00f3g\u0142 wys\u0142a\u0107 \u017c\u0105dania lub pobra\u0107 poprawnej odpowiedzi od dostawcy us\u0142ug.
no_response_handler=Procedura obs\u0142ugi odpowiedzi nie przetworzy\u0142a nast\u0119puj\u0105cej odpowiedzi: {0}
no_response_handler.explanation=Nie istnieje procedura obs\u0142ugi odpowiedzi na potrzeby przetwarzania punkt\u00f3w ko\u0144cowych znacznika i autoryzacji. Wymagana jest procedura AuthorizationEndpointResponseHandler lub TokenEndpointResponseHandler.
no_gadget_spec=Nie znaleziono specyfikacji gad\u017cetu {0}.
no_gadget_spec.explanation=Nie znaleziono specyfikacji gad\u017cetu. Popro\u015b administratora o skonfigurowanie gad\u017cetu do pracy z protoko\u0142em OAuth2.0.
refresh_token_problem=Wymiana znacznika od\u015bwie\u017cania na znacznik dost\u0119pu: {0}
refresh_token_problem.explanation=Wyst\u0105pi\u0142 b\u0142\u0105d podczas wymiany znacznika od\u015bwie\u017cania na znacznik dost\u0119pu.
secret_encryption_problem=Szyfrowanie klucza tajnego znacznika na potrzeby utrwalania: {0}
secret_encryption_problem.explanation=Wyst\u0105pi\u0142 b\u0142\u0105d podczas zapisywania kluczy tajnych OAuth2.0 przy u\u017cyciu podanego modu\u0142u szyfrowania.
access_denied=Odmowa dost\u0119pu.
access_denied.explanation=Odmowa autoryzacji u\u017cytkownika w dostawcy us\u0142ug lub autoryzacja zosta\u0142a anulowana.
invalid_client=Klient jest niepoprawny: {0}
invalid_client.explanation= Klient nie mo\u017ce zosta\u0107 uwierzytelniony, prawdopodobnie poniewa\u017c klient nie jest znany, uwierzytelnianie klienta nie zosta\u0142o w\u0142\u0105czone lub metoda uwierzytelniania nie jest obs\u0142ugiwana.
invalid_grant=Nadanie autoryzacji jest niepoprawne: {0}
invalid_grant.explanation=Nadanie autoryzacji jest niepoprawne, utraci\u0142o wa\u017cno\u015b\u0107, zosta\u0142o odwo\u0142ane, nie jest zgodne z identyfikatorem URI przekierowania u\u017cywanym w \u017c\u0105daniu autoryzacji lub zosta\u0142o wydane dla innego klienta. Nadanie autoryzacji mo\u017ce zawiera\u0107 kod autoryzacji, referencje w\u0142a\u015bciciela zasobu lub referencje klienta.
invalid_request=\u017b\u0105danie jest niepoprawne: {0}
invalid_request.explanation=\u017b\u0105danie jest niepoprawne, poniewa\u017c brakuje w nim wymaganego parametru, zawiera nieobs\u0142ugiwan\u0105 warto\u015b\u0107 parametru, zawiera duplikat parametru, obejmuje wiele referencji, wykorzystuje wi\u0119cej ni\u017c jeden mechanizm uwierzytelniania klienta lub jest w inny spos\u00f3b zniekszta\u0142cone.
invalid_scope=Zasi\u0119g jest niepoprawny: {0}
invalid_scope.explanation=\u017b\u0105dany zasi\u0119g jest niepoprawny, nieznany lub zniekszta\u0142cony albo przekracza zasi\u0119g nadany przez w\u0142a\u015bciciela zasobu.
server_error=Wyst\u0105pi\u0142 b\u0142\u0105d serwera: {0}
server_error.explanation=Serwer autoryzacji napotka\u0142 nieoczekiwany warunek, co uniemo\u017cliwi\u0142o spe\u0142nienie \u017c\u0105dania.
server_rejected_request=Serwer odrzuci\u0142 \u017c\u0105danie. Kod statusu: {0}
server_rejected_request.explanation=Serwer utworzy\u0142 \u017c\u0105danie OAuth2Request, ale zosta\u0142o ono odrzucone przez dostawc\u0119 us\u0142ug.
temporarily_unavailable=Us\u0142uga jest tymczasowo niedost\u0119pna: {0}
temporarily_unavailable.explanation=Serwer autoryzacji nie mo\u017ce obs\u0142u\u017cy\u0107 \u017c\u0105dania, poniewa\u017c jest on tymczasowo przeci\u0105\u017cony lub znajduje si\u0119 w trybie konserwacji.
token_response_problem=Przetwarzanie odpowiedzi punktu ko\u0144cowego znacznika: {0}
token_response_problem.explanation=Punkt ko\u0144cowy znacznika wys\u0142a\u0142 odpowied\u017a, kt\u00f3ra nie mog\u0142a zosta\u0107 przetworzona przez serwer.
unauthorized_client=Klient nie ma uprawnie\u0144: {0}
unauthorized_client.explanation=Klient nie ma uprawnie\u0144 do \u017c\u0105dania znacznika dost\u0119pu przy u\u017cyciu tej metody.
unsupported_grant_type=Typ nadania nie jest obs\u0142ugiwany: {0}
unsupported_grant_type.explanation=Serwer autoryzacji nie obs\u0142uguje uzyskiwania znacznika dost\u0119pu za pomoc\u0105 tej metody.
unsupported_response_type=Typ odpowiedzi nie jest obs\u0142ugiwany: {0}
unsupported_response_type.explanation=Serwer autoryzacji nie obs\u0142uguje uzyskiwania kodu autoryzacji za pomoc\u0105 tej metody.
mac_token_problem=Za\u017c\u0105dano znacznika kodu MAC (Message Authentication Code): {0}
mac_token_problem.explanation=Znacznika kodu MAC w \u017c\u0105daniu nie mo\u017cna doda\u0107 do serwera zasob\u00f3w.
bearer_token_problem=Za\u017c\u0105dano znacznika multimedi\u00f3w: {0}
bearer_token_problem.explanation=Znacznika multimedi\u00f3w w \u017c\u0105daniu nie mo\u017cna doda\u0107 do serwera zasob\u00f3w.
authentication_problem=Dodawanie uwierzytelniania klienta: {0}
authentication_problem.explanation=Do \u017c\u0105dania nie mo\u017cna doda\u0107 nag\u0142\u00f3wk\u00f3w uwierzytelniania.
unknown_problem=Wyst\u0105pi\u0142 nieznany b\u0142\u0105d: {0}
unknown_problem.explanation=Popro\u015b administratora systemu o przeanalizowanie problemu.
code_grant_problem=Znacznik dost\u0119pu uzyskiwany z kodu autoryzacji: {0}
code_grant_problem.explanation=Wyst\u0105pi\u0142 b\u0142\u0105d podczas przep\u0142ywu kodu autoryzacji.
