# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR


##AuthenticationServletFilter
errorParsingSecureToken=Le jeton de s\u00e9curit\u00e9 ou les donn\u00e9e d'identification sont syntaxiquement incorrects et ne peuvent \u00eatre analys\u00e9s.

##XmlUtil
errorParsingXML=Erreur d'analyse syntaxique du code XML. Cette erreur peut \u00eatre ignor\u00e9e.
errorParsingExternalGeneralEntities=Le processeur XML en cours d'utilisation va charger les entit\u00e9s g\u00e9n\u00e9rales externes.
errorParsingExternalParameterEntities=Le processeur XML en cours d'utilisation va charger les entit\u00e9s de param\u00e8tre externes.
errorParsingExternalDTD=Le processeur XML en cours d'utilisation va charger les d\u00e9finitions DTD (Document Type Definitions).
errorNotUsingSecureXML=Le processeur XML utilis\u00e9 ne prend pas en charge l'analyse s\u00e9curis\u00e9.
reuseDocumentBuilders=Des g\u00e9n\u00e9rateurs de documents sont r\u00e9utilis\u00e9s.
notReuseDocBuilders=Des g\u00e9n\u00e9rateurs de documents ne sont pas r\u00e9utilis\u00e9s.

##LruCacheProvider
LRUCapacity=La capacit\u00e9 {0} la moins r\u00e9cemment utilis\u00e9e (LRU) est configur\u00e9e pour {1}.

##DynamicConfigProperty
evalExpressionFailed={0} ne peut pas \u00eatre \u00e9valu\u00e9e.

##JsonContainerConfigLoader
readingContainerConfig=La configuration du conteneur {0} est en cours de lecture.
loadFromString={0} ne peut pas \u00eatre analys\u00e9.

##JsonContainerConfigLoader, FeatureRegistry
loadResourcesFrom=Les ressources \u00e0 partir de {0} sont en cours de chargement.

##JsonContainerConfigLoader, FeatureRegistry
loadFilesFrom=Les fichiers \u00e0 partir de {0} sont en cours de chargement.

##ApiServlet
apiServletProtocolException=Une erreur de r\u00e9ponse est renvoy\u00e9e car une exception de protocole s'est produite.
apiServletException=Une erreur de r\u00e9ponse est renvoy\u00e9e car une exception de protocole s'est produite.

##FeatureRegistry
overridingFeature=La fonction {0} avec une d\u00e9finition de {1} est remplac\u00e9e.

##FeatureResourceLoader
missingFile=Le fichier {0} existait mais il est manquant \u00e0 pr\u00e9sent.
unableRetrieveLib=Impossible d''extraire la biblioth\u00e8que distante de {0}.

##BasicHttpFetcher
timeoutException={0} a expir\u00e9 en raison de l''exception suivante : {1}-{2}-{3} ms.
exceptionOccurred=L''exception suivante s''est produite lors de l''extraction de {0} : {1} ms se sont \u00e9coul\u00e9es.
slowResponse={0} r\u00e9pond lentement. {1} ms se sont \u00e9coul\u00e9es.

##HttpResponseMetadataHelper
errorGettingMD5=Une erreur s'est produite lors de l'obtention de MD5 (Message Digest 5). Cette erreur a \u00e9t\u00e9 ignor\u00e9e.
errorParsingMD5=Une erreur s'est produite lors de l'analyse de la cha\u00eene du MD5 (Message Digest 5) au format UTF-8.

##OAuthModule
usingRandomKey=Une cl\u00e9 al\u00e9atoire pour le chiffrement d'\u00e9tat c\u00f4t\u00e9 client d'OAuth est utilis\u00e9e.
usingFile=Le fichier {0} pour le chiffrement d''\u00e9tat c\u00f4t\u00e9 client d''OAuth est utilis\u00e9.
loadKeyFileFrom=La cl\u00e9 de signature OAuth de {0} est en cours de chargement.
couldNotLoadKeyFile= Le fichier de cl\u00e9s {0} n''a pas pu \u00eatre charg\u00e9.
couldNotLoadSignedKey=La cl\u00e9 de signature OAuth ne s''est pas charg\u00e9e correctement. Pour cr\u00e9er une cl\u00e9: \n \ 1. Ex\u00e9cutez la commande suivante : \n openssl req -newkey rsa:1024 -days 365 -nodes -x509 -keyout testkey.pem \\\n -out testkey.pem -subj ''/CN=mytestkey''\n openssl pkcs8 -in testkey.pem -out oauthkey.pem -topk8 -nocrypt -outform PEM\n\n. 2. Editez le fichier shindig.properties en ajoutant les lignes suivantes : \n {0} =<path-to-oauthkey.pem>\n \ {1} = \n " mykey ".
failedToInit=Les consommateurs OAuth de {0} n''ont pas pu s''initialiser.

##OAuthRequest
oauthFetchFatalError=L''erreur fatale suivante s''est produite lors de l''extraction de contenu par OAuth : \n \ {0}.
oauthFetchErrorReprompt=L''erreur suivante s''est produite lors de l''extraction de contenu par OAuth : \n \ {0}. L''utilisateur est invit\u00e9 de nouveau \u00e0 donner son approbation.
bogusExpired=Le serveur a renvoy\u00e9 une expiration non valide :\n {0}.
oauthFetchUnexpectedError=L''erreur fatale suivante s''est produite lors de l''extraction de contenu par OAuth : \n \ {0}.
unauthenticatedOauth=OAuth ne parvient pas \u00e0 extraire le contenu car l''authentification de l''utilisateur n''existe pas. L''erreur suivante s''est produite : \n {0}.
invalidOauth=OAuth ne parvient pas \u00e0 extraire le contenu car la demande n''est pas valide. L''erreur suivante s''est produite : \n {0}.

##CajaCssSanitizer
failedToParse=La feuille de style ne peut pas \u00eatre analys\u00e9e.
unableToConvertScript=Le noeud du script ne peut pas \u00eatre converti en balise OSML (OpenSocial Markup Language).

##PipelineExecutor
errorPreloading=Une erreur impr\u00e9vue s'est produite lors du pr\u00e9chargement.

##Processor
renderBlacklistedGadget=Le syst\u00e8me a tent\u00e9 d''afficher le gadget sur liste noire suivant : {0}.

##CajaResponseRewriter, CajaContentRewriter
failedToRetrieve=Impossible d''extraire {0}.
failedToRead=Impossible de lire {0}.

##DefaultServiceFetcher
httpErrorFetching=Une erreur HTTP {0} s''est produite lors de l''extraction des m\u00e9thodes de service du noeud final {1}.
failedToFetchService=Les m\u00e9thodes des services du noeud final {0} n''ont pas pu \u00eatre extraites. L''erreur suivante s''est produite : {1}.
failedToParseService=Les m\u00e9thodes des services du noeud final {0} n''ont pas pu \u00eatre analys\u00e9es. L''erreur suivante s''est produite : {1}.

##Renderer
FailedToRender=Le gadget sur {0} ne s''est pas affich\u00e9. L''erreur suivante s''est produite : {1}.

##RenderingGadgetRewriter
unknownFeatures=Une ou plusieurs fonctions inconnues existent dans le &libs=: {0} externe suivant.
unexpectedErrorPreloading=Une erreur impr\u00e9vue s'est produite lors du pr\u00e9chargement du gadget.

##SanitizingResponseRewriter
requestToSanitizeWithoutContent=Une demande d''assainissement a \u00e9t\u00e9 \u00e9mise sans type de contenu pour {0}.
requestToSanitizeUnknownContent=Une demande d''assainissement a \u00e9t\u00e9 \u00e9mise sans type de contenu connu {0} pour {1}.
unableToSanitizeUnknownImg=Le type d''image {0} est inconnu et ne peut pas \u00eatre s\u00e9curis\u00e9.
unableToDetectImgType=Le type d''image pour {0} ne peut pas \u00eatre d\u00e9tect\u00e9 lors de l''assainissement du contenu.

##BasicImageRewriter
ioErrorRewritingImg=L''erreur d''entr\u00e9e-sortie suivante s''est produite lors de la r\u00e9\u00e9criture de l''image {0} : {1}.
unknownErrorRewritingImg=L''erreur suivante s''est produite lors de la r\u00e9\u00e9criture de l''image {0} : {1}.
failedToReadImg=L''image {0} ne peut pas \u00eatre lue et est ignor\u00e9e. L''erreur suivante s''est produite : {1}.

##CssResponseRewriter
cajaCssParseFailure=L''erreur suivante s''est produite lors de l''analyse syntaxique de Caja CSS : {0} pour {1}.

##ImageAttributeRewriter
unableToProcessImg=La ressource image {0} ne peut pas \u00eatre trait\u00e9e.
unableToReadResponse=La r\u00e9ponse pour la ressource image {0} ne peut pas \u00eatre lue.
unableToFetchImg=La ressource image {0} ne peut pas \u00eatre extraite.
unableToParseImg=La ressource image {0} ne peut pas \u00eatre analys\u00e9e.

##MutableContent
exceptionParsingContent=Une erreur s'est produite lors de l'analyse de contenu du gadget.

##PipelineDataGadgetRewriter
failedToParsePreload=Le gadget sur {0} n''a pas pu \u00eatre analys\u00e9 pour le pr\u00e9chargement.

##ProxyingVisitor
uriExceptionParsing=Une exception URI (Uniform Resource Identifier) s''est produite lors de l''analyse syntaxique du gadget \u00e0 {0}.

##TemplateRewriter
malformedTemplateLib=Des exceptions se sont produites en raison des biblioth\u00e8ques de mod\u00e8les syntaxiquement incorrectes.

##CajaContnetRewriter
cajoledCacheCreated=Un cache Caja a \u00e9t\u00e9 cr\u00e9\u00e9.
retrieveReference={0} est en cours d''extraction.
unableToCajole=Le gadget sur {0} ne peut pas \u00eatre de type Caja.

##ConcatProxyServlet
concatProxyRequestFailed=L''erreur suivante s''est produite lors de la demande d''un proxy concat\u00e9n\u00e9 : {0}.

##GadgetRenderingServlet
malformedTtlValue=Une valeur de dur\u00e9e de vie (Time To Live - TTL) {0} a \u00e9t\u00e9 ignor\u00e9e.

##HttpRequestHandler
gadgetCreationError=Une erreur s'est produite lors de la cr\u00e9ation du gadget pour la r\u00e9\u00e9criture.  R\u00e9\u00e9criture de la r\u00e9ponse sans le gadget.

##ProxyServlet
embededImgWrongDomain=La demande d''imbriquer l''URL {0} a \u00e9t\u00e9 effectu\u00e9e sur le domaine incorrect {1}.

##DefaultTemplateProcessor
elFailure=L''erreur EL suivante s''est produite pour le gadget \u00e0 {0} : {1}.

##UriUtils
skipIllegalHeader=L''en-t\u00eate {0} est ill\u00e9gal et est ignor\u00e9. L''erreur suivante s''est produite : {1}.

##AbstractSpecFactory
updateSpecFailureUseCacheVersion=Une erreur s''est produite lors de la mise \u00e0 jour de {0}. Le code d''\u00e9tat {1} a \u00e9t\u00e9 renvoy\u00e9. Exception : {2}. Une version mise en cache est utilis\u00e9e \u00e0 la place.
updateSpecFailureApplyNegCache=Une erreur s''est produite lors de la mise \u00e0 jour de {0}. Le code d''\u00e9tat {1} a \u00e9t\u00e9 renvoy\u00e9. Exception : {2}. Un cache n\u00e9gatif est appliqu\u00e9.

##HashLockedDomainService
noLockedDomainConfig=Une configuration de domaine verrouill\u00e9e pour {0} n''existe pas.

##Bootstrap
startingConnManagerWith=Le gestionnaire de connexions avec {0} propri\u00e9t\u00e9s est lanc\u00e9.

##XSDValidator
resolveResource=Les ressources suivantes sont en cours de r\u00e9solution : {0}, {1}, {2}, {3}.
failedToValidate=Une erreur s''est produite lors de la validation de {0}.

##DefaultRequestPipeline
cachedResponse=Renvoi de la r\u00e9ponse mise en cache pour la demande sur {0}.
staleResponse=Une erreur s''est produite lors de la demande de la ressource sur {0} mais une r\u00e9ponse ant\u00e9rieure est disponible en m\u00e9moire cache. Renvoi d''une r\u00e9ponse pouvant \u00eatre p\u00e9rim\u00e9e \u00e0 partir de la m\u00e9moire cache.
