# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR


##AuthenticationServletFilter
errorParsingSecureToken=A credencial ou o s\u00edmbolo de seguran\u00e7a est\u00e1 incorrecto e n\u00e3o pode ser analisado.

##XmlUtil
errorParsingXML=Erro ao analisar o XML. Este pode ser ignorado.
errorParsingExternalGeneralEntities=O processador de XML a ser utilizado ir\u00e1 carregar entidades gerais externas.
errorParsingExternalParameterEntities=O processador de XML a ser utilizado ir\u00e1 carregar entidades de par\u00e2metros externas.
errorParsingExternalDTD=O processador de XML a ser utilizado ir\u00e1 carregar as DTDs (Document Type Definitions).
errorNotUsingSecureXML=O processador de XML a ser utilizado n\u00e3o suporta uma an\u00e1lise segura.
reuseDocumentBuilders=Os criadores de documentos est\u00e3o a ser reutilizados.
notReuseDocBuilders=Os criadores de documentos n\u00e3o est\u00e3o a ser reutilizados.

##LruCacheProvider
LRUCapacity=A capacidade do LRU (Least Recently Used) {0} est\u00e1 configurada para {1}.

##DynamicConfigProperty
evalExpressionFailed=N\u00e3o \u00e9 poss\u00edvel avaliar {0}.

##JsonContainerConfigLoader
readingContainerConfig=A configura\u00e7\u00e3o do contentor {0} est\u00e1 a ser lida.
loadFromString=N\u00e3o \u00e9 poss\u00edvel analisar {0}.

##JsonContainerConfigLoader, FeatureRegistry
loadResourcesFrom=Os recursos de {0} est\u00e3o a ser carregados.

##JsonContainerConfigLoader, FeatureRegistry
loadFilesFrom=Os ficheiros de {0} est\u00e3o a ser carregados.

##ApiServlet
apiServletProtocolException=Est\u00e1 a ser devolvido um erro de resposta, uma vez que ocorreu uma excep\u00e7\u00e3o de protocolo.
apiServletException=Est\u00e1 a ser devolvido um erro de resposta, uma vez que ocorreu uma excep\u00e7\u00e3o de protocolo.

##FeatureRegistry
overridingFeature=A fun\u00e7\u00e3o {0} com defini\u00e7\u00e3o {1} est\u00e1 a ser substitu\u00edda.

##FeatureResourceLoader
missingFile=O ficheiro {0} existia, mas agora est\u00e1 em falta.
unableRetrieveLib=N\u00e3o \u00e9 poss\u00edvel obter a biblioteca remota de {0}.

##BasicHttpFetcher
timeoutException=O tempo limite de {0} foi excedido, devido \u00e0 seguinte excep\u00e7\u00e3o: {1} - {2} - {3} ms.
exceptionOccurred=Ocorreu a seguinte excep\u00e7\u00e3o ao obter {0}: decorreram {1} ms.
slowResponse={0} est\u00e1 a responder lentamente. Decorreram {1} ms.

##HttpResponseMetadataHelper
errorGettingMD5=Ocorreu um erro ao obter a MD5 (Message Digest 5). O erro foi ignorado.
errorParsingMD5=Ocorreu um erro ao analisar a cadeia da MD5 (Message Digest 5) no formato UTF-8.

##OAuthModule
usingRandomKey=A chave aleat\u00f3ria para a encripta\u00e7\u00e3o de estado do lado do cliente de OAuth est\u00e1 a ser utilizada.
usingFile=O ficheiro {0} para a encripta\u00e7\u00e3o de estado do lado do cliente de OAuth est\u00e1 a ser utilizada.
loadKeyFileFrom=A chave de assinatura de OAuth de {0} est\u00e1 a ser carregada.
couldNotLoadKeyFile= N\u00e3o foi poss\u00edvel carregar o ficheiro de chave {0}.
couldNotLoadSignedKey=A chave de assinatura de OAuth n\u00e3o foi correctamente carregada. Para criar uma chave: \n 1. Execute o seguinte comando: \n openssl req -newkey rsa:1024 -days 365 -nodes -x509 -keyout testkey.pem \\\n -out testkey.pem -subj ''/CN=mytestkey''\n openssl pkcs8 -in testkey.pem -out oauthkey.pem -topk8 -nocrypt -outform PEM\n\n. 2. Edite o ficheiro shindig.properties adicionando estas linhas: \n{0} =<path-to-oauthkey.pem>\n {1} =mykey\n.
failedToInit=Falha ao inicializar os consumidores de OAuth de {0}.

##OAuthRequest
oauthFetchFatalError=Ocorreu o seguinte erro fatal quando o OAuth estava a obter conte\u00fado: \n {0}.
oauthFetchErrorReprompt=Ocorreu o seguinte erro quando o OAuth estava a obter conte\u00fado: \n {0}. A aprova\u00e7\u00e3o est\u00e1 a ser novamente solicitada ao utilizador.
bogusExpired=O servidor devolveu um limite de validade n\u00e3o v\u00e1lido:\n {0}.
oauthFetchUnexpectedError=Ocorreu o seguinte erro fatal quando o OAuth estava a obter conte\u00fado: \n {0}.
unauthenticatedOauth=N\u00e3o \u00e9 poss\u00edvel ao OAuth obter conte\u00fado, uma vez que a autentica\u00e7\u00e3o do utilizador n\u00e3o existe. Ocorreu o seguinte erro: \n {0}.
invalidOauth=N\u00e3o \u00e9 poss\u00edvel ao OAuth obter conte\u00fado, uma vez que o pedido n\u00e3o \u00e9 v\u00e1lido. Ocorreu o seguinte erro: \n {0}.

##CajaCssSanitizer
failedToParse=N\u00e3o \u00e9 poss\u00edvel analisar a folha de estilos.
unableToConvertScript=O n\u00f3 do script n\u00e3o pode ser convertido num controlo de OSML (OpenSocial Markup Language).

##PipelineExecutor
errorPreloading=Ocorreu um erro inesperado ao pr\u00e9-carregar.

##Processor
renderBlacklistedGadget=O sistema tentou apresentar o seguinte gadget da lista negra: {0}.

##CajaResponseRewriter, CajaContentRewriter
failedToRetrieve=N\u00e3o \u00e9 poss\u00edvel obter {0}.
failedToRead=N\u00e3o \u00e9 poss\u00edvel ler {0}.

##DefaultServiceFetcher
httpErrorFetching=Ocorreu um erro de HTTP {0} ao obter os m\u00e9todos de servi\u00e7o a partir do ponto final {1}.
failedToFetchService=N\u00e3o foi poss\u00edvel obter os m\u00e9todos de servi\u00e7os a partir do ponto final {0}. Ocorreu o seguinte erro: {1}.
failedToParseService=N\u00e3o foi poss\u00edvel analisar os m\u00e9todos de servi\u00e7os a partir do ponto final {0}. Ocorreu o seguinte erro: {1}.

##Renderer
FailedToRender=O gadget em {0} n\u00e3o foi apresentado. Ocorreu o seguinte erro: {1}.

##RenderingGadgetRewriter
unknownFeatures=Existe uma ou mais fun\u00e7\u00f5es desconhecidas no seguinte externo &libs=: {0}.
unexpectedErrorPreloading=Ocorreu um erro inesperado ao pr\u00e9-carregar o gadget.

##SanitizingResponseRewriter
requestToSanitizeWithoutContent=Foi emitido um pedido para depurar sem um tipo de conte\u00fado para {0}.
requestToSanitizeUnknownContent=Foi emitido um pedido para depurar sem um tipo de conte\u00fado conhecido {0} para {1}.
unableToSanitizeUnknownImg=O tipo de imagem {0} \u00e9 desconhecido e n\u00e3o pode ser depurado.
unableToDetectImgType=N\u00e3o \u00e9 poss\u00edvel detectar o tipo de imagem para {0} ao depurar conte\u00fado.

##BasicImageRewriter
ioErrorRewritingImg=Ocorreu o seguinte erro de entrada/sa\u00edda ao gravar novamente a imagem {0}: {1}.
unknownErrorRewritingImg=Ocorreu o seguinte erro ao gravar novamente a imagem {0}: {1}.
failedToReadImg=A imagem {0} n\u00e3o pode ser lida e vai ser ignorada. Ocorreu o seguinte erro: {1}.

##CssResponseRewriter
cajaCssParseFailure=Ocorre o seguinte erro ao analisar a CSS de Caja: {0} para {1}.

##ImageAttributeRewriter
unableToProcessImg=N\u00e3o \u00e9 poss\u00edvel processar o recurso de imagem {0}.
unableToReadResponse=N\u00e3o \u00e9 poss\u00edvel ler a resposta para o recurso de imagem {0}.
unableToFetchImg=N\u00e3o \u00e9 poss\u00edvel obter o recurso de imagem {0}.
unableToParseImg=N\u00e3o \u00e9 poss\u00edvel analisar o recurso de imagem {0}.

##MutableContent
exceptionParsingContent=Ocorreu uma excep\u00e7\u00e3o ao analisar o conte\u00fado do gadget.

##PipelineDataGadgetRewriter
failedToParsePreload=N\u00e3o foi poss\u00edvel analisar o gadget em {0} para pr\u00e9-carregamento.

##ProxyingVisitor
uriExceptionParsing=Ocorreu uma excep\u00e7\u00e3o de URI (Uniform Resource Identifier) ao analisar o gadget em {0}.

##TemplateRewriter
malformedTemplateLib=Ocorreram excep\u00e7\u00f5es, devido a bibliotecas de modelos incorrectas.

##CajaContnetRewriter
cajoledCacheCreated=Foi criada uma cache compilada em Caja.
retrieveReference=A obter {0}.
unableToCajole=O gadget em {0} n\u00e3o pode ser compilado em Caja.

##ConcatProxyServlet
concatProxyRequestFailed=Ocorreu o seguinte erro ao solicitar um proxy concatenado: {0}.

##GadgetRenderingServlet
malformedTtlValue=Um valor de TTL (Time To Live) n\u00e3o v\u00e1lido de {0} foi ignorado.

##HttpRequestHandler
gadgetCreationError=Ocorreu um erro ao criar o gadget para gravar novamente.  A resposta est\u00e1 a ser gravada novamente sem o gadget.

##ProxyServlet
embededImgWrongDomain=O pedido para incorporar o URL {0} foi efectuado no dom\u00ednio incorrecto {1}.

##DefaultTemplateProcessor
elFailure=Ocorreu o seguinte erro de EL para o gadget em {0}: {1}.

##UriUtils
skipIllegalHeader=O cabe\u00e7alho {0} n\u00e3o \u00e9 permitido e vai ser ignorado. Ocorreu o seguinte erro: {1}.

##AbstractSpecFactory
updateSpecFailureUseCacheVersion=Ocorreu um erro ao actualizar {0}. Foi devolvido o c\u00f3digo de estado {1}. Excep\u00e7\u00e3o: {2}. Em alternativa, est\u00e1 a ser utilizada a vers\u00e3o colocada em cache.
updateSpecFailureApplyNegCache=Ocorreu um erro ao actualizar {0}. Foi devolvido o c\u00f3digo de estado {1}. Excep\u00e7\u00e3o: {2}. Est\u00e1 a ser aplicada uma cache negativa.

##HashLockedDomainService
noLockedDomainConfig=N\u00e3o existe uma configura\u00e7\u00e3o de dom\u00ednio bloqueado para {0}.

##Bootstrap
startingConnManagerWith=O gestor de liga\u00e7\u00f5es com as propriedades {0} est\u00e1 a iniciar.

##XSDValidator
resolveResource=Os seguintes recursos est\u00e3o a ser processados: {0}, {1}, {2}, {3}.
failedToValidate=Ocorreu um erro ao validar {0}.

##DefaultRequestPipeline
cachedResponse=A devolver a resposta colocada em cache para o pedido para {0}.
staleResponse="Ocorreu um erro ao solicitar o recurso em {0}, mas existe uma resposta anterior na cache. A devolver uma resposta possivelmente obsoleta a partir da cache.
