# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR


##AuthenticationServletFilter
errorParsingSecureToken=La se\u00f1al de seguridad o credencial no tiene formato correcto y no se puede analizar.

##XmlUtil
errorParsingXML=Error al analizar el XML. Se puede ignorar.
errorParsingExternalGeneralEntities=El procesador XML que se est\u00e1 usando cargar\u00e1 entidades generales externas.
errorParsingExternalParameterEntities=El procesador XML que se est\u00e1 usando cargar\u00e1 entidades de par\u00e1metros externos.
errorParsingExternalDTD=El procesador XML que se est\u00e1 usando cargar\u00e1 Definiciones de tipos de documento (DTD).
errorNotUsingSecureXML=El procesador XML que se est\u00e1 usando no tiene soporte para el an\u00e1lisis seguro.
reuseDocumentBuilders=Los constructores de documentos se est\u00e1n reutilizando.
notReuseDocBuilders=Los constructores de documentos no se est\u00e1n reutilizando.

##LruCacheProvider
LRUCapacity=La capacidad Menos usada recientemente (LRU, por sus siglas en ingl\u00e9s) {0} est\u00e1 configurada para {1}.

##DynamicConfigProperty
evalExpressionFailed={0} no se puede evaluar.

##JsonContainerConfigLoader
readingContainerConfig=La configuraci\u00f3n del contenedor {0} se est\u00e1 leyendo.
loadFromString={0} no se puede analizar.

##JsonContainerConfigLoader, FeatureRegistry
loadResourcesFrom=Los recursos de {0} se est\u00e1n cargando.

##JsonContainerConfigLoader, FeatureRegistry
loadFilesFrom=Los archivos de {0} se est\u00e1n cargando.

##ApiServlet
apiServletProtocolException=Se devuelve un error de respuesta porque se ha producido una excepci\u00f3n de protocolo.
apiServletException=Se devuelve un error de respuesta porque se ha producido una excepci\u00f3n de protocolo.

##FeatureRegistry
overridingFeature=La caracter\u00edstica {0} con definici\u00f3n en {1} se sobrescribe.

##FeatureResourceLoader
missingFile=El archivo {0} exist\u00eda antes, pero ahora falta.
unableRetrieveLib=La biblioteca remota desde {0} no se puede recuperar.

##BasicHttpFetcher
timeoutException={0} ha superado el tiempo de espera debido a la excepci\u00f3n siguiente: {1} - {2} - {3} ms.
exceptionOccurred=Se ha producido la excepci\u00f3n siguiente al captar {0}: {1} ms transcurridos.
slowResponse={0} est\u00e1 respondiendo muy lentamente. {1} ms transcurridos.

##HttpResponseMetadataHelper
errorGettingMD5=Se ha producido un error al obtener el Resumen de mensajes 5 (Message Digest 5, MD5). El error ha sido ignorado.
errorParsingMD5=Se ha producido un error al analizar la serie Message Digest 5 (MD5) en formato UTF-8.

##OAuthModule
usingRandomKey=Se est\u00e1 usando una clave aleatoria para el cifrado del estado del lado del cliente de OAuth.
usingFile=Se est\u00e1 usando el archivo {0} para el cifrado del estado del lado del cliente de OAuth.
loadKeyFileFrom=La clave de firma de OAuth de {0} se est\u00e1 cargando.
couldNotLoadKeyFile= El archivo de claves {0} no se ha podido cargar.
couldNotLoadSignedKey=La clave de firma de OAuth no se ha cargado correctamente. Para crear una clave: \n 1. Ejecute el mandato siguiente: \n openssl req -newkey rsa:1024 -days 365 -nodes -x509 -keyout testkey.pem \\\n -out testkey.pem -subj ''/CN=mytestkey''\n openssl pkcs8 -in testkey.pem -out oauthkey.pem -topk8 -nocrypt -outform PEM\n\n. 2. Edite el archivo shindig.properties y a\u00f1ada las l\u00edneas siguientes: \n{0} =<path-to-oauthkey.pem>\n {1} =mykey\n.
failedToInit=Los consumidores de OAuth desde {0} no se han podido inicializar.

##OAuthRequest
oauthFetchFatalError=Se ha producido el error muy grave siguiente cuando OAuth captaba contenido: \n {0}.
oauthFetchErrorReprompt=Se ha producido el error siguiente cuando OAuth captaba contenido: \n \ {0}. Se vuelve a preguntar al usuario por aprobaci\u00f3n.
bogusExpired=El servidor ha devuelto una caducidad no v\u00e1lida: \n {0}.
oauthFetchUnexpectedError=Se ha producido el error muy grave siguiente cuando OAuth captaba contenido: \n {0}.
unauthenticatedOauth=OAuth no puede captar contenido porque la autenticaci\u00f3n de usuario no existe. Se ha producido el error siguiente: \n \ {0}.
invalidOauth=OAuth no puede captar contenido porque la solicitud no es v\u00e1lida. Se ha producido el error siguiente: \n \ {0}.

##CajaCssSanitizer
failedToParse=La hoja de estilo no se puede analizar.
unableToConvertScript=El nodo de script no se puede convertir a una etiqueta OpenSocial Markup Language (OSML).

##PipelineExecutor
errorPreloading=Se ha producido un error no esperado en la precarga.

##Processor
renderBlacklistedGadget=El sistema ha intentado representar el gadget siguiente en la lista negra: {0}.

##CajaResponseRewriter, CajaContentRewriter
failedToRetrieve={0} no se puede recuperar.
failedToRead={0} no se puede leer.

##DefaultServiceFetcher
httpErrorFetching=Se ha producido un error HTTP {0} al captar m\u00e9todos de servicio desde el punto final {1}.
failedToFetchService=Los m\u00e9todos del servicio del punto final {0} no se han podido captar. Se ha producido el error siguiente: {1}.
failedToParseService=Los m\u00e9todos de servicios del punto final {0} no se han podido analizar. Se ha producido el error siguiente: {1}.

##Renderer
FailedToRender=El gadget en {0} no se ha representado. Se ha producido el error siguiente: {1}.

##RenderingGadgetRewriter
unknownFeatures=Hay una o m\u00e1s caracter\u00edsticas desconocidas en las extern &libs= siguientes: {0}.
unexpectedErrorPreloading=Se ha producido un error no esperado en la precarga del gadget.

##SanitizingResponseRewriter
requestToSanitizeWithoutContent=Se ha emitido una solicitud de saneamiento sin un tipo de contenido para {0}.
requestToSanitizeUnknownContent=Se ha emitido una solicitud de saneamiento sin un tipo de contenido conocido {0} para {1}.
unableToSanitizeUnknownImg=El tipo de imagen {0} es desconocido y no se puede sanear.
unableToDetectImgType=El tipo de imagen para {0} no se puede detectar al sanear el contenido.

##BasicImageRewriter
ioErrorRewritingImg=Se ha producido el error de entrada/salida siguiente al reescribir la imagen {0}: {1}.
unknownErrorRewritingImg=Se ha producido el error siguiente al reescribir la imagen {0}: {1}.
failedToReadImg=La imagen {0} no se puede leer y se omite. Se ha producido el error siguiente: {1}.

##CssResponseRewriter
cajaCssParseFailure=Se ha producido el error siguiente al analizar la CSS de Caja: {0} para {1}.

##ImageAttributeRewriter
unableToProcessImg=El recurso de imagen {0} no se puede procesar.
unableToReadResponse=La respuesta para el recurso de imagen {0} no se puede leer.
unableToFetchImg=El recurso de imagen {0} no se puede captar.
unableToParseImg=El recurso de imagen {0} no se puede analizar.

##MutableContent
exceptionParsingContent=Se ha producido una excepci\u00f3n al analizar el contenido del gadget.

##PipelineDataGadgetRewriter
failedToParsePreload=El gadget en {0} no se ha podido analizar para precarga.

##ProxyingVisitor
uriExceptionParsing=Se ha producido una excepci\u00f3n de identificador universal de recursos (URI) al analizar el gadget en {0}.

##TemplateRewriter
malformedTemplateLib=Las excepciones se han producido porque las bibliotecas de plantillas no tiene un formato correcto.

##CajaContnetRewriter
cajoledCacheCreated=Se ha creado una memoria cach\u00e9 de caja.
retrieveReference={0} se est\u00e1 recuperando.
unableToCajole=El gadget en {0} no se puede poner en caja.

##ConcatProxyServlet
concatProxyRequestFailed=Se ha producido el error siguiente al solicitar un proxy concatenado: {0}.

##GadgetRenderingServlet
malformedTtlValue=Un valor de Tiempo de vida (TTL) no v\u00e1lido de {0} se ha ignorado.

##HttpRequestHandler
gadgetCreationError=Se ha producido un error al crear el gadget para volver a grabar.  Se est\u00e1 volviendo a grabar la respuesta sin el gadget.

##ProxyServlet
embededImgWrongDomain=La solicitud de incluir el URL {0} se ha realizado en el dominio incorrecto {1}.

##DefaultTemplateProcessor
elFailure=Se ha producido el error EL siguiente para el gadget en {0}: {1}.

##UriUtils
skipIllegalHeader=La cabecera de {0} no est\u00e1 permitida y se est\u00e1 saltando. Se ha producido el error siguiente: {1}.

##AbstractSpecFactory
updateSpecFailureUseCacheVersion=Se ha producido un error al actualizar {0}. Se ha devuelto el c\u00f3digo de estado {1}. Excepci\u00f3n: {2}. En su lugar, se est\u00e1 usando una versi\u00f3n en la memoria cach\u00e9.
updateSpecFailureApplyNegCache=Se ha producido un error al actualizar {0}. Se ha devuelto el c\u00f3digo de estado {1}. Excepci\u00f3n: {2}. Se est\u00e1 aplicando una memoria cach\u00e9 negativa.

##HashLockedDomainService
noLockedDomainConfig=Una configuraci\u00f3n de dominio bloqueada para {0} no existe.

##Bootstrap
startingConnManagerWith=El Gestor de conexiones con propiedades {0} se est\u00e1 iniciando.

##XSDValidator
resolveResource=Los recursos siguientes se est\u00e1n resolviendo: {0}, {1}, {2}, {3}.
failedToValidate=Se ha producido un error al validar {0}.

##DefaultRequestPipeline
cachedResponse=Devolviendo respuesta almacenada en memoria cach\u00e9 para la respuesta a {0}.
staleResponse="Se ha producido un error al solicitar el recurso en {0}, pero tenemos una respuesta anterior en la memoria cach\u00e9. Devolviendo una respuesta posiblemente obsoleta desde la memoria cach\u00e9.
