# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR


##AuthenticationServletFilter
errorParsingSecureToken=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u307e\u305f\u306f\u8cc7\u683c\u60c5\u5831\u306e\u5f62\u5f0f\u304c\u6b63\u3057\u304f\u306a\u3044\u305f\u3081\u3001\u69cb\u6587\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3002

##XmlUtil
errorParsingXML=XML \u306e\u69cb\u6587\u89e3\u6790\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u3053\u308c\u306f\u7121\u8996\u3057\u3066\u304b\u307e\u3044\u307e\u305b\u3093\u3002
errorParsingExternalGeneralEntities=\u4f7f\u7528\u4e2d\u306e XML \u30d7\u30ed\u30bb\u30c3\u30b5\u30fc\u306b\u3088\u308a\u3001\u5916\u90e8\u306e\u4e00\u822c\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u304c\u30ed\u30fc\u30c9\u3055\u308c\u307e\u3059\u3002
errorParsingExternalParameterEntities=\u4f7f\u7528\u4e2d\u306e XML \u30d7\u30ed\u30bb\u30c3\u30b5\u30fc\u306b\u3088\u308a\u3001\u5916\u90e8\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u30fb\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u304c\u30ed\u30fc\u30c9\u3055\u308c\u307e\u3059\u3002
errorParsingExternalDTD=\u4f7f\u7528\u4e2d\u306e XML \u30d7\u30ed\u30bb\u30c3\u30b5\u30fc\u306b\u3088\u308a\u3001\u6587\u66f8\u30bf\u30a4\u30d7\u5b9a\u7fa9 (DTD) \u304c\u30ed\u30fc\u30c9\u3055\u308c\u307e\u3059\u3002
errorNotUsingSecureXML=\u4f7f\u7528\u4e2d\u306e XML \u30d7\u30ed\u30bb\u30c3\u30b5\u30fc\u306f\u3001\u30bb\u30ad\u30e5\u30a2\u69cb\u6587\u89e3\u6790\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
reuseDocumentBuilders=\u6587\u66f8\u30d3\u30eb\u30c0\u30fc\u3092\u518d\u5229\u7528\u3057\u3066\u3044\u307e\u3059\u3002
notReuseDocBuilders=\u6587\u66f8\u30d3\u30eb\u30c0\u30fc\u306f\u518d\u5229\u7528\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

##LruCacheProvider
LRUCapacity=\u6700\u9577\u672a\u4f7f\u7528\u6642\u9593 (LRU) \u5bb9\u91cf {0} \u304c {1} \u7528\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002

##DynamicConfigProperty
evalExpressionFailed={0} \u3092\u8a55\u4fa1\u3067\u304d\u307e\u305b\u3093\u3002

##JsonContainerConfigLoader
readingContainerConfig=\u30b3\u30f3\u30c6\u30ca\u30fc\u69cb\u6210 {0} \u3092\u8aad\u307f\u53d6\u3063\u3066\u3044\u307e\u3059\u3002
loadFromString={0} \u3092\u69cb\u6587\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3002

##JsonContainerConfigLoader, FeatureRegistry
loadResourcesFrom={0} \u304b\u3089\u306e\u30ea\u30bd\u30fc\u30b9\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059\u3002

##JsonContainerConfigLoader, FeatureRegistry
loadFilesFrom={0} \u304b\u3089\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059\u3002

##ApiServlet
apiServletProtocolException=\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\u304c\u767a\u751f\u3057\u305f\u305f\u3081\u3001\u5fdc\u7b54\u30a8\u30e9\u30fc\u304c\u8fd4\u3055\u308c\u3066\u3044\u307e\u3059\u3002
apiServletException=\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\u304c\u767a\u751f\u3057\u305f\u305f\u3081\u3001\u5fdc\u7b54\u30a8\u30e9\u30fc\u304c\u8fd4\u3055\u308c\u3066\u3044\u307e\u3059\u3002

##FeatureRegistry
overridingFeature={1} \u3067\u306e\u5b9a\u7fa9\u3092\u6301\u3064 {0} \u6a5f\u80fd\u304c\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u3066\u3044\u307e\u3059\u3002

##FeatureResourceLoader
missingFile=\u30d5\u30a1\u30a4\u30eb {0} \u306f\u4ee5\u524d\u306f\u5b58\u5728\u3057\u3066\u3044\u307e\u3057\u305f\u304c\u3001\u73fe\u5728\u306f\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093\u3002
unableRetrieveLib={0} \u304b\u3089\u306e\u30ea\u30e2\u30fc\u30c8\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002

##BasicHttpFetcher
timeoutException={0} \u306f\u3001\u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u306b\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306b\u306a\u308a\u307e\u3057\u305f: {1} - {2} - {3} \u30df\u30ea\u79d2\u3002
exceptionOccurred={0} \u3092\u30d5\u30a7\u30c3\u30c1\u3059\u308b\u969b\u306b\u3001\u6b21\u306e\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1} \u30df\u30ea\u79d2\u7d4c\u904e\u3002
slowResponse={0} \u304b\u3089\u306e\u5fdc\u7b54\u306b\u6642\u9593\u304c\u304b\u304b\u3063\u3066\u3044\u307e\u3059\u3002 {1} \u30df\u30ea\u79d2\u7d4c\u904e\u3002

##HttpResponseMetadataHelper
errorGettingMD5=Message Digest 5 (MD5) \u306e\u53d6\u5f97\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30a8\u30e9\u30fc\u306f\u7121\u8996\u3055\u308c\u307e\u3057\u305f\u3002
errorParsingMD5=UTF-8 \u5f62\u5f0f\u306e Message Digest 5 (MD5) \u30b9\u30c8\u30ea\u30f3\u30b0\u306e\u69cb\u6587\u89e3\u6790\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

##OAuthModule
usingRandomKey=OAuth \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30b5\u30a4\u30c9\u72b6\u614b\u6697\u53f7\u5316\u7528\u306e\u30e9\u30f3\u30c0\u30e0\u9375\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
usingFile=OAuth \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30b5\u30a4\u30c9\u72b6\u614b\u6697\u53f7\u5316\u7528\u306e {0} \u30d5\u30a1\u30a4\u30eb\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
loadKeyFileFrom={0} \u304b\u3089\u306e OAuth \u7f72\u540d\u9375\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059\u3002
couldNotLoadKeyFile= {0} \u9375\u30d5\u30a1\u30a4\u30eb\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
couldNotLoadSignedKey=OAuth \u7f72\u540d\u9375\u304c\u6b63\u3057\u304f\u30ed\u30fc\u30c9\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u9375\u3092\u4f5c\u6210\u3059\u308b\u306b\u306f\u3001\u4ee5\u4e0b\u306e\u624b\u9806\u3092\u5b9f\u884c\u3057\u307e\u3059\u3002\n 1. \u4ee5\u4e0b\u306e\u30b3\u30de\u30f3\u30c9\u3092\u5b9f\u884c\u3057\u307e\u3059\u3002 \n openssl req -newkey rsa:1024 -days 365 -nodes -x509 -keyout testkey.pem \\\n -out testkey.pem -subj ''/CN=mytestkey''\n openssl pkcs8 -in testkey.pem -out oauthkey.pem -topk8 -nocrypt -outform PEM\n\n. 2. \u4ee5\u4e0b\u306e\u884c\u3092\u8ffd\u52a0\u3057\u3066\u3001shindig.properties \u30d5\u30a1\u30a4\u30eb\u3092\u7de8\u96c6\u3057\u307e\u3059\u3002 \n{0} =<path-to-oauthkey.pem>\n {1} =mykey\n.
failedToInit={0} \u306e OAuth \u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u306e\u521d\u671f\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002

##OAuthRequest
oauthFetchFatalError=OAuth \u306b\u3088\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u53d6\u308a\u51fa\u3059\u3068\u304d\u306b\u3001\u4ee5\u4e0b\u306e\u81f4\u547d\u7684\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: \n {0}\u3002
oauthFetchErrorReprompt=OAuth \u306b\u3088\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u53d6\u308a\u51fa\u3059\u3068\u304d\u306b\u3001\u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: \n {0}\u3002 \u30e6\u30fc\u30b6\u30fc\u306b\u5bfe\u3057\u3066\u3001\u627f\u8a8d\u3092\u6c42\u3081\u308b\u30d7\u30ed\u30f3\u30d7\u30c8\u304c\u518d\u5ea6\u8868\u793a\u3055\u308c\u307e\u3059\u3002
bogusExpired=\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u7121\u52b9\u306a\u6709\u52b9\u671f\u9650\u304c\u8fd4\u3055\u308c\u307e\u3057\u305f:\n {0}\u3002
oauthFetchUnexpectedError=OAuth \u306b\u3088\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u53d6\u308a\u51fa\u3059\u3068\u304d\u306b\u3001\u4ee5\u4e0b\u306e\u81f4\u547d\u7684\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: \n {0}\u3002
unauthenticatedOauth=\u30e6\u30fc\u30b6\u30fc\u8a8d\u8a3c\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001OAuth \u306f\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u53d6\u308a\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002 \u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: \n {0}\u3002
invalidOauth=\u8981\u6c42\u304c\u7121\u52b9\u3067\u3042\u308b\u305f\u3081\u3001OAuth \u306f\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u53d6\u308a\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002 \u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: \n {0}\u3002

##CajaCssSanitizer
failedToParse=\u30b9\u30bf\u30a4\u30eb\u30fb\u30b7\u30fc\u30c8\u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3002
unableToConvertScript=\u30b9\u30af\u30ea\u30d7\u30c8\u30fb\u30ce\u30fc\u30c9\u3092 OpenSocial Markup Language (OSML) \u30bf\u30b0\u306b\u5909\u63db\u3067\u304d\u307e\u305b\u3093\u3002

##PipelineExecutor
errorPreloading=\u30d7\u30ea\u30ed\u30fc\u30c9\u6642\u306b\u4e88\u671f\u3057\u306a\u3044\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

##Processor
renderBlacklistedGadget=\u30d6\u30e9\u30c3\u30af\u30ea\u30b9\u30c8\u306b\u767b\u9332\u3055\u308c\u3066\u3044\u308b\u6b21\u306e\u30ac\u30b8\u30a7\u30c3\u30c8\u3092\u3001\u30b7\u30b9\u30c6\u30e0\u304c\u30ec\u30f3\u30c0\u30ea\u30f3\u30b0\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f: {0}\u3002

##CajaResponseRewriter, CajaContentRewriter
failedToRetrieve={0} \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
failedToRead={0} \u3092\u8aad\u307f\u53d6\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002

##DefaultServiceFetcher
httpErrorFetching={1} \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u304b\u3089\u30b5\u30fc\u30d3\u30b9\u30fb\u30e1\u30bd\u30c3\u30c9\u3092\u53d6\u308a\u51fa\u3059\u3068\u304d\u306b HTTP {0} \u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
failedToFetchService={0} \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u304b\u3089\u306e\u30b5\u30fc\u30d3\u30b9\u30fb\u30e1\u30bd\u30c3\u30c9\u3092\u53d6\u308a\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}\u3002
failedToParseService={0} \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u304b\u3089\u306e\u30b5\u30fc\u30d3\u30b9\u30fb\u30e1\u30bd\u30c3\u30c9\u3092\u69cb\u6587\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}\u3002

##Renderer
FailedToRender={0} \u306b\u3042\u308b\u30ac\u30b8\u30a7\u30c3\u30c8\u304c\u30ec\u30f3\u30c0\u30ea\u30f3\u30b0\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}\u3002

##RenderingGadgetRewriter
unknownFeatures=1 \u3064\u4ee5\u4e0a\u306e\u4e0d\u660e\u306a\u6a5f\u80fd\u304c\u4ee5\u4e0b\u306e extern &libs= \u306b\u5b58\u5728\u3057\u307e\u3059: {0}\u3002
unexpectedErrorPreloading=\u30ac\u30b8\u30a7\u30c3\u30c8\u306e\u30d7\u30ea\u30ed\u30fc\u30c9\u6642\u306b\u4e88\u671f\u3057\u306a\u3044\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

##SanitizingResponseRewriter
requestToSanitizeWithoutContent=\u30b5\u30cb\u30bf\u30a4\u30ba\u8981\u6c42\u304c\u767a\u884c\u3055\u308c\u307e\u3057\u305f\u304c\u3001{0} \u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u30fb\u30bf\u30a4\u30d7\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
requestToSanitizeUnknownContent=\u30b5\u30cb\u30bf\u30a4\u30ba\u8981\u6c42\u304c\u767a\u884c\u3055\u308c\u307e\u3057\u305f\u304c\u3001{1} \u306e\u65e2\u77e5\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u30fb\u30bf\u30a4\u30d7 {0} \u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
unableToSanitizeUnknownImg=\u30a4\u30e1\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7 {0} \u304c\u4e0d\u660e\u3067\u3042\u308b\u305f\u3081\u3001\u30b5\u30cb\u30bf\u30a4\u30ba\u3067\u304d\u307e\u305b\u3093\u3002
unableToDetectImgType=\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u30b5\u30cb\u30bf\u30a4\u30ba\u3059\u308b\u3068\u304d\u306b\u3001{0} \u306e\u30a4\u30e1\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7\u3092\u691c\u51fa\u3067\u304d\u307e\u305b\u3093\u3002

##BasicImageRewriter
ioErrorRewritingImg={0} \u30a4\u30e1\u30fc\u30b8\u306e\u518d\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u4ee5\u4e0b\u306e\u5165\u51fa\u529b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}\u3002
unknownErrorRewritingImg={0} \u30a4\u30e1\u30fc\u30b8\u306e\u518d\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}\u3002
failedToReadImg={0} \u30a4\u30e1\u30fc\u30b8\u3092\u8aad\u307f\u53d6\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u30a4\u30e1\u30fc\u30b8\u3092\u30b9\u30ad\u30c3\u30d7\u3057\u3066\u3044\u307e\u3059\u3002 \u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}\u3002

##CssResponseRewriter
cajaCssParseFailure={1} \u306e Caja CSS {0} \u306e\u69cb\u6587\u89e3\u6790\u6642\u306b\u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

##ImageAttributeRewriter
unableToProcessImg={0} \u30a4\u30e1\u30fc\u30b8\u30fb\u30ea\u30bd\u30fc\u30b9\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002
unableToReadResponse={0} \u30a4\u30e1\u30fc\u30b8\u30fb\u30ea\u30bd\u30fc\u30b9\u306e\u5fdc\u7b54\u3092\u8aad\u307f\u53d6\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
unableToFetchImg={0} \u30a4\u30e1\u30fc\u30b8\u30fb\u30ea\u30bd\u30fc\u30b9\u3092\u53d6\u308a\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
unableToParseImg={0} \u30a4\u30e1\u30fc\u30b8\u30fb\u30ea\u30bd\u30fc\u30b9\u3092\u69cb\u6587\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3002

##MutableContent
exceptionParsingContent=\u30ac\u30b8\u30a7\u30c3\u30c8\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u69cb\u6587\u89e3\u6790\u6642\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

##PipelineDataGadgetRewriter
failedToParsePreload={0} \u306b\u3042\u308b\u30ac\u30b8\u30a7\u30c3\u30c8\u3092\u3001\u30d7\u30ea\u30ed\u30fc\u30c9\u7528\u306b\u69cb\u6587\u89e3\u6790\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

##ProxyingVisitor
uriExceptionParsing={0} \u306b\u3042\u308b\u30ac\u30b8\u30a7\u30c3\u30c8\u306e\u69cb\u6587\u89e3\u6790\u4e2d\u306b Uniform Resource Identifier (URI) \u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

##TemplateRewriter
malformedTemplateLib=\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306e\u5f62\u5f0f\u304c\u6b63\u3057\u304f\u306a\u3044\u305f\u3081\u3001\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

##CajaContnetRewriter
cajoledCacheCreated=\u30b3\u30f3\u30d1\u30a4\u30eb\u3055\u308c\u305f\u30ad\u30e3\u30c3\u30b7\u30e5\u304c\u4f5c\u6210\u3055\u308c\u307e\u3057\u305f\u3002
retrieveReference={0} \u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u3059\u3002
unableToCajole={0} \u306b\u3042\u308b\u30ac\u30b8\u30a7\u30c3\u30c8\u3092\u30b3\u30f3\u30d1\u30a4\u30eb\u3067\u304d\u307e\u305b\u3093\u3002

##ConcatProxyServlet
concatProxyRequestFailed=\u9023\u7d50\u3055\u308c\u305f\u30d7\u30ed\u30ad\u30b7\u30fc\u306e\u8981\u6c42\u6642\u306b\u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}\u3002

##GadgetRenderingServlet
malformedTtlValue=\u7121\u52b9\u306a\u5b58\u7d9a\u6642\u9593 (TTL) \u306e\u5024 {0} \u306f\u7121\u8996\u3055\u308c\u307e\u3057\u305f\u3002

##HttpRequestHandler
gadgetCreationError=\u518d\u66f8\u304d\u8fbc\u307f\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306e\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002  \u30ac\u30b8\u30a7\u30c3\u30c8\u306a\u3057\u3067\u5fdc\u7b54\u3092\u518d\u66f8\u304d\u8fbc\u307f\u3057\u3066\u3044\u307e\u3059\u3002

##ProxyServlet
embededImgWrongDomain=URL {0} \u3092\u57cb\u3081\u8fbc\u3080\u8981\u6c42\u304c\u3001\u8aa4\u3063\u305f\u30c9\u30e1\u30a4\u30f3 {1} \u306b\u5bfe\u3057\u3066\u767a\u884c\u3055\u308c\u307e\u3057\u305f\u3002

##DefaultTemplateProcessor
elFailure={0} \u306b\u3042\u308b\u30ac\u30b8\u30a7\u30c3\u30c8\u3067\u3001\u4ee5\u4e0b\u306e EL \u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}\u3002

##UriUtils
skipIllegalHeader={0} \u30d8\u30c3\u30c0\u30fc\u306f\u6b63\u3057\u304f\u306a\u3044\u305f\u3081\u30b9\u30ad\u30c3\u30d7\u3055\u308c\u307e\u3059\u3002 \u4ee5\u4e0b\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}\u3002

##AbstractSpecFactory
updateSpecFailureUseCacheVersion={0} \u306e\u66f4\u65b0\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u72b6\u6cc1\u30b3\u30fc\u30c9 {1} \u304c\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002 \u4f8b\u5916: {2} \u4ee3\u308f\u308a\u306b\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u3055\u308c\u305f\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
updateSpecFailureApplyNegCache={0} \u306e\u66f4\u65b0\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u72b6\u6cc1\u30b3\u30fc\u30c9 {1} \u304c\u8fd4\u3055\u308c\u307e\u3057\u305f\u3002 \u4f8b\u5916: {2} \u30cd\u30ac\u30c6\u30a3\u30d6\u30fb\u30ad\u30e3\u30c3\u30b7\u30e5\u304c\u9069\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002

##HashLockedDomainService
noLockedDomainConfig={0} \u306e\u30ed\u30c3\u30af\u6e08\u307f\u30c9\u30e1\u30a4\u30f3\u69cb\u6210\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002

##Bootstrap
startingConnManagerWith={0} \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u6301\u3064\u63a5\u7d9a\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u958b\u59cb\u3057\u3066\u3044\u307e\u3059\u3002

##XSDValidator
resolveResource=\u4ee5\u4e0b\u306e\u30ea\u30bd\u30fc\u30b9\u3092\u89e3\u6c7a\u3057\u3066\u3044\u307e\u3059: {0}\u3001{1}\u3001{2}\u3001{3}\u3002
failedToValidate={0} \u306e\u691c\u8a3c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

##DefaultRequestPipeline
cachedResponse={0} \u3078\u306e\u8981\u6c42\u306b\u5bfe\u3057\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u3055\u308c\u305f\u5fdc\u7b54\u3092\u8fd4\u3057\u3066\u3044\u307e\u3059\u3002
staleResponse="{0} \u306e\u30ea\u30bd\u30fc\u30b9\u306b\u5bfe\u3059\u308b\u8981\u6c42\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u304c\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u5185\u306b\u4ee5\u524d\u306e\u5fdc\u7b54\u304c\u3042\u308a\u307e\u3059\u3002\u6574\u5408\u3057\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u306e\u3042\u308b\u5fdc\u7b54\u3092\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u8fd4\u3057\u3066\u3044\u307e\u3059\u3002
