# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= {0} detectou um erro:
authorization_code_problem=O c\u00f3digo de autoriza\u00e7\u00e3o est\u00e1 a ser permutado para o s\u00edmbolo de acesso: {0}
authorization_code_problem.explanation=Ocorreu um erro ao permutar o c\u00f3digo de autoriza\u00e7\u00e3o para access_token.
authorize_problem=O processo de autoriza\u00e7\u00e3o para {0} est\u00e1 a iniciar.
authorize_problem.explanation=Ocorreu um erro ao iniciar o processo de autoriza\u00e7\u00e3o.
callback_problem=A resposta de redireccionamento est\u00e1 a ser processada: {0}
callback_problem.explanation=Ocorreu um erro ao processar a resposta de redireccionamento a partir do fornecedor de servi\u00e7os.
client_credentials_problem=O access_token est\u00e1 a ser obtido a partir do cliente com as seguintes credenciais de cliente: {0}
client_credentials_problem.explanation=Ocorreu um erro ao obter o s\u00edmbolo de acesso no fluxo client_credentials.
fetch_init_problem=O OAuth2Request est\u00e1 a inicializar: {0}
fetch_init_problem.explanation=Ocorreu um erro de n\u00edvel inferior ao inicializar a obten\u00e7\u00e3o de OAuth2Request.
fetch_problem=a executar OAuth2Request.fetch() : {0}
fetch_problem.explanation=Ocorreu um erro ao emitir a obten\u00e7\u00e3o de OAuth2Request.
gadget_spec_problem=A seguinte especifica\u00e7\u00e3o de gadget est\u00e1 a ser processada: {0}
gadget_spec_problem.explanation=N\u00e3o foi localizada uma especifica\u00e7\u00e3o do gadget. Solicite ao administrador que configure o gadget para funcionar com o OAuth2.0.
get_oauth2_accessor_problem=a obter um OAuth2Accessor para o OAuth2Request : {0}
get_oauth2_accessor_problem.explanation=Ocorreu um erro. Solicite ao administrador que crie uma associa\u00e7\u00e3o de cliente do OAuth2.0 para este gadget e servi\u00e7o.
lookup_spec_problem=A especifica\u00e7\u00e3o do gadget est\u00e1 a ser obtida: {0}
lookup_spec_problem.explanation=N\u00e3o foi localizada uma especifica\u00e7\u00e3o do gadget. Solicite ao administrador que configure o gadget para funcionar com o OAuth2.0.
missing_fetch_params=Os seguintes par\u00e2metros de obten\u00e7\u00e3o requeridos est\u00e3o em falta: {0}
missing_fetch_params.explanation=O m\u00e9todo fetch() foi invocado com par\u00e2metros incorrectos.
missing_server_response=Ocorreu um erro durante a resposta do fornecedor de servi\u00e7os do OAuth2.0: {0}
missing_server_response.explanation=O servidor criou um OAuth2Request v\u00e1lido, mas n\u00e3o conseguiu emitir o pedido ou obter uma resposta v\u00e1lida a partir do fornecedor de servi\u00e7os.
no_response_handler=Uma rotina de tratamento de respostas n\u00e3o processou a seguinte resposta: {0}
no_response_handler.explanation=A rotina de tratamento de respostas n\u00e3o existe para processar a autoriza\u00e7\u00e3o e os pontos finais de s\u00edmbolos. AuthorizationEndpointResponseHandler ou TokenEndpointResponseHandler.
no_gadget_spec=N\u00e3o \u00e9 poss\u00edvel localizar a especifica\u00e7\u00e3o do gadget para {0}.
no_gadget_spec.explanation=N\u00e3o foi localizada uma especifica\u00e7\u00e3o do gadget. Solicite ao administrador que configure o gadget para funcionar com o OAuth2.0.
refresh_token_problem=O s\u00edmbolo de actualiza\u00e7\u00e3o est\u00e1 a ser permutado para access_token: {0}
refresh_token_problem.explanation=Ocorreu um erro ao permutar o s\u00edmbolo de actualiza\u00e7\u00e3o para o s\u00edmbolo de acesso.
secret_encryption_problem=O c\u00f3digo do s\u00edmbolo est\u00e1 a ser encriptado para persist\u00eancia: {0}
secret_encryption_problem.explanation=Ocorreu um erro ao armazenar os c\u00f3digos do OAuth2.0 com o m\u00f3dulo de encripta\u00e7\u00e3o fornecido.
access_denied=O acesso foi recusado.
access_denied.explanation=O utilizador recusou ou cancelou a autoriza\u00e7\u00e3o com o fornecedor de servi\u00e7os.
invalid_client=O cliente n\u00e3o \u00e9 v\u00e1lido: {0}
invalid_client.explanation= N\u00e3o \u00e9 poss\u00edvel autenticar o cliente, possivelmente devido ao facto de o cliente ser desconhecido. A autentica\u00e7\u00e3o do cliente n\u00e3o foi inclu\u00edda ou o m\u00e9todo de autentica\u00e7\u00e3o n\u00e3o \u00e9 suportado.
invalid_grant=A concess\u00e3o de autoriza\u00e7\u00e3o n\u00e3o \u00e9 v\u00e1lida: {0}
invalid_grant.explanation=A concess\u00e3o de autoriza\u00e7\u00e3o n\u00e3o \u00e9 v\u00e1lida, expirou, foi revogada, n\u00e3o corresponde ao URI de redireccionamento utilizado no pedido de autoriza\u00e7\u00e3o ou foi emitida por outro cliente. A concess\u00e3o de autoriza\u00e7\u00e3o pode incluir o c\u00f3digo de autoriza\u00e7\u00e3o, as credenciais do propriet\u00e1rio do recurso ou as credenciais do cliente.
invalid_request=O pedido n\u00e3o \u00e9 v\u00e1lido: {0}
invalid_request.explanation=O pedido n\u00e3o \u00e9 v\u00e1lido, uma vez que n\u00e3o cont\u00e9m um par\u00e2metro requerido, inclui um valor de par\u00e2metro n\u00e3o suportado, repete um par\u00e2metro, inclui v\u00e1rias credenciais, utiliza mais do que um mecanismo para autentica\u00e7\u00e3o do cliente ou est\u00e1 incorrecto.
invalid_scope=O \u00e2mbito n\u00e3o \u00e9 v\u00e1lido: {0}
invalid_scope.explanation=O \u00e2mbito solicitado n\u00e3o \u00e9 v\u00e1lido, \u00e9 desconhecido, est\u00e1 incorrecto ou excede o \u00e2mbito concedido pelo propriet\u00e1rio do recurso.
server_error=Ocorreu um erro de servidor: {0}
server_error.explanation=O servidor de autoriza\u00e7\u00f5es detectou uma condi\u00e7\u00e3o inesperada que impediu o mesmo de concluir o pedido.
server_rejected_request=O servidor rejeitou o pedido: c\u00f3digo de estado = {0}
server_rejected_request.explanation=O servidor criou um OAuth2Request, mas o fornecedor de servi\u00e7os rejeitou o mesmo.
temporarily_unavailable=O servi\u00e7o est\u00e1 temporariamente indispon\u00edvel: {0}
temporarily_unavailable.explanation=N\u00e3o \u00e9 poss\u00edvel ao servidor de autoriza\u00e7\u00f5es processar o pedido, uma vez que este est\u00e1 temporariamente sobrecarregado ou em modo de manuten\u00e7\u00e3o.
token_response_problem=A resposta do ponto final do s\u00edmbolo est\u00e1 a ser processada: {0}
token_response_problem.explanation=O ponto final do s\u00edmbolo enviou uma resposta que o servidor n\u00e3o conseguiu processar.
unauthorized_client=O cliente n\u00e3o est\u00e1 autorizado: {0}
unauthorized_client.explanation=O cliente n\u00e3o est\u00e1 autorizado a solicitar um s\u00edmbolo de acesso utilizando este m\u00e9todo.
unsupported_grant_type=O tipo de concess\u00e3o n\u00e3o \u00e9 suportado: {0}
unsupported_grant_type.explanation=O servidor de autoriza\u00e7\u00f5es n\u00e3o suporta a obten\u00e7\u00e3o de um s\u00edmbolo de acesso utilizando este m\u00e9todo.
unsupported_response_type=O tipo de resposta n\u00e3o \u00e9 suportado: {0}
unsupported_response_type.explanation=O servidor de autoriza\u00e7\u00f5es n\u00e3o suporta a obten\u00e7\u00e3o de um c\u00f3digo de autoriza\u00e7\u00e3o utilizando este m\u00e9todo.
mac_token_problem=O s\u00edmbolo mac est\u00e1 a ser solicitado: {0}
mac_token_problem.explanation=N\u00e3o foi poss\u00edvel adicionar o s\u00edmbolo mac no pedido ao servidor de recursos.
bearer_token_problem=O s\u00edmbolo bearer est\u00e1 a ser solicitado: {0}
bearer_token_problem.explanation=N\u00e3o foi poss\u00edvel adicionar o s\u00edmbolo bearer no pedido ao servidor de recursos.
authentication_problem=A autentica\u00e7\u00e3o do cliente est\u00e1 a ser adicionada: {0}
authentication_problem.explanation=N\u00e3o foi poss\u00edvel adicionar os cabe\u00e7alhos de autentica\u00e7\u00e3o ao pedido.
unknown_problem=Ocorreu um erro desconhecido: {0}
unknown_problem.explanation=Solicite ao administrador do sistema que investigue o problema.
code_grant_problem=O s\u00edmbolo de acesso est\u00e1 a ser obtido a partir do c\u00f3digo de autoriza\u00e7\u00e3o: {0}
code_grant_problem.explanation=Ocorreu um erro durante o fluxo de c\u00f3digos de autoriza\u00e7\u00e3o.
