# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= {0} encontrou um erro :
authorization_code_problem=O c\u00f3digo de autoriza\u00e7\u00e3o est\u00e1 sendo trocado para o token de acesso: {0}
authorization_code_problem.explanation=Ocorreu um erro ao trocar o c\u00f3digo de autoriza\u00e7\u00e3o para o token_de_acesso.
authorize_problem=O processo de autoriza\u00e7\u00e3o para {0} est\u00e1 sendo iniciado.
authorize_problem.explanation=Ocorreu um erro ao iniciar o processo de autoriza\u00e7\u00e3o.
callback_problem=A resposta de redirecionamento est\u00e1 sendo processada: {0}
callback_problem.explanation=Ocorreu um erro ao processar a resposta de redirecionamento do provedor de servi\u00e7os.
client_credentials_problem=O token_de_acesso est\u00e1 sendo recuperado para o cliente com a seguinte credencial do cliente: {0}
client_credentials_problem.explanation=Ocorreu um erro ao recuperar o token de acesso no fluxo de credenciais_do_cliente.
fetch_init_problem=O OAuth2Request est\u00e1 sendo inicializado: {0}
fetch_init_problem.explanation=Um erro de n\u00edvel inferior ocorreu ao inicializar a busca OAuth2Request.
fetch_problem=executando OAuth2Request.fetch() : {0}
fetch_problem.explanation=Ocorreu um erro ao emitir a busca OAuth2Request.
gadget_spec_problem=A seguinte especifica\u00e7\u00e3o de dispositivo est\u00e1 em processamento: {0}
gadget_spec_problem.explanation=Uma especifica\u00e7\u00e3o de dispositivo n\u00e3o foi localizada.  Pe\u00e7a ao administrador para configurar seu dispositivo para funcionar com OAuth2.0.
get_oauth2_accessor_problem=obtendo um OAuth2Accessor para o OAuth2Request: {0}
get_oauth2_accessor_problem.explanation=Ocorreu um erro. Pe\u00e7a ao seu administrador para criar uma liga\u00e7\u00e3o do Cliente OAuth2.0 para esse dispositivo e servi\u00e7o.
lookup_spec_problem=A especifica\u00e7\u00e3o de dispositivo est\u00e1 sendo recuperada: {0}
lookup_spec_problem.explanation=Uma especifica\u00e7\u00e3o de dispositivo n\u00e3o foi localizada.  Pe\u00e7a ao administrador para configurar seu dispositivo para funcionar com OAuth2.0.
missing_fetch_params=Os seguintes par\u00e2metros de busca requeridos est\u00e3o ausentes: {0}
missing_fetch_params.explanation=O m\u00e9todo fetch() foi chamado com par\u00e2metros inv\u00e1lidos.
missing_server_response=Ocorreu um erro durante a resposta do provedor de servi\u00e7os OAuth2.0: {0}
missing_server_response.explanation=O servidor criou um OAuth2Request v\u00e1lido, mas n\u00e3o p\u00f4de emitir a solicita\u00e7\u00e3o ou obter uma resposta v\u00e1lida do provedor de servi\u00e7os.
no_response_handler=Um manipulador de resposta n\u00e3o processou a seguinte resposta: {0}
no_response_handler.explanation=O manipulador de resposta n\u00e3o existe para processamento dos terminais de autoriza\u00e7\u00e3o e token. AuthorizationEndpointResponseHandler ou TokenEndpointResponseHandler.
no_gadget_spec=A especifica\u00e7\u00e3o de dispositivo para {0} n\u00e3o pode ser localizada.
no_gadget_spec.explanation=Uma especifica\u00e7\u00e3o de dispositivo n\u00e3o foi localizada.  Pe\u00e7a ao administrador para configurar seu dispositivo para funcionar com OAuth2.0.
refresh_token_problem=O token de atualiza\u00e7\u00e3o est\u00e1 sendo trocado para o token_de_acesso: {0}
refresh_token_problem.explanation=Ocorreu um erro ao trocar o token de atualiza\u00e7\u00e3o para o token de acesso.
secret_encryption_problem=O segredo do token est\u00e1 sendo criptografado para persist\u00eancia: {0}
secret_encryption_problem.explanation=Ocorreu um erro ao armazenar segredos OAuth2.0 com o m\u00f3dulo de criptografia fornecido.
access_denied=O acesso foi negado.
access_denied.explanation=O usu\u00e1rio negou ou cancelou a autoriza\u00e7\u00e3o com o provedor de servi\u00e7os.
invalid_client=O cliente \u00e9 inv\u00e1lido: {0}
invalid_client.explanation= O cliente n\u00e3o pode ser autenticado possivelmente porque n\u00e3o \u00e9 conhecido, a autentica\u00e7\u00e3o do cliente n\u00e3o estava inclu\u00edda ou o m\u00e9todo de autentica\u00e7\u00e3o n\u00e3o \u00e9 suportado.
invalid_grant=A concess\u00e3o de autoriza\u00e7\u00e3o \u00e9 inv\u00e1lida: {0}
invalid_grant.explanation=A concess\u00e3o de autoriza\u00e7\u00e3o \u00e9 inv\u00e1lida, expirou, foi revogada, n\u00e3o corresponde ao URI de redirecionamento na solicita\u00e7\u00e3o de autoriza\u00e7\u00e3o ou foi emitida para outro cliente. A concess\u00e3o de autoriza\u00e7\u00e3o pode incluir o c\u00f3digo de autoriza\u00e7\u00e3o, as credenciais do propriet\u00e1rio do recurso ou as credenciais do cliente.
invalid_request=A solicita\u00e7\u00e3o \u00e9 inv\u00e1lida: {0}
invalid_request.explanation=A solicita\u00e7\u00e3o \u00e9 inv\u00e1lida porque um par\u00e2metro necess\u00e1rio est\u00e1 ausente, inclui um valor de par\u00e2metro n\u00e3o suportado, repete um par\u00e2metro, inclui diversas credenciais, utiliza mais de um mecanismo para autenticar o cliente ou ent\u00e3o est\u00e1 malformada.
invalid_scope=O escopo \u00e9 inv\u00e1lido: {0}
invalid_scope.explanation=O escopo solicitado \u00e9 inv\u00e1lido, desconhecido, malformado ou excede o escopo concedido pelo propriet\u00e1rio do recurso.
server_error=Ocorreu um erro do servidor: {0}
server_error.explanation=O servidor de autoriza\u00e7\u00e3o encontrou uma condi\u00e7\u00e3o inesperada que o impediu de cumprir a solicita\u00e7\u00e3o.
server_rejected_request=O servidor rejeitou a solicita\u00e7\u00e3o: statuscode = {0}
server_rejected_request.explanation=O servidor criou um OAuth2Request, mas o provedor de servi\u00e7os o rejeitou.
temporarily_unavailable=O servi\u00e7o est\u00e1 temporariamente indispon\u00edvel: {0}
temporarily_unavailable.explanation=O servidor de autoriza\u00e7\u00e3o n\u00e3o pode manipular a solicita\u00e7\u00e3o porque est\u00e1 temporariamente sobrecarregado ou no modo de manuten\u00e7\u00e3o.
token_response_problem=A resposta do terminal de token est\u00e1 sendo processada: {0}
token_response_problem.explanation=O terminal de token enviou uma resposta que o servidor n\u00e3o p\u00f4de processar.
unauthorized_client=O cliente n\u00e3o est\u00e1 autorizado: {0}
unauthorized_client.explanation=O cliente n\u00e3o est\u00e1 autorizado a solicitar um token de acesso usando este m\u00e9todo.
unsupported_grant_type=O tipo de concess\u00e3o se n\u00e3o suportado: {0}
unsupported_grant_type.explanation=O servidor de autoriza\u00e7\u00e3o n\u00e3o suporta a obten\u00e7\u00e3o de um token de acesso usando este m\u00e9todo.
unsupported_response_type=O tipo de resposta n\u00e3o \u00e9 suportado: {0}
unsupported_response_type.explanation=O servidor de autoriza\u00e7\u00e3o n\u00e3o suporta a obten\u00e7\u00e3o de um c\u00f3digo de autoriza\u00e7\u00e3o usando este m\u00e9todo.
mac_token_problem=O token mac est\u00e1 sendo solicitado: {0}
mac_token_problem.explanation=O token mac na solicita\u00e7\u00e3o n\u00e3o p\u00f4de ser inclu\u00eddo no servidor de recursos.
bearer_token_problem=O token bearer est\u00e1 sendo solicitado: {0}
bearer_token_problem.explanation=O token bearer na solicita\u00e7\u00e3o n\u00e3o p\u00f4de ser inclu\u00eddo no servidor de recursos.
authentication_problem=A autentica\u00e7\u00e3o do cliente est\u00e1 sendo inclu\u00edda: {0}
authentication_problem.explanation=N\u00e3o foi poss\u00edvel incluir os cabe\u00e7alhos de autentica\u00e7\u00e3o na solicita\u00e7\u00e3o.
unknown_problem=Ocorreu um erro desconhecido: {0}
unknown_problem.explanation=Pe\u00e7a ao administrador do sistema para investigar o problema.
code_grant_problem=O token de acesso est\u00e1 sendo obtido do c\u00f3digo de autoriza\u00e7\u00e3o: {0}
code_grant_problem.explanation=Ocorreu um erro durante o fluxo do c\u00f3digo de autoriza\u00e7\u00e3o.
