# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= {0} a rencontr\u00e9 une erreur :
authorization_code_problem=Le code d''autorisation est \u00e9chang\u00e9 pour le jeton d''acc\u00e8s : {0}
authorization_code_problem.explanation=Une erreur s'est produite lors de l'\u00e9change du code d'autorisation pour access_token.
authorize_problem=Le processus d''autorisation pour {0} est en cours d''initialisation.
authorize_problem.explanation=Une erreur s'est produite lors du d\u00e9marrage du processus d'autorisation.
callback_problem=La r\u00e9ponse de redirection est en cours de traitement : {0}
callback_problem.explanation=Une erreur s'est produite lors du traitement de la r\u00e9ponse de redirection \u00e0 partir du fournisseur de services.
client_credentials_problem=access_token est en cours d''extraction pour le client avec les donn\u00e9es d''identification du client suivantes : {0}
client_credentials_problem.explanation=Une erreur s'est produite lors de l'extraction du jeton d'acc\u00e8s dans le flux client_credentials.
fetch_init_problem=OAuth2Request est en d''initialisation: {0}
fetch_init_problem.explanation=Une erreur de bas niveau s'est produite lors de l'initialisation de l'extraction de OAuth2Request.
fetch_problem=ex\u00e9cution de OAuth2Request.fetch() : {0}
fetch_problem.explanation=Une erreur s'est produite lors du lancement de l'extraction de OAuth2Request.
gadget_spec_problem=La sp\u00e9cification de gadget suivante est en cours de traitement : {0}
gadget_spec_problem.explanation=Aucune sp\u00e9cification de gadget n'a \u00e9t\u00e9 trouv\u00e9e.  Demandez \u00e0 votre administrateur de configurer votre gadget pour l'utiliser avec OAuth2.0.
get_oauth2_accessor_problem=obtention d''OAuth2Accessor pour OAuth2Request : {0}
get_oauth2_accessor_problem.explanation=Une erreur s'est produite. Demandez \u00e0 votre administrateur de cr\u00e9er un client OAuth2.0 de liaison pour cet gadget et ce service.
lookup_spec_problem=La sp\u00e9cification du gadget est en cours d''extraction : {0}
lookup_spec_problem.explanation=Aucune sp\u00e9cification de gadget n'a \u00e9t\u00e9 trouv\u00e9e.  Demandez \u00e0 votre administrateur de configurer votre gadget pour l'utiliser avec OAuth2.0.
missing_fetch_params=Les param\u00e8tres d''extraction requis suivants sont manquants : {0}
missing_fetch_params.explanation=La m\u00e9thode fetch() a \u00e9t\u00e9 appel\u00e9e avec des param\u00e8tres incorrects.
missing_server_response=Une erreur s''est produite pendant la r\u00e9ponse du fournisseur de service OAuth2.0 : {0}
missing_server_response.explanation=Le serveur a cr\u00e9\u00e9 un OAuth2Request valide, mais n'a pas pu \u00e9mettre la requ\u00eate ni obtenir une r\u00e9ponse valide \u00e0 partir du fournisseur de services.
no_response_handler=Un gestionnaire de r\u00e9ponses n''a pas trait\u00e9 la r\u00e9ponse suivante : {0}
no_response_handler.explanation=Le gestionnaire de r\u00e9ponses n'existe pas pour le traitement des noeuds finaux d'autorisation et de jeton AuthorizationEndpointResponseHandler ou TokenEndpointResponseHandler.
no_gadget_spec=La sp\u00e9cification du gadget pour {0} est introuvable.
no_gadget_spec.explanation=Aucune sp\u00e9cification de gadget n'a \u00e9t\u00e9 trouv\u00e9e.  Demandez \u00e0 votre administrateur de configurer votre gadget pour l'utiliser avec OAuth2.0.
refresh_token_problem=Le jeton d''autorisation est \u00e9chang\u00e9 contre le jeton d''acc\u00e8s : {0}
refresh_token_problem.explanation=Une erreur s'est produite lors de l'\u00e9change du token d'actualisation pour le jeton d'acc\u00e8s.
secret_encryption_problem=Le secret du jeton est chiffr\u00e9 en code bing pour assurer la persistance : {0}
secret_encryption_problem.explanation=Une erreur s'est produite lors du stockage des secrets OAuth2.0 avec le module de chiffrement fourni.
access_denied=L'acc\u00e8s a \u00e9t\u00e9 refus\u00e9.
access_denied.explanation=L'utilisateur a refus\u00e9 ou a annul\u00e9 l'autorisation aupr\u00e8s du fournisseur de services.
invalid_client=Le client n''est pas valide : {0}
invalid_client.explanation= Le client ne peut pas \u00eatre authentifi\u00e9, probablement car le client est inconnu, l'authentification du client n'\u00e9tait pas incluse ou la m\u00e9thode d'authentification n'est pas prise en charge.
invalid_grant=L''octroi d''autorisation n''est pas valide : {0}
invalid_grant.explanation=L'octroi d'autorisation n'est pas valide,a expir\u00e9, est annul\u00e9, ne correspond pas \u00e0 l'URI de redirection utilis\u00e9 dans la demande d'autorisation, ou a \u00e9t\u00e9 \u00e9mis pour un autre client. L'octroi d'autorisation peut inclure le code d'autorisation, les donn\u00e9es d'identification du propri\u00e9taire de la ressource ou les donn\u00e9es d'identification du client.
invalid_request=La requ\u00eate n''est pas valide : {0}
invalid_request.explanation=La requ\u00eate n'est pas valide, car il manque un param\u00e8tre obligatoire, elle comporte une valeur de param\u00e8tre non prise en charge, elle r\u00e9p\u00e8te un param\u00e8tre, elle comprend plusieurs donn\u00e9es d'identification, elle utilise plus d'un m\u00e9canisme d'authentification du client ou elle n'est pas correctement format\u00e9e.
invalid_scope=La port\u00e9e n''est pas valide : {0}
invalid_scope.explanation=La port\u00e9e demand\u00e9e n'est pas valide, est inconnue, mal form\u00e9e ou d\u00e9passe la port\u00e9e accord\u00e9e par le propri\u00e9taire de la ressource.
server_error=Une erreur de serveur s''est produite: {0}
server_error.explanation=Le serveur d'autorisation a rencontr\u00e9 une condition inattendue qui l'a emp\u00each\u00e9 de traiter la requ\u00eate.
server_rejected_request=Le serveur a rejet\u00e9 la requ\u00eate : statuscode = {0}
server_rejected_request.explanation=Le serveur a cr\u00e9\u00e9 une OAuth2Request, mais le fournisseur de service l'a rejet\u00e9e.
temporarily_unavailable=Le service est temporairement indisponible : {0}
temporarily_unavailable.explanation=Le serveur d'autorisation est incapable de g\u00e9rer la requ\u00eate car il est temporairement surcharg\u00e9 ou est en mode maintenance.
token_response_problem=La r\u00e9ponse provenant du noeud final de jeton est en cours de traitement : {0}
token_response_problem.explanation=Le noeud final de jeton a envoy\u00e9 une r\u00e9ponse que le serveur n'a pas pu traiter.
unauthorized_client=Le client n''est pas habilit\u00e9 : {0}
unauthorized_client.explanation=Le client n'est pas autoris\u00e9 \u00e0 demander un jeton d'acc\u00e8s \u00e0 l'aide de cette m\u00e9thode.
unsupported_grant_type=Type d''octroi si non pris en charge : {0}
unsupported_grant_type.explanation=Le serveur d'autorisation ne prend pas en charge l'obtention d'un jeton d'acc\u00e8s \u00e0 l'aide de cette m\u00e9thode.
unsupported_response_type=Le type de r\u00e9ponse n''est pas pris en charge : {0}
unsupported_response_type.explanation=Le serveur d'autorisation ne prend pas en charge l'obtention d'un code d'autorisation \u00e0 l'aide de cette m\u00e9thode.
mac_token_problem=Le jeton mac est demand\u00e9 : {0}
mac_token_problem.explanation=Le jeton mac sur la demande n'a pu \u00eatre ajout\u00e9 \u00e0 la ressource serveur.
bearer_token_problem=Le jeton bearer est demand\u00e9 : {0}
bearer_token_problem.explanation=Le jeton bearer sur la demande n'a pu \u00eatre ajout\u00e9 \u00e0 la ressource serveur.
authentication_problem=L''authentification du client est ajout\u00e9e : {0}
authentication_problem.explanation=Les en-t\u00eates d'authentification n'ont pas pu \u00eatre ajout\u00e9es \u00e0 la requ\u00eate.
unknown_problem=Une erreur inconnue s''est produite : {0}
unknown_problem.explanation=Demandez \u00e0 votre administrateur syst\u00e8me d'analyser le probl\u00e8me.
code_grant_problem=Jeton d''acc\u00e8s en cours d''obtention \u00e0 partir du code d''autorisation : {0}
code_grant_problem.explanation=Une erreur s'est produite lors du flux du code d'autorisation.
