# Licensed to the Apache Software Foundation (ASF) under one
# or more contributor license agreements.  See the NOTICE file
# distributed with this work for additional information
# regarding copyright ownership.  The ASF licenses this file
# to you under the Apache License, Version 2.0 (the
# "License"); you may not use this file except in compliance
# with the License.  You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing,
# software distributed under the License is distributed on an
# "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
# KIND, either express or implied.  See the License for the
# specific language governing permissions and limitations
# under the License.
#
# NLS_ENCODING=UNICODE
## G11N SA UI
# NLS_MESSAGEFORMAT_VAR
message_header= {0} ha riportato un errore:
authorization_code_problem=Il codice di autorizzazione sta per essere scambiato per il token di accesso: {0}
authorization_code_problem.explanation=Si \u00e8 verificato un errore durante lo scambio del codice di autorizzazione per il token di accesso.
authorize_problem=Il processo di autorizzazione per {0} sta per iniziare.
authorize_problem.explanation=Si \u00e8 verificato un errore durante l'inizializzazione del processo di autorizzazione.
callback_problem=La risposta di reindirizzamento sta per essere elaborata: {0}
callback_problem.explanation=Si \u00e8 verificato un errore durante l'elaborazione della risposta di reindirizzamento dal provider di servizi.
client_credentials_problem=Il token di accesso sta per essere richiamato per il client con le seguenti credenziali client: {0}
client_credentials_problem.explanation=Si \u00e8 verificato un errore durante il richiamo del token di accesso nel flusso delle credenziali del client.
fetch_init_problem=OAuth2Request in fase di inizializzazione: {0}
fetch_init_problem.explanation=Si \u00e8 verificato un errore di basso livello durante l'inizializzazione del caricamento di OAuth2Request.
fetch_problem=Esecuzione di OAuth2Request.fetch() in corso: {0}
fetch_problem.explanation=Si \u00e8 verificato un errore durante l'emissione del caricamento OAuth2Request.
gadget_spec_problem=La seguente specifica di gadget sta per essere elaborata: {0}
gadget_spec_problem.explanation=Non \u00e8 stata trovata una specifica di gadget.  Richiedere all'amministratore di configurare il gadget per poter utilizzare OAuth2.0.
get_oauth2_accessor_problem=Ottenimento di un OAuth2Accessor per OAuth2Request in corso: {0}
get_oauth2_accessor_problem.explanation=Si \u00e8 verificato un errore. Richiedere all'amministratore di creare un binding al client OAuth2.0 per questo gadget e il servizio.
lookup_spec_problem=La specifica di gadget sta per essere richiamata: {0}
lookup_spec_problem.explanation=Non \u00e8 stata trovata una specifica di gadget.  Richiedere all'amministratore di configurare il gadget per poter utilizzare OAuth2.0.
missing_fetch_params=I seguenti parametri di caricamento richiesti non sono presenti: {0}
missing_fetch_params.explanation=Il metodo fetch() \u00e8 stato richiamato con parametri non corretti.
missing_server_response=Si \u00e8 verificato un errore durante la risposta del provider di servizi di OAuth2.0: {0}
missing_server_response.explanation=Il server ha creato una OAuth2Request valida, ma non \u00e8 riuscito a emettere la richiesta o a ottenere una risposta valida dal provider di servizi.
no_response_handler=Un gestore di risposte non ha elaborato la seguente risposta: {0}
no_response_handler.explanation=Il gestore di risposte non esiste per l'elaborazione degli endpoint di autorizzazione e token. AuthorizationEndpointResponseHandler o TokenEndpointResponseHandler.
no_gadget_spec=Impossibile trovare la specifica di gadget per {0}.
no_gadget_spec.explanation=Non \u00e8 stata trovata una specifica di gadget.  Richiedere all'amministratore di configurare il gadget per poter utilizzare OAuth2.0.
refresh_token_problem=Il token di aggiornamento sta per essere scambiato per il token di accesso: {0}
refresh_token_problem.explanation=Si \u00e8 verificato un errore durante lo scambio del token di aggiornamento per il token di accesso.
secret_encryption_problem=Il segreto del token sta per essere crittografato per la persistenza: {0}
secret_encryption_problem.explanation=Si \u00e8 verificato un errore durante la memorizzazione dei segreti di OAuth2.0 con il modulo di crittografia fornito.
access_denied=L'accesso \u00e8 stato negato.
access_denied.explanation=L'utente ha negato o annullato l'autorizzazione con il provider di servizi.
invalid_client=Il client non \u00e8 valido: {0}
invalid_client.explanation= Il client non pu\u00f2 essere autenticato, probabilmente perch\u00e9 non \u00e8 noto, perch\u00e9 non \u00e8 stata inclusa l'autenticazione client oppure perch\u00e9 il metodo di autenticazione non \u00e8 supportato.
invalid_grant=La concessione dell''autorizzazione non \u00e8 valida: {0}
invalid_grant.explanation=La concessione dell'autorizzazione non \u00e8 valida, \u00e8 scaduta, \u00e8 stata revocata, non corrisponde all'URI di reindirizzamento utilizzato nella richiesta di autorizzazione o \u00e8 stata emessa su un altro client. La concessione dell'autorizzazione pu\u00f2 includere il codice di autorizzazione, le credenziali del proprietario della risorsa o le credenziali del client.
invalid_request=La richiesta non \u00e8 valida: {0}
invalid_request.explanation=La richiesta non \u00e8 valida perch\u00e9 non contiene un parametro richiesto, contiene il valore di un parametro non supportato, contiene un parametro ripetuto, include pi\u00f9 credenziali, utilizza pi\u00f9 di un meccanismo per l'autenticazione del client o non \u00e8 strutturata correttamente.
invalid_scope=L''ambito non \u00e8 valido: {0}
invalid_scope.explanation=L'ambito richiesto non \u00e8 valido, \u00e8 sconosciuto, non \u00e8 strutturato correttamente o supera l'ambito concesso dal proprietario della risorsa.
server_error=Si \u00e8 verificato un errore server: {0}
server_error.explanation=Il server di autorizzazione ha rilevato una condizione non prevista che ha impedito l'evasione della richiesta.
server_rejected_request=Il server ha rifiutato la richiesta: codice stato = {0}
server_rejected_request.explanation=Il server ha creato una OAuth2Request, ma il provider di servizi l'ha rifiutata.
temporarily_unavailable=Il servizio \u00e8 temporaneamente non disponibile: {0}
temporarily_unavailable.explanation=Il server di autorizzazione non \u00e8 in grado di gestire la richiesta in quanto \u00e8 temporaneamente sovraccarico o si trova in modalit\u00e0 di manutenzione.
token_response_problem=La risposta dall''endpoint del token sta per essere elaborata: {0}
token_response_problem.explanation=L'endpoint del token ha inviato una risposta che il server non ha elaborato.
unauthorized_client=Il client non \u00e8 autorizzato: {0}
unauthorized_client.explanation=Il client non \u00e8 autorizzato per richiedere un token di accesso con questo metodo.
unsupported_grant_type=Il tipo di concessione non \u00e8 supportato: {0}
unsupported_grant_type.explanation=Il server di autorizzazione non supporta l'ottenimento di un token di accesso mediante questo metodo.
unsupported_response_type=Il tipo di risposta non \u00e8 supportato: {0}
unsupported_response_type.explanation=Il server di autorizzazione non supporta l'ottenimento di un codice di autorizzazione mediante questo metodo.
mac_token_problem=Il token mac sta per essere richiesto: {0}
mac_token_problem.explanation=Il token mac sulla richiesta non \u00e8 stato aggiunto al server di risorse.
bearer_token_problem=Il token bearer sta per essere richiesto: {0}
bearer_token_problem.explanation=Il token bearer sulla richiesta non \u00e8 stato aggiunto al server di risorse.
authentication_problem=L''autenticazione client sta per essere aggiunta: {0}
authentication_problem.explanation=Le intestazioni di autenticazione non sono state aggiunte alla richiesta.
unknown_problem=Si \u00e8 verificato un errore sconosciuto: {0}
unknown_problem.explanation=Richiedere all'amministratore di analizzare il problema.
code_grant_problem=Il token di accesso sta per essere ottenuto dal codice di autorizzazione: {0}
code_grant_problem.explanation=Si \u00e8 verificato un errore durante il flusso del codice di autorizzazione.
